
&НаКлиенте
Процедура РеквизитПроцессаПриИзменении(Элемент)
	Запись.ЗначениеРеквизита=КП_Процессы.ПолучитьНачальноеЗначениеРеквизита(Запись.РеквизитПроцесса);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПроцессаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПараметрыФормы=Новый Структура("РежимВыбора", Истина);
	ПараметрыОтбора=Новый Структура("Владелец", ПолучитьВидКорпоративногоПроцесса(Запись.БизнесПроцесс));
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	РезультатОткрытия = Неопределено;

	
	ОткрытьФорму("Справочник.КП_ДополнительныеРеквизиты.ФормаСписка", ПараметрыФормы,,,,, Новый ОписаниеОповещения("РеквизитПроцессаНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПроцессаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    РезультатОткрытия=Результат;
    
    Если НЕ ЗначениеЗаполнено(РезультатОткрытия) Тогда
        Возврат;
    КонецЕсли;
    
    Запись.ЗначениеРеквизита=РезультатОткрытия;

КонецПроцедуры

&НаСервере
Функция ПолучитьВидКорпоративногоПроцесса(БизнесПроцесс)
	Возврат БизнесПроцесс.ВидПроцесса;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Элементы.ДекорацияИстория.Доступность=Ложь;
		
	Иначе
		Элементы.РеквизитПроцесса.ТолькоПросмотр=Истина;
		Элементы.ЗначениеРеквизита.АктивизироватьПоУмолчанию=Истина;
		Элементы.Период.ТолькоПросмотр=Истина;
		Элементы.ДекорацияИстория.Доступность=Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИсторияНажатие(Элемент)
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("РеквизитПроцесса", Запись.РеквизитПроцесса);
	ПараметрыОтбора.Вставить("БизнесПроцесс", Запись.БизнесПроцесс);
	
	ПараметрыФормы=Новый Структура("Отбор", ПараметрыОтбора);
	
	ФормаИстории=ПолучитьФорму("РегистрСведений.КП_РеквизитыЭкземпляраПроцесса.Форма.ФормаИсторииРеквизита", ПараметрыФормы);
	ФормаИстории.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РеквизитПроцесса=Запись.РеквизитПроцесса;
	
	Если НЕ ЗначениеЗаполнено(РеквизитПроцесса) ИЛИ НЕ КП_ОбщееСервер.ЭтоРеквизитДополнительныхСвойств(РеквизитПроцесса) Тогда
		//это обычный реквизит, используем обычную форму выбора
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	
	//откроем форму с установленным отбором
	ПараметрыОтбора=Новый Структура("Владелец", ПолучитьСвязьРеквизитаСПВХ(РеквизитПроцесса));	
	ПараметрыФормы=Новый Структура("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ЗначениеРеквизитаНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
    
    Если ВыбранноеЗначение=Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Запись.ЗначениеРеквизита=ВыбранноеЗначение;

КонецПроцедуры

&НаСервере
Функция ПолучитьСвязьРеквизитаСПВХ(РеквизитПроцесса)
	Возврат РеквизитПроцесса.ТипРеквизита.СвязьСПВХ;
	
КонецФункции

&НаКлиенте
Процедура ЗначениеРеквизитаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ЭтоРеквизитГруппыСвойств() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
		
	НайденноеЗначение=КП_ОбщееСервер.ПолучитьЗначениеРеквизитаСвойствПоНаименованию(Запись.ЗначениеРеквизита, Текст); 
	
	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
		ДанныеВыбора=НайденноеЗначение;
		ЭтаФорма[Элемент.Имя]=НайденноеЗначение;     

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ЭтоРеквизитГруппыСвойств() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеЗначение=КП_ОбщееСервер.ПолучитьЗначениеРеквизитаСвойствПоНаименованию(Запись.ЗначениеРеквизита, Текст); 
	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
		ДанныеВыбора=НайденноеЗначение;
		ЭтаФорма[Элемент.Имя]=НайденноеЗначение;
		
	Иначе
		СтандартнаяОбработка=Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЭтоРеквизитГруппыСвойств()
	Возврат Запись.РеквизитПроцесса.ТипРеквизита.ПринадлежитЭлементу(Справочники.КП_СписокМетаданных.Свойства);
	
КонецФункции










