
&НаСервере
Процедура ДобавитьФайлНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ДобавитьФайлКомпоновкиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлКомпоновки(Команда)
    Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
        УстановитьРасширениеРаботыСФайлами();
    КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Заполните наименование");
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;
		Возврат;
	КонецЕсли;
	
    Адрес = "";            
	ВидПрограммы  = ПолучитьПараметр("ВидПрограммы");
	
	Если ЗначениеЗаполнено(ВидПрограммы) Тогда     
		ВидПрограммыС=Строка(ВидПрограммы);
		ВидПрограммыС_Нач = СтрНайти(ВидПрограммыС,"("); 
		ВидПрограммыС_Кон = СтрНайти(ВидПрограммыС,")"); 
		РасширениеФайла = "*."+?(ВидПрограммыС_Нач>0 И ВидПрограммыС_Кон>0, Сред(ВидПрограммыС,ВидПрограммыС_Нач+1, ВидПрограммыС_Кон-ВидПрограммыС_Нач-1),"*");
	Иначе
		ВидПрограммыС="";
		РасширениеФайла = "*.*";
	КонецЕсли;
    ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтаФорма);

	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = ВидПрограммыС	    +"|"+РасширениеФайла;	
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл программы";
    НачатьПомещениеФайла(ОписаниеОповещения, Адрес, ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, Адрес, ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;

    Файл = Новый Файл(ВыбранныйФайл);
	
	ПараметрыФайла = Новый Структура;   
	ПараметрыФайла.Вставить("ИмяФайла", Файл.Имя);
 	ПараметрыФайла.Вставить("ПутьФайла", Файл.Путь);
    // для записи в реквизит с типом хранилище значения
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	АдресЗагруженногоФайла = Адрес;
	ЗагрузитьНаСервере(АдресЗагруженногоФайла, ПараметрыФайла, Отказ, ОписаниеОшибки);

КонецПроцедуры           
&НаСервере
Процедура ЗагрузитьНаСервере(АдресЗагруженногоФайла, ПараметрыФайла, Отказ, ОписаниеОшибки)
 	ПараметрыФайла.Вставить("ТехнологическаяОперация", ПолучитьПараметр("ТехнологическаяОперация"));
 	ПараметрыФайла.Вставить("ВидПрограммы", ПолучитьПараметр("ВидПрограммы"));
 	ПараметрыФайла.Вставить("ВариантНаладки", ПолучитьПараметр("ВариантНаладки"));
 	ПараметрыФайла.Вставить("ВидМатериалаКомпоновки", ПолучитьПараметр("ВидМатериалаКомпоновки"));
 	ПараметрыФайла.Вставить("Стандартный", Истина);
    ПараметрыФайла.Вставить("Наименование", "Стд. "+ПолучитьПараметр("ТехнологическаяОперация")+" ["+Объект.Код+"] "+Объект.Наименование);

	Объект.ФайлПрограммы = Справочники.БЗ_MES_ФайлыПрограммСтанков.ДобавитьФайлИзВХ(АдресЗагруженногоФайла, ПараметрыФайла, Отказ, ОписаниеОшибки);	
КонецПроцедуры	
&НаСервере
Функция ПолучитьПараметрРодителя(Родитель, Элемент) 
	Если ЗначениеЗаполнено(Родитель[Элемент]) Тогда
		Возврат Родитель[Элемент];
	ИначеЕсли ЗначениеЗаполнено(Родитель.Родитель) Тогда
		Возврат ПолучитьПараметрРодителя(Родитель.Родитель, Элемент)
	Иначе
		Возврат ""
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПодсказкуВвода("ТехнологическаяОперация");
	УстановитьПодсказкуВвода("ВидПрограммы");
	УстановитьПодсказкуВвода("ВариантНаладки");
	УстановитьПодсказкуВвода("ВидМатериалаКомпоновки");
	АвтообновлениеНаименования = НЕ ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсказкуВвода (Элемент)          
	Элементы[Элемент].ПодсказкаВвода = ПолучитьПараметрРодителя(Объект.Родитель, Элемент);  
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметр(Элемент)
	Если ЗначениеЗаполнено(Объект[Элемент]) Тогда   
		Возврат Объект[Элемент];
	Иначе
		Возврат ПолучитьПараметрРодителя(Объект.Родитель,Элемент);
	КонецЕсли;      
КонецФункции
&НаСервере
Процедура ИзменитьНаименованиеНаСервере()
	ВремНаименование = "";                    
	ПервыйПроход = Истина;
	Для Каждого СтрокаТовары из Объект.Товары Цикл
		ВремНаименование = ВремНаименование + ?(ПервыйПроход, "", " , "); 	
		ВремНаименование = ВремНаименование + ?(ЗначениеЗаполнено(СтрокаТовары.Номенклатура),СтрокаТовары.Номенклатура.Наименование+"("+СтрокаТовары.Характеристика.Наименование+")х"+СтрокаТовары.Количество,"");	
		ПервыйПроход = Ложь;
	КонецЦикла;
	Объект.Наименование = ВремНаименование;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	//Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ИзменитьНаименованиеНаСервере();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование(Команда)
	ИзменитьНаименованиеНаСервере();

КонецПроцедуры
