Процедура ПечатьMXL(Параметр)
	Попытка
		ИмяФайла=БЗ_TSDAPI.ПолучитьПоле(Параметр,"|");
		Принтер=БЗ_TSDAPI.СледующееПоле(Параметр,"|");
		Файл = Новый Файл(ИмяФайла);
		Если НЕ Файл.Существует() Тогда	
			Возврат
		КонецЕсли;
		Таб=Новый ТабличныйДокумент();
		Таб.Прочитать(ИмяФайла);
		Таб.ИмяПринтера=Принтер;
		Таб.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки
КонецПроцедуры

Функция ОбработкаПараметраЗапуска1С(Параметр) Экспорт
	Если БЗ_TSDAPI.ПолучитьПоле(Параметр,"|")="PRINT" Тогда
		ПечатьMXL(БЗ_TSDAPI.СледующееПоле(Параметр,"|"));
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции