#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Рекомендуемый = Истина;
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
	НастройкиОтчета.Вставить("ВариантыРасшифровки", Новый Массив);
	ОтчетыУНФ.ДобавитьВариантРасшифровки(НастройкиОтчета.ВариантыРасшифровки, "Отчет.РасшифровкаАнализаЗакрытияМесяца", "ПоПартиям", "ОбщийПоВсемПартиям");
	ОтчетыУНФ.ДобавитьВариантРасшифровки(НастройкиОтчета.ВариантыРасшифровки, "Отчет.РасшифровкаАнализаЗакрытияМесяца", "ПоХарактеристикам", "ОбщийПоВсемХарактеристикам");
	ОтчетыУНФ.ДобавитьВариантРасшифровки(НастройкиОтчета.ВариантыРасшифровки, "Отчет.РасшифровкаАнализаЗакрытияМесяца", "ПоСкладам", "ОбщийНаВсехСкладах");
	ОтчетыУНФ.ДобавитьВариантРасшифровки(НастройкиОтчета.ВариантыРасшифровки, "Отчет.РасшифровкаАнализаЗакрытияМесяца", "ПоЗаказам", "ОбщийРезерв");
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолейКоличеств = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("КоличествоНачальныйОстаток,КоличествоПриход,КоличествоРасход,КоличествоБорот,КоличествоКонечныйОстаток,ТекущийОстаток");
	
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияКоличества(ВариантыОформления, МассивПолейКоличеств);
			
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Основной"].Теги = НСТР("ru = 'Номенклатура,Заказы,Запасы,Закупки,Остатки,Резервы'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "", "Обработка.ЗакрытиеМесяца", , Истина);
	
КонецПроцедуры
 
#КонецОбласти 

#Область Инициализация

ЭтоОтчетУНФ = Истина;

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли