#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПараметрыДинамическихСписков();

	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает значения параметров динамических списков 
//
// Значения считываются из реквизитов обработки
//
&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()

	СписокРасшифровкаРезерва.Параметры.УстановитьЗначениеПараметра("Организация",
		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Параметры.Организация));
	СписокРасшифровкаРезерва.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	СписокРасшифровкаРезерва.Параметры.УстановитьЗначениеПараметра("Характеристика", Параметры.Характеристика);
	СписокРасшифровкаРезерва.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);

КонецПроцедуры

#КонецОбласти