
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора=ЭтаФорма.Параметры.РежимВыбора;
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.АвтоЗаголовок=Ложь;		
		ЭтаФорма.Заголовок=Параметры.Заголовок;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="СозданНовыйЦвет" Тогда
		ДобавитьЦветСервером(Параметр);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЦветСервером(СсылкаНаЦвет)
	КП_ОформлениеСтрокСервер.ДобавитьНовыйЦветВОформление(Список, "Ссылка", "Наименование", СсылкаНаЦвет);
	КП_ОформлениеСтрокСервер.ДобавитьНовыйЦветВОформление(Список, "Ссылка", "Ссылка", СсылкаНаЦвет, "ЦветФона");	
КонецПроцедуры

