


// _Демо начало (подсистема "Управление доступом")

Функция ГруппаДоступаИсполнителей(РольИсполнителя, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДопГруппыДоступаИсполнителей.Ссылка
	|ИЗ
	|	Справочник.ДопГруппыДоступаИсполнителей КАК ДопГруппыДоступаИсполнителей
	|ГДЕ
	|	ДопГруппыДоступаИсполнителей.РольИсполнителя = &РольИсполнителя
	|	И ДопГруппыДоступаИсполнителей.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации
	|	И ДопГруппыДоступаИсполнителей.ДополнительныйОбъектАдресации = &ДополнительныйОбъектАдресации");
	Запрос.УстановитьПараметр("РольИсполнителя",               РольИсполнителя);
	Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",       ОсновнойОбъектАдресации);
	Запрос.УстановитьПараметр("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГруппаИсполнителей = Выборка.Ссылка;
	Иначе
		// Требуется добавить новую группу исполнителей.
		ГруппаИсполнителейОбъект = Справочники.ДопГруппыДоступаИсполнителей.СоздатьЭлемент();
		ГруппаИсполнителейОбъект.РольИсполнителя               = РольИсполнителя;
		ГруппаИсполнителейОбъект.ОсновнойОбъектАдресации       = ОсновнойОбъектАдресации;
		ГруппаИсполнителейОбъект.ДополнительныйОбъектАдресации = ДополнительныйОбъектАдресации;
		ГруппаИсполнителейОбъект.Записать();
		ГруппаИсполнителей = ГруппаИсполнителейОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ГруппаИсполнителей;
	
КонецФункции // ГруппаДоступаИсполнителей()

// _Демо конец (подсистема "Управление доступом")
