&НаСервере
Процедура ЗаполнитьРасписание(ТаблицаРасписания) Экспорт
	
	ТаблицаРасписания.Очистить();
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 1, "Понедельник", Дата("00010101090000"), Дата("00010101180000"),Дата("00010101130000"), Дата("00010101140000"));
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 2, "Вторник", Дата("00010101090000"), Дата("00010101180000"),Дата("00010101130000"), Дата("00010101140000"));
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 3, "Среда", Дата("00010101090000"), Дата("00010101180000"),Дата("00010101130000"), Дата("00010101140000"));
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 4, "Четверг", Дата("00010101090000"), Дата("00010101180000"),Дата("00010101130000"), Дата("00010101140000"));
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 5, "Пятинца", Дата("00010101090000"), Дата("00010101180000"),Дата("00010101130000"), Дата("00010101140000"));
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 6, "Суббота", Дата("00010101"), Дата("00010101"), Дата("00010101"), Дата("00010101"));
	ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, 7, "Воскресенье", Дата("00010101"), Дата("00010101"), Дата("00010101"), Дата("00010101"));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДеньНеделиВТаблицу(ТаблицаРасписания, Номер, Наименование, НачалоРаботы, ОкончаниеРаботы, НачалоОбеда, ОкончаниеОбеда, Примечание="")
	
	НоваяСтрока=ТаблицаРасписания.Добавить();
	НоваяСтрока.ДеньНеделиНомер=Номер;
	НоваяСтрока.ДеньНеделиНаименование=Наименование;
	НоваяСтрока.ВремяНачалаРаботы=НачалоРаботы;
	НоваяСтрока.ВремяОкончанияРаботы=ОкончаниеРаботы;
	НоваяСтрока.ВремяНачалаОбеда=НачалоОбеда;
	НоваяСтрока.ВремяОкончанияОбеда=ОкончаниеОбеда;
	НоваяСтрока.Примечание=Примечание;
	
КонецПроцедуры
