
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") Тогда
		РеквизитПроцесса=Параметры.Отбор.РеквизитПроцесса;
		БизнесПроцесс=Параметры.Отбор.БизнесПроцесс;
		Заголовок=РеквизитПроцесса;
		УстановитьОтборПоРеквизиту(РеквизитПроцесса, БизнесПроцесс);
		
	Иначе
		ОтборПоРеквизитуПроцесса=Неопределено;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьОтборПоРеквизиту(РеквизитПроцесса, БизнесПроцесс)
	
	Список.Параметры.УстановитьЗначениеПараметра("РеквизитПроцесса", РеквизитПроцесса);
	Список.Параметры.УстановитьЗначениеПараметра("БизнесПроцесс", БизнесПроцесс);
	
КонецПроцедуры
