
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сообщение = Параметры.Сообщение;
	Если Сообщение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = Сообщение.Описание;
	
	ТекстСообщенияXML = ИнтеграцияИС.ФорматироватьXMLСПараметрами(
			Сообщение.ТекстСообщенияXML,
			ИнтеграцияИС.ПараметрыФорматированияXML(Истина));
	
	ТабличныйДокументТекстСообщенияXML.УстановитьТекст(ТекстСообщенияXML);
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти