
#Область ПрограммныйИнтерфейс
Процедура ОбработатьПроизвольноеДействиеСообщенияАссистента(ОписаниеСообщения) Экспорт
	ДанныеДляПерехода = ОписаниеСообщения.Данные;
	Если ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКЗадачеПоНалогам" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму(ДанныеДляПерехода.ИмяФормыЗадачи, ДанныеДляПерехода.ПараметрыОткрытия);
			
			Возврат;
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиККУДиР" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ПараметрыФормы = Новый Структура("Организация", ДанныеДляПерехода.ПараметрыОткрытия.Организация);
			ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаСпискаЗаписиПрочие", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКПоказателямПоЕНВД" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму("Документ.ПоказателиЕНВД.ФормаОбъекта", ДанныеДляПерехода.ПараметрыОткрытия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
