
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		кратностьДопРеквизит=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Кратность_1ac2b3c35ee44c6e92ff4b8ade8f68da");
		Дата=ТекущаяДАта();
		ДокументОснование=данныеЗаполнения;
		Для каждого стр из данныеЗаполнения.запасы цикл
			кратность=0;
			если ЗНачениеЗАполнено(стр.характеристика) Тогда
				Для каждого стрДопРеквизит из стр.характеристика.дополнительныеРеквизиты цикл
					Если стрДопРеквизит.свойство=КратностьДопРеквизит тогда
						кратность=стрДопРеквизит.значение;		
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли;
			Если Кратность= 0 тогда
				новстр=запасы.Добавить();
				ЗаполнитьЗначенияСвойств(новстр, стр);
			иначе
				количество=стр.количество;
				сч=0;
		 		пока количество>0 цикл   
					сч=сч+1;
					Партия=Справочники.ПартииНоменклатуры.СоздатьЭлемент();         
					Партия.Наименование=Строка(сч)+" "+Строка(данныеЗаполнения.номер)+" "+Строка(стр.характеристика.код); 
					Партия.Владелец=стр.номенклатура;  
					партия.статус=Перечисления.СтатусыПартий.СобственныеЗапасы;
					партия.ВладелецПартии=ДанныеЗаполнения.Контрагент;
					Партия.Записать();
					новстр=запасы.Добавить();					
					ЗаполнитьЗначенияСвойств(новстр, стр);	
					новстр.Ячейка= Партия.Ссылка;
					Если Количество>Кратность тогда						
						новстр.Количество=кратность;
						количество=количество-кратность;
					Иначе	
						новстр.Количество=Количество;
						количество=0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;			
		КонецЦикла; 
		Для каждого стр из Запасы цикл
			новстр=ТСД_ВводДанных.Добавить();
			ЗаполнитьЗНаченияСвойств(новстр, стр); 
			новстр.план=стр.Количество;		
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьЕАН8()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПРАВ(Ячейки.БЗ_ШК, 7)) КАК БЗ_ШК
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	кодшк=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    кодшк=ВыборкаДетальныеЗаписи.БЗ_ШК+1;
	КонецЦикла;	                                              
	кодшк1=Формат(кодшк, "ЧЦ=7; ЧВН=; ЧГ=");
	возврат  СтрШаблон("%1%2", кодшк1, КонтрольныйСимволEAN(кодшк1, 8));	
КонецФункции  

Функция КонтрольныйСимволEAN(Знач ШтрихКод, Знач Тип)
	
	Четн = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()

