
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Задача не может быть создана интерактивно. Воспользуйтесь бизнес-процессами.';en='The task can not be created interactively. Use business process.'"));
		Отказ=Истина;
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	БизнесПроцессПомеченНаУдаление=Объект.БизнесПроцесс.ПометкаУдаления;
	
КонецПроцедуры

// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	БизнесПроцессСсылка=Объект.БизнесПроцесс;
	
	#Если НЕ (ВебКлиент ИЛИ МобильныйКлиент) Тогда
	ЭтаФорма.Закрыть();
	#КонецЕсли

	Если БизнесПроцессПомеченНаУдаление Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Внимание! Бизнес-процесс этой задачи помечен на удаление.';en='Warning! Business process that task is marked for deletion.'"));		
	КонецЕсли;
		
	//проверим какую форму нужно открыть
	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Параметры.Ключ);
	
	СистемаВзаимодейстияИспользуется=СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	Если ЭтоФормаИсполнения() Тогда
		Если СистемаВзаимодейстияИспользуется Тогда
			ОткрытьФорму("Задача.КП_Задача.Форма.ФормаИсполнения", ПараметрыФормы,,,,, Неопределено,РежимОткрытияОкнаФормы.Независимый);
		Иначе
			ОткрытьФорму("Задача.КП_Задача.Форма.ФормаИсполнения", ПараметрыФормы,,,,, Неопределено);
		КонецЕсли;		
	Иначе
		//необходимо открыть форму контроля
		Если СистемаВзаимодейстияИспользуется Тогда
			ОткрытьФорму("Задача.КП_Задача.Форма.ФормаКонтроля", ПараметрыФормы,,,,, Неопределено, РежимОткрытияОкнаФормы.Независимый);
		Иначе 
			ОткрытьФорму("Задача.КП_Задача.Форма.ФормаКонтроля", ПараметрыФормы,,,,, Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	#Если МобильныйКлиент Тогда
	Элементы.ДекорацияИнфо.Видимость=Ложь;	                                       
	ЭтаФорма.Закрыть(); //а она не закрывается...
	#Иначе
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииФормаТехПоддержки(Результат, ДополнительныеПараметры) Экспорт
	
	НепустойОбработчик=Истина;
	//ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоФормаИсполнения()
	Возврат (Объект.ТочкаКБП.ДействиеТипФормыЗадач=0);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьЭтуФоруму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти
