#Область ПодключаемыеКомандыИСКлиентСерверПереопределяемый

Процедура ПриОпределенииКоманд(ИмяФормы, Команды) Экспорт
	
	Если ИмяФормы = "Документ.ВходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.КомандыВходящейТранспортнойОперации(Команды);
	ИначеЕсли ИмяФормы = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.КомандыИсходящейТранспортнойОперации(Команды);
	ИначеЕсли ИмяФормы = "Документ.ИнвентаризацияПродукцииВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.КомандыИнвентаризацииПродукции(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.КомандыПроизводственнойОперации(Команды);
		
	ИначеЕсли ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.КомандыМаркировкиТоваровИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.КомандыЗаказНаЭмиссиюКодовМаркировкиСУЗ(Команды);
	ИначеЕсли ИмяФормы = "Документ.ВыводИзОборотаИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.КомандыВыводаИзОборотаИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.КомандыСписанияКодовМаркировкиИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.КомандыПеремаркировкиТоваровИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ОтгрузкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.КомандыОтгрузкиТоваровИСМП(Команды);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНастройкеВидимостиКоманд(Форма, КомандыОбъекта) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ВходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.УправлениеВидимостьюКомандВходящейТранспортнойОперации(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ИнвентаризацияПродукцииВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУНФКлиентСервер.УправлениеВидимостьюКомандПроизводственнойОперации(Форма, КомандыОбъекта);
	
	ИначеЕсли ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.УправлениеВидимостьюКомандМаркировкиТоваров(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.УправлениеВидимостьюКомандЗаказаНаЭмиссию(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ВыводИзОборотаИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.УправлениеВидимостьюКомандВыводаВОборота(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.УправлениеВидимостьюКомандСписанияКодовМаркировки(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.УправлениеВидимостьюКомандПеремаркировкиТоваров(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ОтгрузкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУНФКлиентСервер.УправлениеВидимостьюКомандОтгрузкиТоваров(Форма, КомандыОбъекта);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти