
#Область ПрограммныйИнтерфейс

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Кассы";
	ВидДоступа.Представление    = НСтр("ru = 'Кассы'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Кассы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыКонтрагентов";
	ВидДоступа.Представление    = НСтр("ru = 'Группы контактов и контрагентов'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Контрагенты");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаКонтрагентов");
	УправлениеДоступом.ДобавитьДополнительныеТипыВидаДоступа(ВидДоступа,Тип("СправочникСсылка.КонтактныеЛица"),ВидДоступа.ТипГруппЗначений,);
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыЛидов";
	ВидДоступа.Представление    = НСтр("ru = 'Группы лидов'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Лиды");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаЛидов");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыДоговоровКредитаИЗайма";
	ВидДоступа.Представление    = НСтр("ru = 'Виды договоров кредита и займа'");
	ВидДоступа.ТипЗначений      = Тип("ПеречислениеСсылка.ВидыДоговоровКредитаИЗайма");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "БанковскиеСчета";
	ВидДоступа.Представление = НСтр("ru = 'Банковские счета'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.БанковскиеСчета");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "КассыККМ";
	ВидДоступа.Представление = НСтр("ru = 'Кассы ККМ'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.КассыККМ");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыЦен";
	ВидДоступа.Представление = НСтр("ru = 'Виды цен'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.ВидыЦен");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_Продажи(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "CRM, Продажи, Работы".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильПродажи());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Продажи'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем осуществляется работа с разделами CRM, Продажи и Работы.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	
	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	
	// Торговые предложения
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТорговыхПредложений");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	
	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛидов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыБиллинг");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКонтактЦентра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоБанкуИКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочтыУНФ");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМ");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// УНФ Продажи
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПродажи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовПродажи");
	
	// УНФ Работы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыРаботы");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовРаботы");
	
	// УНФ Ремонты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыРемонты");
	
	// Яндекс.Касса
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляЯндексКассы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовСЯндексКассой");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыЛидов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения служебного профиля "Редактирование цен документов (дополнительно)".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильРедактированиеЦенДокументов());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование цен документов (дополнительно)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность редактирования цен в документах для менеджеров.'");
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗагрузкиДанныхИзВнешнегоИсточника");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеЦенДокументов");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения служебного профиля "Редактирование номенклатуры (дополнительно)".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильРедактированиеНоменклатуры());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование номенклатуры (дополнительно)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность редактирования номенклатуры для менеджеров.'");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения служебного профиля "Редактирование расходов по источникам(дополнительно)".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильРедактированиеРасходовПоИсточникам());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование расходов по источникам (дополнительно)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность редактирования расходов в источниках привлечения для менеджеров.'");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходовНаИсточники");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения служебного профиля "Возвраты от покупателей (дополнительно)".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильВозвратыОтПокупателей());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Возвраты от покупателей (дополнительно)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность работы с возвратами от покупателей.'");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОтПокупателей");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыЛидов", "ВначалеВсеЗапрещены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_Закупки(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "Закупки".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильЗакупки());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Закупки'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем осуществляется работа с разделом Закупки.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	
	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	
	// Торговые предложения
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЗакупкиГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПоступленииМаркированныхТоваровГИСМ");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	
	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗагрузкиДанныхИзВнешнегоИсточника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоБанкуИКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовДвиженияПоЗапасам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочтыУНФ");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// УНФ Закупки
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПереработка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыЗапасыИСклад");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыИзлишкиИНедостачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовЗакупки");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения служебного профиля "Возвраты поставщикам (дополнительно)".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильВозвратыПоставщикам());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Возвраты поставщикам (дополнительно)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность работы с возвратами поставщикам.'");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовПоставщикам");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения служебного профиля "Себестоимость в отчете продажи (дополнительно)".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильСебестоимостьВОтчетеПродажи());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Себестоимость в отчете продажи (дополнительно)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность видеть себестоимость в отчете ""Продажи"".'");
	
	ОписаниеПрофиля.Роли.Добавить("СебестоимостьВОтчетеПродажи");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_Производство(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "Производство".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильПроизводство());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Производство'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа с разделом Производство.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМ");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	
	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоБанкуИКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовДвиженияПоЗапасам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочтыУНФ");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// УНФ Производство
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыНаряды");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПереработкаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовПроизводство");
	
	// УНФ Ремонты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыРемонты");
	
	// Яндекс.Касса
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляЯндексКассы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовСЯндексКассой");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_Деньги(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "Деньги".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильДеньги());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Деньги'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем осуществляется работа с разделом Деньги: банк, касса и платежный календарь.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменСБанками");
	
	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	
	// Обмен с банками
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменСБанками");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыБанк");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыКасса");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПланированиеДенег");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовДеньги");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковОплатыСчетовИЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодсистемаБиллинг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочтыУНФ");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// Яндекс.Касса
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляЯндексКассы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовСЯндексКассой");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильПроведениеДенежныхДокументовСверхРезерва());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Разрешить расход денег без учета резервов'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий возможность проведение денежных документов без учета резервов.'");
	
	ОписаниеПрофиля.Роли.Добавить("ПроведениеДенежныхДокументовСверхРезерва");
	
	// Подсистема планирования
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильДобавлениеИзменениеПодсистемыПланированиеДенег());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Доступ к документам планирования денег'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Служебный профиль, определяющий доступ к документам планирования.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПланированиеДенег");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновПечатиОфисныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковОплатыСчетовИЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодсистемаБиллинг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочтыУНФ");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_Зарплата(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "Зарплата".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильЗарплата());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Зарплата'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем осуществляется работа с разделом Зарплата:  кадровый учет и расчет зарплаты.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСогласийНаОбработкуПерсональныхДанных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	
	// Бизнес-сеть
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИнформацииОДоступныхОбновленияхПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыПерсонал");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыЗарплата");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНачисленийИТабеля");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетовЗарплата");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилРабочегоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочтыУНФ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетов");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыДоговоровКредитаИЗайма", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_РабочееМестоКассира(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "АРМ Кассира".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильРабочееМестоКассира());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Рабочее место кассира'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Профиль для рабочего места кассира
			  |Под данным профилем доступна работа только с формой рабочего места кассира и заказами покупателей при соответствующей включенной опции.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	
	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_Налоги(ОписанияПрофилей) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Описание для заполнения профиля "Налоги".
	//
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильНалоги());
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Налоги'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под данным профилем доступна работа с уплатой налогов и подготовкой отчетности для индивидуального предпринимателя'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// БРО 
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБРО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ПравоНаЗащищенныйДокументооборотСКонтролирующимиОрганами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗаявкамиНаЛьготныйКредит");
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	
	// УНФ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУНФ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобытийИЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
	
	// УНФ Работа с файлами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	
	// УНФ Налоги
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыНалоги");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("БанковскиеСчета", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_ТолькоПросмотр(ОписанияПрофилей) Экспорт
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильТолькоПросмотр());
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Только просмотр'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем доступен просмотр данных базы без внесения изменений. Не рекомендуется использовать совместно с другими профилями.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// БРО 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменСБанками");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУНФ");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЗакупкиГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПоступленииМаркированныхТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОСписанииКиЗГИСМ");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	
	// ИСМП
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкаТоваровИСМП");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа_ВетеринарныйВрач(ОписанияПрофилей) Экспорт
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ЗаполнитьЗначенияСвойств(ОписаниеПрофиля, ПрофильВетеринарныйВрач());
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ветеринарный врач (ВЕТИС)'");
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Профиль предназначен для использования ветеринарным врачом в целях оформления операций ВЕТИС.'");
	
	// БСП, БТС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	
	// БРО 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	
	// Обмен электронными документами
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	
	// Интернет-поддержка пользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУНФ");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	Если ВидДоступа = "ГруппыКонтрагентов" Тогда
		Использование = Константы.ИспользоватьГруппыДоступаКонтрагентов.Получить();
	КонецЕсли;
	
	Если ВидДоступа = "ГруппыЛидов" Тогда
		Использование = Константы.ИспользоватьГруппыДоступаЛидов.Получить();
	КонецЕсли;
	
	Если ВидДоступа = "ВидыДоговоровКредитаИЗайма" Тогда
		Использование = Константы.ФункциональнаяОпцияКредитыИЗаймы.Получить();
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
//
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Документ.АвансовыйОтчет.Изменение.ГруппыКонтрагентов
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Чтение.ГруппыКонтрагентов
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АктВыполненныхРабот.Изменение.ГруппыКонтрагентов
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Чтение.ГруппыКонтрагентов
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АмортизацияВА.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.Взаимозачет.Изменение.ГруппыКонтрагентов
	|Документ.Взаимозачет.Изменение.Организации
	|Документ.Взаимозачет.Чтение.ГруппыКонтрагентов
	|Документ.Взаимозачет.Чтение.Организации
	|Документ.ВнесениеНаличных.Изменение.КассыККМ
	|Документ.ВнесениеНаличных.Изменение.Организации
	|Документ.ВнесениеНаличных.Чтение.КассыККМ
	|Документ.ВнесениеНаличных.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыемкаНаличных.Изменение.КассыККМ
	|Документ.ВыемкаНаличных.Изменение.Организации
	|Документ.ВыемкаНаличных.Чтение.КассыККМ
	|Документ.ВыемкаНаличных.Чтение.Организации
	|Документ.Доверенность.Изменение.ГруппыКонтрагентов
	|Документ.Доверенность.Изменение.Организации
	|Документ.Доверенность.Чтение.ГруппыКонтрагентов
	|Документ.Доверенность.Чтение.Организации
	|Документ.ДоговорКредитаИЗайма.Чтение.ВидыДоговоровКредитаИЗайма
	|Документ.ДоговорКредитаИЗайма.Чтение.ГруппыКонтрагентов
	|Документ.ДоговорКредитаИЗайма.Чтение.Организации
	|Документ.ДополнительныеРасходы.Изменение.ГруппыКонтрагентов
	|Документ.ДополнительныеРасходы.Изменение.Организации
	|Документ.ДополнительныеРасходы.Чтение.ГруппыКонтрагентов
	|Документ.ДополнительныеРасходы.Чтение.Организации
	|Документ.ЗаданиеНаРаботу.Изменение.Организации
	|Документ.ЗаданиеНаРаботу.Чтение.Организации
	|Документ.ЗаказНаПроизводство.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказНаПроизводство.Изменение.Организации
	|Документ.ЗаказНаПроизводство.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказНаПроизводство.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказПокупателя.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПокупателя.Изменение.Организации
	|Документ.ЗаказПокупателя.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПокупателя.Чтение.Организации
	|Документ.ЗаказПоставщику.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗакрытиеМесяца.Чтение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ИнвентаризацияЗапасов.Изменение.Организации
	|Документ.ИнвентаризацияЗапасов.Чтение.Организации
	|Документ.КадровоеПеремещение.Изменение.Организации
	|Документ.КадровоеПеремещение.Чтение.Организации
	|Документ.КорректировкаПоступления.Изменение.ГруппыКонтрагентов
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаПоступления.Чтение.ГруппыКонтрагентов
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаРеализации.Изменение.ГруппыКонтрагентов
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Чтение.ГруппыКонтрагентов
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаршрутныйЛист.Изменение.Организации
	|Документ.МаршрутныйЛист.Чтение.Организации
	|Документ.МассоваяРассылка.Изменение.ГруппыКонтрагентов
	|Документ.МассоваяРассылка.Чтение.ГруппыКонтрагентов
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеНалогов.Изменение.Организации
	|Документ.НачислениеНалогов.Чтение.Организации
	|Документ.НачисленияПоКредитамИЗаймам.Чтение.ГруппыКонтрагентов
	|Документ.НачисленияПоКредитамИЗаймам.Чтение.Организации
	|Документ.ОперацияПоПлатежнымКартам.Изменение.БанковскиеСчета
	|Документ.ОперацияПоПлатежнымКартам.Изменение.ГруппыКонтрагентов
	|Документ.ОперацияПоПлатежнымКартам.Изменение.Организации
	|Документ.ОперацияПоПлатежнымКартам.Чтение.БанковскиеСчета
	|Документ.ОперацияПоПлатежнымКартам.Чтение.ГруппыКонтрагентов
	|Документ.ОперацияПоПлатежнымКартам.Чтение.Организации
	|Документ.ОприходованиеЗапасов.Изменение.Организации
	|Документ.ОприходованиеЗапасов.Чтение.Организации
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ОтчетЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетКомиссионера.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомитенту.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетОПереработке.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетОПереработке.Изменение.Организации
	|Документ.ОтчетОПереработке.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетОПереработке.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетПереработчика.Изменение.ГруппыКонтрагентов
	|Документ.ОтчетПереработчика.Изменение.Организации
	|Документ.ОтчетПереработчика.Чтение.ГруппыКонтрагентов
	|Документ.ОтчетПереработчика.Чтение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетЭД.Чтение.Организации
	|Документ.ПередачаВА.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаВА.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремещениеДС.Изменение.Кассы
	|Документ.ПеремещениеДС.Изменение.Организации
	|Документ.ПеремещениеДС.Чтение.Кассы
	|Документ.ПеремещениеДС.Чтение.Организации
	|Документ.ПеремещениеДСПлан.Изменение.Кассы
	|Документ.ПеремещениеДСПлан.Изменение.Организации
	|Документ.ПеремещениеДСПлан.Чтение.Кассы
	|Документ.ПеремещениеДСПлан.Чтение.Организации
	|Документ.ПеремещениеЗапасов.Изменение.Организации
	|Документ.ПеремещениеЗапасов.Чтение.Организации
	|Документ.ПеремещениеПоЯчейкам.Изменение.Организации
	|Документ.ПеремещениеПоЯчейкам.Чтение.Организации
	|Документ.ПереоценкаВРозницеСуммовойУчет.Изменение.Организации
	|Документ.ПереоценкаВРозницеСуммовойУчет.Чтение.Организации
	|Документ.ПереоценкаТоваровНаКомиссии.Изменение.ГруппыКонтрагентов
	|Документ.ПереоценкаТоваровНаКомиссии.Изменение.Организации
	|Документ.ПереоценкаТоваровНаКомиссии.Чтение.ГруппыКонтрагентов
	|Документ.ПереоценкаТоваровНаКомиссии.Чтение.Организации
	|Документ.ПересортицаЗапасов.Изменение.Организации
	|Документ.ПересортицаЗапасов.Чтение.Организации
	|Документ.ПланПродаж.Изменение.Организации
	|Документ.ПланПродаж.Чтение.Организации
	|Документ.ПлатежнаяВедомость.Изменение.Организации
	|Документ.ПлатежнаяВедомость.Чтение.Организации
	|Документ.ПлатежноеПоручение.Изменение.БанковскиеСчета
	|Документ.ПлатежноеПоручение.Изменение.ГруппыКонтрагентов
	|Документ.ПлатежноеПоручение.Изменение.Организации
	|Документ.ПлатежноеПоручение.Чтение.БанковскиеСчета
	|Документ.ПлатежноеПоручение.Чтение.ГруппыКонтрагентов
	|Документ.ПлатежноеПоручение.Чтение.Организации
	|Документ.ПоказателиЕНВД.Изменение.Организации
	|Документ.ПоказателиЕНВД.Чтение.Организации
	|Документ.ПоступлениеВКассу.Изменение.БанковскиеСчета
	|Документ.ПоступлениеВКассу.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеВКассу.Изменение.Кассы
	|Документ.ПоступлениеВКассу.Изменение.КассыККМ
	|Документ.ПоступлениеВКассу.Изменение.Организации
	|Документ.ПоступлениеВКассу.Чтение.БанковскиеСчета
	|Документ.ПоступлениеВКассу.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеВКассу.Чтение.Кассы
	|Документ.ПоступлениеВКассу.Чтение.КассыККМ
	|Документ.ПоступлениеВКассу.Чтение.Организации
	|Документ.ПоступлениеДСПлан.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеДСПлан.Изменение.Организации
	|Документ.ПоступлениеДСПлан.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеДСПлан.Чтение.Организации
	|Документ.ПоступлениеНаСчет.Изменение.БанковскиеСчета
	|Документ.ПоступлениеНаСчет.Изменение.ГруппыКонтрагентов
	|Документ.ПоступлениеНаСчет.Изменение.Организации
	|Документ.ПоступлениеНаСчет.Чтение.БанковскиеСчета
	|Документ.ПоступлениеНаСчет.Чтение.ГруппыКонтрагентов
	|Документ.ПоступлениеНаСчет.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.ПриемИПередачаВРемонт.Изменение.ГруппыКонтрагентов
	|Документ.ПриемИПередачаВРемонт.Изменение.Организации
	|Документ.ПриемИПередачаВРемонт.Чтение.ГруппыКонтрагентов
	|Документ.ПриемИПередачаВРемонт.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПринятиеКУчетуВА.Чтение.Организации
	|Документ.ПриходнаяНакладная.Изменение.ГруппыКонтрагентов
	|Документ.ПриходнаяНакладная.Изменение.Организации
	|Документ.ПриходнаяНакладная.Чтение.ГруппыКонтрагентов
	|Документ.ПриходнаяНакладная.Чтение.Организации
	|Документ.ПриходныйОрдер.Изменение.Организации
	|Документ.ПриходныйОрдер.Чтение.Организации
	|Документ.ПрочиеРасходы.Чтение.ГруппыКонтрагентов
	|Документ.ПрочиеРасходы.Чтение.Организации
	|Документ.РаспределениеЗатрат.Изменение.Организации
	|Документ.РаспределениеЗатрат.Чтение.Организации
	|Документ.РасходДСПлан.Изменение.ГруппыКонтрагентов
	|Документ.РасходДСПлан.Изменение.Организации
	|Документ.РасходДСПлан.Чтение.ГруппыКонтрагентов
	|Документ.РасходДСПлан.Чтение.Организации
	|Документ.РасходИзКассы.Изменение.БанковскиеСчета
	|Документ.РасходИзКассы.Изменение.ГруппыКонтрагентов
	|Документ.РасходИзКассы.Изменение.Кассы
	|Документ.РасходИзКассы.Изменение.КассыККМ
	|Документ.РасходИзКассы.Изменение.Организации
	|Документ.РасходИзКассы.Чтение.БанковскиеСчета
	|Документ.РасходИзКассы.Чтение.ГруппыКонтрагентов
	|Документ.РасходИзКассы.Чтение.Кассы
	|Документ.РасходИзКассы.Чтение.КассыККМ
	|Документ.РасходИзКассы.Чтение.Организации
	|Документ.РасходнаяНакладная.Изменение.ГруппыКонтрагентов
	|Документ.РасходнаяНакладная.Изменение.Организации
	|Документ.РасходнаяНакладная.Чтение.ГруппыКонтрагентов
	|Документ.РасходнаяНакладная.Чтение.Организации
	|Документ.РасходныйОрдер.Изменение.Организации
	|Документ.РасходныйОрдер.Чтение.Организации
	|Документ.РасходСоСчета.Изменение.БанковскиеСчета
	|Документ.РасходСоСчета.Изменение.ГруппыКонтрагентов
	|Документ.РасходСоСчета.Изменение.Организации
	|Документ.РасходСоСчета.Чтение.БанковскиеСчета
	|Документ.РасходСоСчета.Чтение.ГруппыКонтрагентов
	|Документ.РасходСоСчета.Чтение.Организации
	|Документ.РасходыПриИмпорте.Изменение.ГруппыКонтрагентов
	|Документ.РасходыПриИмпорте.Изменение.Организации
	|Документ.РасходыПриИмпорте.Чтение.ГруппыКонтрагентов
	|Документ.РасходыПриИмпорте.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РезервированиеЗапасов.Изменение.Организации
	|Документ.РезервированиеЗапасов.Чтение.Организации
	|Документ.СборкаЗапасов.Изменение.Организации
	|Документ.СборкаЗапасов.Чтение.Организации
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыКонтрагентов
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыКонтрагентов
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СдельныйНаряд.Изменение.Организации
	|Документ.СдельныйНаряд.Чтение.Организации
	|Документ.Событие.Изменение.ГруппыКонтрагентов
	|Документ.Событие.Изменение.ГруппыЛидов
	|Документ.Событие.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Документ.Событие.Чтение.ГруппыКонтрагентов
	|Документ.Событие.Чтение.ГруппыЛидов
	|Документ.Событие.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СписаниеВА.Чтение.Организации
	|Документ.СписаниеЗапасов.Изменение.Организации
	|Документ.СписаниеЗапасов.Чтение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеПроданныхПодарочныхСертификатов.Изменение.Организации
	|Документ.СписаниеПроданныхПодарочныхСертификатов.Чтение.Организации
	|Документ.СчетНаОплату.Изменение.ГруппыКонтрагентов
	|Документ.СчетНаОплату.Изменение.Организации
	|Документ.СчетНаОплату.Чтение.ГруппыКонтрагентов
	|Документ.СчетНаОплату.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.ГруппыКонтрагентов
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.ГруппыКонтрагентов
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетФактура.Изменение.ГруппыКонтрагентов
	|Документ.СчетФактура.Изменение.Организации
	|Документ.СчетФактура.Чтение.ГруппыКонтрагентов
	|Документ.СчетФактура.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыКонтрагентов
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыКонтрагентов
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.Табель.Изменение.Организации
	|Документ.Табель.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыКонтрагентов
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыКонтрагентов
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.Увольнение.Изменение.Организации
	|Документ.Увольнение.Чтение.Организации
	|Документ.УдалитьПроизвольныйЭД.Чтение.Организации
	|Документ.УчетВремени.Изменение.Организации
	|Документ.УчетВремени.Чтение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИС.Чтение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыКонтрагентов
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекККМ.Изменение.ГруппыКонтрагентов
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Чтение.ГруппыКонтрагентов
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМВозврат.Изменение.ГруппыКонтрагентов
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Чтение.ГруппыКонтрагентов
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЭлектронныйДокументВходящий.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящий.Чтение.Организации
	|ЖурналДокументов.ДокументыПланированияДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПланированияДенег.Чтение.Организации
	|ЖурналДокументов.ДокументыПланированияРесурсов.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПланированияРесурсов.Чтение.Организации
	|ЖурналДокументов.ДокументыПоБанку.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоБанку.Чтение.Организации
	|ЖурналДокументов.ДокументыПоБанкуИКассе.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоБанкуИКассе.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоЗакупкам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗапасам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоЗарплате.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКадрам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКассе.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоПродажам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоПроизводству.Чтение.Организации
	|ЖурналДокументов.ДокументыПоСкладу.Чтение.Организации
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.Кассы
	|ЖурналДокументов.ДокументыПоступленияДенег.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуВремени.Чтение.Организации
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.Кассы
	|ЖурналДокументов.ДокументыРасходаДенег.Чтение.Организации
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.КомиссионнаяТорговля.Чтение.Организации
	|ЖурналДокументов.РозничныеПродажи.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.ГруппыКонтрагентов
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрБухгалтерии.Управленческий.Чтение.Организации
	|РегистрНакопления.ВыпускПродукции.Чтение.Организации
	|РегистрНакопления.ГрафикДвиженияЗапасов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ГрафикДвиженияЗапасов.Чтение.Организации
	|РегистрНакопления.ДенежныеСредства.Чтение.БанковскиеСчета
	|РегистрНакопления.ДенежныеСредства.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредства.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредства.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.БанковскиеСчета
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВРезерве.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваКПоступлению.Чтение.Организации
	|РегистрНакопления.УдалитьДенежныеСредстваПрогноз.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходы.Чтение.Организации
	|РегистрНакопления.ДоходыИРасходыОтложенные.Чтение.Организации
	|РегистрНакопления.ЗаданияНаРаботу.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаданияНаРаботу.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПроизводство.Чтение.Организации
	|РегистрНакопления.ЗаказыПокупателей.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаказыПокупателей.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.ЗакупкиДляКУДиР.Чтение.Организации
	|РегистрНакопления.Запасы.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Запасы.Чтение.Организации
	|РегистрНакопления.ЗапасыВРазрезеГТД.Чтение.Организации
	|РегистрНакопления.ЗапасыВРемонте.Чтение.Организации
	|РегистрНакопления.ЗапасыКПоступлениюНаСклады.Чтение.Организации
	|РегистрНакопления.ЗапасыКРасходуСоСкладов.Чтение.Организации
	|РегистрНакопления.ЗапасыНаСкладах.Чтение.Организации
	|РегистрНакопления.ЗапасыПереданные.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗапасыПереданные.Чтение.Организации
	|РегистрНакопления.ЗапасыПереданныеВРемонте.Чтение.Организации
	|РегистрНакопления.ЗапасыПринятые.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗапасыПринятые.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Чтение.Организации
	|РегистрНакопления.НачисленияИУдержания.Чтение.Организации
	|РегистрНакопления.НДФЛДоходы.Чтение.Организации
	|РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Чтение.Организации
	|РегистрНакопления.ОплатаДокументов.Чтение.Организации
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ОплатаПлатежнымиКартами.Чтение.Организации
	|РегистрНакопления.ОплатаСчетовИЗаказов.Чтение.Организации
	|РегистрНакопления.ПартииТоваров.Чтение.Организации
	|РегистрНакопления.ПланыПродаж.Чтение.Организации
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.БанковскиеСчета
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.Кассы
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.КассыККМ
	|РегистрНакопления.ПлатежныйКалендарь.Чтение.Организации
	|РегистрНакопления.ПотребностьВЗапасах.Чтение.Организации
	|РегистрНакопления.ПримененныеВычетыПоНДФЛ.Чтение.Организации
	|РегистрНакопления.Продажи.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Продажи.Чтение.Организации
	|РегистрНакопления.РазмещениеЗаказов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РазмещениеЗаказов.Чтение.Организации
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.ВидыДоговоровКредитаИЗайма
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыПоКредитамИЗаймам.Чтение.Организации
	|РегистрНакопления.РасчетыПоНалогам.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Кассы
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыСПерсоналом.Чтение.Организации
	|РегистрНакопления.РасчетыСПодотчетниками.Чтение.Организации
	|РегистрНакопления.РасчетыСПокупателями.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПокупателями.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПрочимиКонтрагентами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.РасчетыСПрочимиКонтрагентами.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.СдельныеНаряды.Чтение.Организации
	|РегистрНакопления.СерийныеНомера.Чтение.Организации
	|РегистрНакопления.СерийныеНомераКПоступлению.Чтение.Организации
	|РегистрНакопления.СерийныеНомераКРасходу.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыДоходы.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СуммовойУчетВРознице.Чтение.Организации
	|РегистрНакопления.Табель.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.ОстаткиВзаиморасчетов.Чтение.ГруппыКонтрагентов
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.БанковскиеСчета.Изменение.БанковскиеСчета
	|Справочник.БанковскиеСчета.Чтение.БанковскиеСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаказПокупателя
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаказПоставщику
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПриходнаяНакладная
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РасходИзКассы
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РасходСоСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.Событие
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетФактура
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СчетФактураПолученный
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Спецификации
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаказПокупателя
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаказПоставщику
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПриходнаяНакладная
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РасходИзКассы
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РасходСоСчета
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.Событие
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетФактура
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.СчетФактураПолученный
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Спецификации
	|Справочник.ВидыДеятельностиЕНВД.Изменение.Организации
	|Справочник.ВидыДеятельностиЕНВД.Чтение.Организации
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыДоступаКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ГруппыДоступаЛидов.Чтение.ГруппыЛидов
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.Делегирование.Чтение.Организации
	|Справочник.ДисконтныеКарты.Изменение.ГруппыКонтрагентов
	|Справочник.ДисконтныеКарты.Чтение.ГруппыКонтрагентов
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗаписиКалендаряПодготовкиОтчетности.Изменение.Организации
	|Справочник.ЗаписиКалендаряПодготовкиОтчетности.Чтение.Организации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.Кассы.Изменение.Кассы
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыКонтрагентов
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыКонтрагентов
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КонтактныеЛица.Изменение.ГруппыКонтрагентов
	|Справочник.КонтактныеЛица.Чтение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Изменение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Чтение.ГруппыКонтрагентов
	|Справочник.Лиды.Изменение.ГруппыЛидов
	|Справочник.Лиды.Чтение.ГруппыЛидов
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыКонтрагентов
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыКонтрагентов
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ПакетЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.Пользователи.Изменение.Пользователи
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Проекты.Изменение.ГруппыКонтрагентов
	|Справочник.Проекты.Чтение.ГруппыКонтрагентов
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Файлы.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Изменение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаказПокупателя
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаказПоставщику
	|Справочник.Файлы.Изменение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.Файлы.Изменение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.Файлы.Изменение.Объект.Документ.ПриходнаяНакладная
	|Справочник.Файлы.Изменение.Объект.Документ.РасходИзКассы
	|Справочник.Файлы.Изменение.Объект.Документ.РасходСоСчета
	|Справочник.Файлы.Изменение.Объект.Документ.Событие
	|Справочник.Файлы.Изменение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.Файлы.Изменение.Объект.Документ.СчетФактура
	|Справочник.Файлы.Изменение.Объект.Документ.СчетФактураПолученный
	|Справочник.Файлы.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Изменение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Изменение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.Спецификации
	|Справочник.Файлы.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Чтение.Объект.Документ.ДоговорКредитаИЗайма
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаданиеНаРаботу
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаказПокупателя
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаказПоставщику
	|Справочник.Файлы.Чтение.Объект.Документ.ИнвентаризацияЗапасов
	|Справочник.Файлы.Чтение.Объект.Документ.ПоступлениеНаСчет
	|Справочник.Файлы.Чтение.Объект.Документ.ПриходнаяНакладная
	|Справочник.Файлы.Чтение.Объект.Документ.РасходИзКассы
	|Справочник.Файлы.Чтение.Объект.Документ.РасходСоСчета
	|Справочник.Файлы.Чтение.Объект.Документ.Событие
	|Справочник.Файлы.Чтение.Объект.Документ.СчетНаОплатуПоставщика
	|Справочник.Файлы.Чтение.Объект.Документ.СчетФактура
	|Справочник.Файлы.Чтение.Объект.Документ.СчетФактураПолученный
	|Справочник.Файлы.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Чтение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Чтение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.Спецификации
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЭквайринговыеТерминалы.Изменение.БанковскиеСчета
	|Справочник.ЭквайринговыеТерминалы.Изменение.Кассы
	|Справочник.ЭквайринговыеТерминалы.Изменение.КассыККМ
	|Справочник.ЭквайринговыеТерминалы.Изменение.Организации
	|Справочник.ЭквайринговыеТерминалы.Чтение.БанковскиеСчета
	|Справочник.ЭквайринговыеТерминалы.Чтение.Кассы
	|Справочник.ЭквайринговыеТерминалы.Чтение.КассыККМ
	|Справочник.ЭквайринговыеТерминалы.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|";
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.АвансовыйОтчет, Истина);
	Списки.Вставить(Метаданные.Документы.АктВыполненныхРабот, Истина);
	Списки.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АктСписанияЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АмортизацияВА, Истина);
	Списки.Вставить(Метаданные.Документы.ВводНачальныхОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.Взаимозачет, Истина);
	Списки.Вставить(Метаданные.Документы.ВнесениеНаличных, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратВОборотИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратИзРегистра2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВыводИзОборотаИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВыемкаНаличных, Истина);
	Списки.Вставить(Метаданные.Документы.Доверенность, Истина);
	Списки.Вставить(Метаданные.Документы.ДоговорКредитаИЗайма, Истина);
	Списки.Вставить(Метаданные.Документы.ДополнительныеРасходы, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаданиеНаРаботу, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаПроизводство, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПокупателя, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ЗакрытиеМесяца, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВыпускКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.КадровоеПеремещение, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаПоступления, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаРеализации, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.МаршрутныйЛист, Истина);
	Списки.Вставить(Метаданные.Документы.МассоваяРассылка, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеЗарплаты, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеНалогов, Истина);
	Списки.Вставить(Метаданные.Документы.НачисленияПоКредитамИЗаймам, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоПлатежнымКартам, Истина);
	Списки.Вставить(Метаданные.Документы.ОприходованиеЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.ОтгрузкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОстаткиЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомиссионера, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомиссионераОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитенту, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетОПереработке, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетПереработчика, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВА, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВРегистр2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеДС, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеДСПлан, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеПоЯчейкам, Истина);
	Списки.Вставить(Метаданные.Документы.ПереоценкаВРозницеСуммовойУчет, Истина);
	Списки.Вставить(Метаданные.Документы.ПереоценкаТоваровНаКомиссии, Истина);
	Списки.Вставить(Метаданные.Документы.ПересортицаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПродаж, Истина);
	Списки.Вставить(Метаданные.Документы.ПлатежнаяВедомость, Истина);
	Списки.Вставить(Метаданные.Документы.ПлатежноеПоручение, Истина);
	Списки.Вставить(Метаданные.Документы.ПоказателиЕНВД, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеВКассу, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеДСПлан, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеНаСчет, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемИПередачаВРемонт, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемНаРаботу, Истина);
	Списки.Вставить(Метаданные.Документы.ПринятиеКУчетуВА, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходнаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.ПрочиеРасходы, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеЗатрат, Истина);
	Списки.Вставить(Метаданные.Документы.РасходДСПлан, Истина);
	Списки.Вставить(Метаданные.Документы.РасходИзКассы, Истина);
	Списки.Вставить(Метаданные.Документы.РасходнаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.РасходСоСчета, Истина);
	Списки.Вставить(Метаданные.Документы.РасходыПриИмпорте, Истина);
	Списки.Вставить(Метаданные.Документы.РезервированиеЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.СборкаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.СверкаВзаиморасчетов, Истина);
	Списки.Вставить(Метаданные.Документы.СдельныйНаряд, Истина);
	Списки.Вставить(Метаданные.Документы.Событие, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеВА, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеКодовМаркировкиИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеПроданныхПодарочныхСертификатов, Истина);
	Списки.Вставить(Метаданные.Документы.СчетНаОплату, Истина);
	Списки.Вставить(Метаданные.Документы.СчетНаОплатуПоставщика, Истина);
	Списки.Вставить(Метаданные.Документы.СчетФактура, Истина);
	Списки.Вставить(Метаданные.Документы.СчетФактураПолученный, Истина);
	Списки.Вставить(Метаданные.Документы.Табель, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.Увольнение, Истина);
	Списки.Вставить(Метаданные.Документы.УчетВремени, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИСВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМВозврат, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПланированияДенег, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПланированияРесурсов, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоБанку, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоБанкуИКассе, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоЗакупкам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоЗапасам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоЗарплате, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоКадрам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоКассе, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоПродажам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоПроизводству, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоСкладу, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоступленияДенег, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоУчетуВремени, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыРасходаДенег, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.КомиссионнаяТорговля, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.РозничныеПродажи, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеАкты, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеОрдера, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ЧекиККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыБухгалтерии.Управленческий, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ВыпускПродукции, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ГрафикДвиженияЗапасов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредства, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВРезерве, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваКПоступлению, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.УдалитьДенежныеСредстваПрогноз, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДоходыИРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДоходыИРасходыОтложенные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаданияНаРаботу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаПроизводство, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПокупателей, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Закупки, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗакупкиДляКУДиР, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Запасы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыВРазрезеГТД, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыВРемонте, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыКПоступлениюНаСклады, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыКРасходуСоСкладов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыНаСкладах, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыПереданные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыПереданныеВРемонте, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗапасыПринятые, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.КнигаУчетаДоходовПатент, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.НачисленияИУдержания, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.НДФЛДоходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОплатаДокументов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОплатаПлатежнымиКартами, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОплатаСчетовИЗаказов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПланыПродаж, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПлатежныйКалендарь, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПотребностьВЗапасах, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПримененныеВычетыПоНДФЛ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Продажи, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РазмещениеЗаказов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоКредитамИЗаймам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоНалогам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоЭквайрингу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПерсоналом, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПодотчетниками, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПокупателями, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПрочимиКонтрагентами, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСФондамиПоСтраховымВзносам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СдельныеНаряды, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СерийныеНомера, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СерийныеНомераКПоступлению, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СерийныеНомераКРасходу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СтраховыеВзносыДоходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СтраховыеВзносыПереданныеВПФР, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СуммовойУчетВРознице, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Табель, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ГрафикПогашенияКредитовИЗаймов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиОбменаСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОстаткиВзаиморасчетов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьСообщенийИСМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПулКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостоянияВыгрузкиНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СчетчикиПодсказок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УчетныеЗаписиПользователя, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатурыКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчета, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыДеятельностиЕНВД, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЦен, Истина);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаЛидов, Истина);
	Списки.Вставить(Метаданные.Справочники.Делегирование, Истина);
	Списки.Вставить(Метаданные.Справочники.ДисконтныеКарты, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаписиКалендаряПодготовкиОтчетности, Истина);
	Списки.Вставить(Метаданные.Справочники.КалендариСотрудников, Истина);
	Списки.Вставить(Метаданные.Справочники.Кассы, Истина);
	Списки.Вставить(Метаданные.Справочники.КассыККМ, Истина);
	Списки.Вставить(Метаданные.Справочники.КлассификаторКонтактов, Истина);
	Списки.Вставить(Метаданные.Справочники.КлассификаторОрганизацийЕГАИС, Истина);
	Списки.Вставить(Метаданные.Справочники.КонтактныеЛица, Истина);
	Списки.Вставить(Метаданные.Справочники.Контрагенты, Истина);
	Списки.Вставить(Метаданные.Справочники.Лиды, Истина);
	Списки.Вставить(Метаданные.Справочники.НоменклатураПоставщиков, Истина);
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.Проекты, Истина);
	Списки.Вставить(Метаданные.Справочники.ТорговыеТочки, Истина);
	Списки.Вставить(Метаданные.Справочники.ЭквайринговыеТерминалы, Истина);
	
КонецПроцедуры

#Область ОсновныеПрофили

// Возвращает свойства профиля "Администратор"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильАдминистратор() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Администратор", "6c4b0307-43a4-4141-9c35-3dd7e9586d41");
	
КонецФункции

// Возвращает свойства профиля "Продажи"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильПродажи() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Продажи", "76337576-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "Закупки"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильЗакупки() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Закупки", "76337577-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "Производство"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильПроизводство() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Производство", "76337578-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "Деньги"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильДеньги() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Деньги", "76337575-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "Зарплата"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильЗарплата() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Зарплата", "76337574-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "РабочееМестоКассира"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильРабочееМестоКассира() Экспорт
	
	Возврат НовыеСвойстваПрофиля("РабочееМестоКассира", "2b990bc9-6723-4485-b9da-218013bff176");
	
КонецФункции

// Возвращает свойства профиля "Налоги"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильНалоги() Экспорт
	
	Возврат НовыеСвойстваПрофиля("Налоги", "411ad1b0-aad3-4d35-993b-e17f42f68ecc");
	
КонецФункции

// Возвращает свойства профиля "ТолькоПросмотр"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильТолькоПросмотр() Экспорт
	
	Возврат НовыеСвойстваПрофиля("ТолькоПросмотр", "411ad1b0-aad3-4d35-993b-e17f42f68eda");
	
КонецФункции

// Возвращает свойства профиля "ВетеринарныйВрач"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильВетеринарныйВрач() Экспорт
	
	Возврат НовыеСвойстваПрофиля("ВетеринарныйВрач", "f43695aa-a956-4013-9158-04bece378605");
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПрофили

// Возвращает свойства профиля "РедактированиеЦенДокументов"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильРедактированиеЦенДокументов() Экспорт
	
	Возврат НовыеСвойстваПрофиля("РедактированиеЦенДокументов", "76337579-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "РедактированиеНоменклатуры"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильРедактированиеНоменклатуры() Экспорт
	
	Возврат НовыеСвойстваПрофиля("РедактированиеНоменклатуры", "76337580-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "РедактированиеРасходовПоИсточникам"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильРедактированиеРасходовПоИсточникам() Экспорт
	
	Возврат НовыеСвойстваПрофиля("РедактированиеРасходовПоИсточникам", "306e3911-b014-4821-a1d5-2284e145ee7e");
	
КонецФункции

// Возвращает свойства профиля "ВозвратыОтПокупателей"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильВозвратыОтПокупателей() Экспорт
	
	Возврат НовыеСвойстваПрофиля("ВозвратыОтПокупателей", "76337581-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "ВозвратыПоставщикам"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильВозвратыПоставщикам() Экспорт
	
	Возврат НовыеСвойстваПрофиля("ВозвратыПоставщикам", "76337582-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "СебестоимостьВОтчетеПродажи"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильСебестоимостьВОтчетеПродажи() Экспорт
	
	Возврат НовыеСвойстваПрофиля("СебестоимостьВОтчетеПродажи", "901a80bb-5f14-49b2-a4d8-ffd0df709fb9");
	
КонецФункции

// Возвращает свойства профиля "ПроведениеДенежныхДокументовСверхРезерва"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильПроведениеДенежныхДокументовСверхРезерва() Экспорт
	
	Возврат НовыеСвойстваПрофиля("ПроведениеДенежныхДокументовСверхРезерва", "76334571-bff4-11df-9174-e0cb4ed5f4c3");
	
КонецФункции

// Возвращает свойства профиля "ДобавлениеИзменениеПодсистемыПланированиеДенег"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильДобавлениеИзменениеПодсистемыПланированиеДенег() Экспорт
	
	Возврат НовыеСвойстваПрофиля("ДобавлениеИзменениеПодсистемыПланированиеДенег",
		"76334522-bff4-12df-9373-e0cb4ed5f4c1");
	
КонецФункции

// Возвращает свойства профиля "СинхронизацияДанных"
// 
// Возвращаемое значение:
//  Структура - см. НовыеСвойстваПрофиля()
//
Функция ПрофильСинхронизацияДанных() Экспорт
	
	Возврат НовыеСвойстваПрофиля("СинхронизацияДанных",
		ОбменДаннымиСервер.ПрофильДоступаСинхронизацияДанныхСДругимиПрограммами());
	
КонецФункции

#КонецОбласти

// Обновляет доступ служебного пользователя к API.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - служебный пользователь
//  Включить	 - Булево - установить или снять роли, в зависимости от признака
//
Процедура ОбновитьДоступСлужебногоПользователяКAPI(Пользователь, Включить) Экспорт
	
	Роли = РолиСлужебногоПользователяИнтеграции();
	
	Если Включить Тогда
		УстановитьРолиСлужебногоПользователя(Пользователь, Роли);
	Иначе
		СнятьРолиСлужебногоПользователя(Пользователь, Роли);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеСвойстваПрофиля(Имя, Идентификатор)
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", Имя);
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("УИД", Новый УникальныйИдентификатор(Идентификатор));
	
	Возврат Результат;
	
КонецФункции

Функция РолиСлужебногоПользователяИнтеграции()
	
	Роли = Новый Массив;
	Роли.Добавить(Метаданные.Роли.УдаленныйДоступПередачаДанных.Имя);
	Роли.Добавить(Метаданные.Роли.УдалениеДанныхOData.Имя);
	
	Возврат Роли;
	
КонецФункции

Процедура УстановитьРолиСлужебногоПользователя(Пользователь, Роли)
	
	СвойстваПользователя = СвойстваПользователя(Пользователь);
	Если СвойстваПользователя = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Пользователи, Пользователь, 
			СтрШаблон(НСтр("ru = 'Для %1 не найден пользователь информационной базы'"), Пользователь));
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвойстваПользователя.Роли, Роли, Истина);
	СвойстваДляЗаписи = Новый Структура("Роли", СвойстваПользователя.Роли);
	Пользователи.УстановитьСвойстваПользователяИБ(СвойстваПользователя.УникальныйИдентификатор, СвойстваДляЗаписи);
	
КонецПроцедуры

Процедура СнятьРолиСлужебногоПользователя(Пользователь, Роли)
	
	СвойстваПользователя = СвойстваПользователя(Пользователь);
	Если СвойстваПользователя = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Пользователи, Пользователь, 
			СтрШаблон(НСтр("ru = 'Для %1 не найден пользователь информационной базы'"), Пользователь));
		Возврат;
	КонецЕсли;
	
	РолиПользователя = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СвойстваПользователя.Роли, Роли);
	СвойстваДляЗаписи = Новый Структура("Роли", РолиПользователя);
	Пользователи.УстановитьСвойстваПользователяИБ(СвойстваПользователя.УникальныйИдентификатор, СвойстваДляЗаписи);
	
КонецПроцедуры

Функция СвойстваПользователя(Пользователь)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	Если НЕ ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Пользователи.СвойстваПользователяИБ(ИдентификаторПользователяИБ);
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Управление доступом УНФ.Обновить доступ служебного пользователя к API'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти
