#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТекста") И Параметры.Свойство("ИмяРеквизитаФормы") Тогда
		
		ИмяРеквизитаФормы =   Параметры.ИмяРеквизитаФормы;
		ТекстРедактирования = ПолучитьИзВременногоХранилища(Параметры.АдресТекста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ИмяРеквизитаФормы", ИмяРеквизитаФормы);
	ПараметрыЗакрытия.Вставить("АдресТекста", ПоместитьВоВременноеХранилище(ТекстРедактирования, Новый УникальныйИдентификатор));
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти