
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") Тогда
		СтруктураОтбора=Параметры.Отбор;
		Если ТипЗнч(СтруктураОтбора)=Тип("Структура") Тогда
			СтруктураОтбора.Свойство("РольИсполнителя", ОтборРоль);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "РолеваяАдресацияИзменена" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРольПриИзменении(Элемент)
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПользовательПриИзменении(Элемент)
	ОбновитьСписок();
	
КонецПроцедуры

Процедура ОбновитьСписок()
	Список.Параметры.УстановитьЗначениеПараметра("РольИсполнителя", ?(ЗначениеЗаполнено(ОтборРоль), ОтборРоль, NULL));
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ?(ЗначениеЗаполнено(ОтборПользователь), ОтборПользователь,  NULL));
	
КонецПроцедуры
