
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КП_ОформлениеСтрокСервер.УстановитьОформлениеСписка(Список, "Наименование");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="КП_ИзменениеНастройкиЦвета" Тогда
		ОбновитьОформлениеСписка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьОформлениеСписка()
	КП_ОформлениеСтрокСервер.УстановитьОформлениеСписка(Список, "Наименование");
	Элементы.Список.Обновить();
КонецПроцедуры

Процедура ОбновитьСписок()	
	ТекущийПользователь=КП_ОбщееСервер.ТекущийПользователь();
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ТекущийПользователь);		
КонецПроцедуры
