#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа И ПометкаУдаления Тогда
		КП_СхемаКБПСервер.ПометитьНаУдалениеТочки(Ссылка);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ИсточникОсновныхИсполнителей=1 Тогда
		ПроверяемыеРеквизиты.Добавить("РабочаяГруппаОсновныхИсполнителей");		
		ИндексИднИсполнителя=ПроверяемыеРеквизиты.Найти("ОсновныеИсполнители.ИднИсполнителя");
		Если ИндексИднИсполнителя<>Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексИднИсполнителя);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти