
#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗначениеНастройки=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("КП_ПросроченныеЗадачи", "ФлагПоказыватьПанельНастроек");
	Если ЗначениеНастройки=Неопределено Тогда
		Элементы.ПоказатьСкрытьПанельНастроек.Пометка=Ложь;
	Иначе
		Элементы.ПоказатьСкрытьПанельНастроек.Пометка=ЗначениеНастройки;
	КонецЕсли;
	
	Элементы.ПользовательскиеНастройки.Видимость=Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ЗначениеРасшифровки = Неопределено;
	Если КП_ЗадачиПроцессов.ЭтоЗадачаИсполнителю(Расшифровка, ДанныеРасшифровки, ЗначениеРасшифровки) Тогда
		СтандартнаяОбработка = НЕ КП_ОбщееКлиент.ОткрытьФормуВыполненияЗадачи(ЗначениеРасшифровки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПанельНастроек(Команда)
	Элементы.ПоказатьСкрытьПанельНастроек.Пометка=НЕ Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	Элементы.ПользовательскиеНастройки.Видимость=Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	КП_ОбщееСервер.СохранитьНастройкуПользователя("КП_ПросроченныеЗадачи", "ФлагПоказыватьПанельНастроек", Элементы.ПоказатьСкрытьПанельНастроек.Пометка);
КонецПроцедуры

#КонецОбласти