Функция Записать_JSON(Данные) Экспорт
	ЗаписьJSON=Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализацииJSON=Новый НастройкиСериализацииJSON();
	НастройкиСериализацииJSON.ВариантЗаписиДаты=ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализацииJSON.ФорматСериализацииДаты=ФорматДатыJSON.ISO;
	ЗаписатьJSON(ЗаписьJSON,Данные,НастройкиСериализацииJSON);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция Прочитать_JSON(Данные) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Данные);
	МДаты=Новый Массив();
	МДаты.Добавить("Дата");
	МДаты.Добавить("ДатаРождения");
	МДаты.Добавить("ДатаСоздания");
	МДаты.Добавить("ДатаНачалаРабот");
	МДаты.Добавить("ДатаОтгрузки");
	МДаты.Добавить("ДатаВступления");
	МДаты.Добавить("ВремяОперации");
	МДаты.Добавить("Добавлено");	
	JSONData = ПрочитатьJSON(ЧтениеJSON,,МДаты,ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	Возврат JSONData;
КонецФункции