
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Перем Заголовок;
	// Вставить содержимое обработчика.
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("ДатаВступления, НоменклатурнаяГруппаПроизводство, Подразделение, Ответственный");

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ИмяТабличнойЧасти = "Операции";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("ОперацияНомер, Операция, Участок, Количество, БазоваяЕдиницаИзмерения");

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	//Для идентификации шаблонов технлогических процессов по Номенклатуре или ном. группе
	ПровестиПоРегиструШаблоныТехнологическихПроцессов(Отказ);   
	
	Движения.Записать();	
КонецПроцедуры

Процедура ПровестиПоРегиструШаблоныТехнологическихПроцессов(Отказ)
	НаборДвижений = Движения.БЗ_ШаблоныТехнологическихПроцессов;
	НаборДвижений.Записывать = Истина;
	НаборДвижений.Очистить();
	
	Если ВыходныеИзделия.Количество() = 0 Тогда
		Движение = НаборДвижений.Добавить();
		Движение.Регистратор = Ссылка;
		Движение.НоменклатурнаяГруппаПроизводство = НоменклатурнаяГруппаПроизводство;
		Движение.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Движение.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Движение.ШаблонТехнологическогоПроцесса = Ссылка;
		Движение.Активность = Истина;
		Движение.Период = ДатаВступления; // из шапки
		Движение.ВидПартии = ВидПартии;
	Иначе
		Для Каждого СтрокаВыхИзд из ВыходныеИзделия Цикл
			Движение = НаборДвижений.Добавить();
			Движение.Регистратор = Ссылка;
			Движение.НоменклатурнаяГруппаПроизводство = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
			Движение.Номенклатура = СтрокаВыхИзд.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = СтрокаВыхИзд.ХарактеристикаНоменклатуры;
			Движение.ШаблонТехнологическогоПроцесса = Ссылка;
			Движение.Активность = Истина;
			Движение.Период = ДатаВступления; // из шапки
			Движение.ВидПартии = ВидПартии;
		КонецЦикла
	КонецЕсли;
	
	
	// Если Режим - На номенклатуру
	
	//// В одном документе не может быть 2 строки с одинаковой номенклатурой и характеристикой. Это вызовет исключение при записи в регистр.
	//Для Каждого текПродукция из Продукция Цикл
	//	Движение = НаборДвижений.Добавить();
	//	Движение.Регистратор = Ссылка;
	//	Движение.Номенклатура = текПродукция.Номенклатура;
	//	Движение.ХарактеристикаНоменклатуры = текПродукция.ХарактеристикаНоменклатуры;
	//	Движение.КлючСтроки = текПродукция.КлючСтроки;
	//	Движение.ШаблонТехнологическогоПроцесса = Ссылка;
	//	Движение.Активность = Истина;
	//	Движение.Период = ДатаВступления; // из шапки
	//КонецЦикла;
	
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.    
	ДатаВступления = НачалоДня(ТекущаяДата());
	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ОбъектКопирования, ОбъектКопирования);
	#КонецЕсли
	Комментарий = "";
КонецПроцедуры
