
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если МобильныйКлиент Тогда
	Если НЕ КП_ОбщееСервер.ИспользоватьМобильныйКлиент() Тогда
		Сообщить("В настройках модуля ""Конструктор процессов"" не включена поддержка мобильного клиента");
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	//выберем вид процесса
	ПараметрыФормы=Новый Структура("РежимВыбора, МножественныйВыбор", Истина, Ложь);
	
	ОткрытьФорму("Справочник.КП_ВидыПроцессов.ФормаВыбора", ПараметрыФормы,,,,, 
		Новый ОписаниеОповещения("Оповещение_ОкончаниеВыбораВидаПроцесса", ЭтотОбъект, Новый Структура("СсылкаПроцесса", ПараметрКоманды)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОкончаниеВыбораВидаПроцесса(Результат, ДопПараметры) Экспорт
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы=Новый Структура("ВидПроцесса", Результат);
	ПараметрыФормы.Вставить("СсылкаПроцесса", ДопПараметры.СсылкаПроцесса);
	ОткрытьФорму("БизнесПроцесс.КП_БизнесПроцесс.ФормаОбъекта", ПараметрыФормы);//, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
