&НаСервере
Процедура ОтправитьВWMSНаСервере()
	Записать();
	БЗ_WMS_Обмен.БЗ_WMS_СозданиеЗНП(Объект.Ссылка,ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВWMS()
	ОтправитьВWMSНаСервере()
КонецПроцедуры

&НаСервере
Процедура БЗ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	КомандаФормы=Команды.Добавить("ОтправитьВWMS");
    КомандаФормы.Действие="ОтправитьВWMS";
	КомандаФормы.Картинка=БиблиотекаКартинок.ПереместитьВправо;
    КомандаФормы.Заголовок="Отправить в WMS";
    
	Кнопка=Элементы.Добавить("ОтправитВWMS", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	Кнопка.ИмяКоманды="ОтправитьВWMS";
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Кнопка.ПоложениеВКоманднойПанели=ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
КонецПроцедуры

&НаКлиенте
Процедура БЗ_СостояниеЗаказаПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	Если Строка(Объект.СостояниеЗаказа)="В наборке" Тогда
			П= Новый Структура("Заказ",Объект.Ссылка);
			
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура БЗ_БЗ_ГлавныйЗаказПриИзмененииПослеНаСервере()
	глЗаказ=Объект.БЗ_ГлавныйЗаказ;
	Ошибка = ложь;
	Если глЗаказ<>ДОкументы.ЗаказПокупателя.ПустаяСсылка() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.БЗ_Компания = &БЗ_Компания
		|			ИЛИ Контрагенты.Ссылка = &Ссылка)";
		
		Запрос.УстановитьПараметр("БЗ_Компания", объект.Контрагент.БЗ_Компания);
		Запрос.УстановитьПараметр("Ссылка", объект.Контрагент);	
		РезультатЗапроса = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		контр=Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
			контр=контр или (ВыборкаДетальныеЗаписи.ссылка = глЗаказ.Контрагент)	;	
		КонецЦикла;		
		Если не контр Тогда
			Ошибка=Истина;
			Сообщить("Контрагент не совпадает!");
		КонецЕсли;
		Если глЗаказ.ДатаОтгрузки<>объект.ДатаОтгрузки Тогда
			Ошибка=Истина; 
			Сообщить("Не совпадает дата отгрузки!");
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.БЗ_ГлавныйЗаказ = &БЗ_ГлавныйЗаказ";
		
		Запрос.УстановитьПараметр("БЗ_ГлавныйЗаказ", Объект.Ссылка);		
		РезультатЗапроса = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Ошибка=Истина;
			Сообщить("Заказ является главным!");	
		КонецЕсли;			
		Если Ошибка Тогда		
			Объект.БЗ_ГлавныйЗаказ=Документы.ЗаказПокупателя.ПустаяСсылка(); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура БЗ_БЗ_ГлавныйЗаказПриИзмененииПосле(Элемент)
	БЗ_БЗ_ГлавныйЗаказПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура БЗ_БЗ_ГлавныйЗаказОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;

	/////Если хотим несколько условий
	//ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидОперации");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары");

	//ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Дата");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.больше;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = НачалоГода(ТекущаяДата());

	//ПараметрыВыбора = Новый Структура;
	//ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	//ПараметрыВыбора.Вставить("РежимВыбора",Истина);
	//ПараметрыВыбора.Вставить("МножественныйВыбор",Истина);

	//ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");

	//ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаВыбора",ПараметрыВыбора,
	//        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры
					