
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Выполняется только при закрытии формы
	ЗаписатьНаСервере();
	Отказ = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеИспользоватьПриИзменении(Элемент)
	ПредставленияОснованийУвольненияПредставлениеИспользоватьПриИзменении(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНаКлиенте(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)
	ПредставленияОснованийУвольненияПриПолученииДанныхНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	ПредставленияОснованийУвольненияЗаписатьНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПредставленияОснованийУвольненияПредставлениеИспользоватьПриИзменении(Форма)
	
	Элементы = Форма.Элементы;
	Если Форма.Представление.Использовать Тогда
		Элементы.ПредставлениеНаименование.Видимость = Истина;
		Элементы.ПредставлениеТекстОснования.Видимость = Истина;
		Элементы.Наименование.Видимость = Ложь;
		Элементы.ТекстОснования.Видимость = Ложь;
	Иначе
		Элементы.ПредставлениеНаименование.Видимость = Ложь;
		Элементы.ПредставлениеТекстОснования.Видимость = Ложь;
		Элементы.Наименование.Видимость = Истина;
		Элементы.ТекстОснования.Видимость = Истина;
	КонецЕсли;
	
	Если Форма.Представление.Использовать
			И Не ЗначениеЗаполнено(Форма.Представление.Наименование)
			И Не ЗначениеЗаполнено(Форма.Представление.ТекстОснования) Тогда
		Форма.Представление.Наименование = Форма.Объект.Наименование;
		Форма.Представление.ТекстОснования = Форма.Объект.ТекстОснования;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПредставленияОснованийУвольненияПриПолученииДанныхНаСервере(Форма, ТекущийОбъект)
	
	ИспользуетсяПредставлениеОснованийУвольнения = Ложь;
	Элементы = Форма.Элементы;
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ПредставленияОснованийУвольнения = РегистрыСведений.ПредставленияОснованийУвольнения.СоздатьМенеджерЗаписи();
		Если Не ТекущийОбъект.Ссылка.Пустая() Тогда
			ПредставленияОснованийУвольнения.Объект = ТекущийОбъект.Ссылка;
			ПредставленияОснованийУвольнения.Прочитать();
		КонецЕсли;
		Форма.ЗначениеВРеквизитФормы(ПредставленияОснованийУвольнения, "Представление");
		ИспользуетсяПредставлениеОснованийУвольнения = ПредставленияОснованийУвольнения.Использовать;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеИспользовать", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗаписатьИЗакрыть", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗаписать", "Видимость", Истина);
	КонецЕсли;
	
	Если ИспользуетсяПредставлениеОснованийУвольнения Тогда
		Элементы.ПредставлениеНаименование.Видимость = Истина;
		Элементы.ПредставлениеТекстОснования.Видимость = Истина;
		Элементы.Наименование.Видимость = Ложь;
		Элементы.ТекстОснования.Видимость = Ложь;
	Иначе
		Элементы.ПредставлениеНаименование.Видимость = Ложь;
		Элементы.ПредставлениеТекстОснования.Видимость = Ложь;
		Элементы.Наименование.Видимость = Истина;
		Элементы.ТекстОснования.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПредставленияОснованийУвольненияЗаписатьНаСервере(Форма)
	
	Если Форма.Представление.Использовать Тогда
		ПредставленияОснованийУвольнения = Форма.РеквизитФормыВЗначение("Представление");
		ПредставленияОснованийУвольнения.Объект = Форма.Объект.Ссылка;
		ПредставленияОснованийУвольнения.Записать();
	Иначе
		НаборЗаписей = РегистрыСведений.ПредставленияОснованийУвольнения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Форма.Объект.Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Форма.Модифицированность = Ложь;
	
	ПредставленияОснованийУвольненияПриПолученииДанныхНаСервере(Форма, Форма.Объект);
	
КонецПроцедуры


#КонецОбласти
