
&ИзменениеИКонтроль("УстановкаПараметровСеанса")
Процедура БЗ_УстановкаПараметровСеанса(ИменаПараметровСеанса)

	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы

	// ТехнологияСервиса
	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса
#Удаление

#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
ПараметрыСеанса.БЗ_ПроводитьБезКонтроляОстатков=Ложь;

#КонецВставки
КонецПроцедуры
