
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Контролер<>Пользователи.ТекущийПользователь() Тогда
		Элементы.Период.ТолькоПросмотр=Истина;	
		Элементы.Исполнитель.ТолькоПросмотр=Истина;
		Элементы.Контролер.ТолькоПросмотр=Истина;
		Элементы.ТекстРецензии.ТолькоПросмотр=Истина;
		Элементы.РезультатОднобрено.ТолькоПросмотр=Истина;
		
		Элементы.ФормаЗаписатьИЗакрыть.Видимость=Ложь;
		Элементы.ФормаПеречитать.Видимость=Ложь;
		Элементы.ФормаЗаписать.Видимость=Ложь;
		
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию=Истина;
		
	КонецЕсли;
	
	РезультатОднобрено=?(Запись.РезультатОдобрен, 1, 2);
	
КонецПроцедуры
