
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось определить рабочее место";
		Сообщение.Сообщить();
	КонецЕсли;
	
	НастройкаРМК = РабочееМестоКассираВызовСервера.ПолучитьНастройкуРМК(РабочееМесто);
	
	Если ЗначениеЗаполнено(НастройкаРМК) Тогда
		СтруктураПараметров = Новый Структура("Ключ", НастройкаРМК);
		ОткрытьФорму("Справочник.НастройкиРМК.ФормаОбъекта", СтруктураПараметров);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана настройка РМК";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти