#Область ПрограммныйИнтерфейс

//Инициализирует СКД переопределяемым текстом запроса
//
//Параметры:
//   Источник - ОтчетОбъект - инициализируемый отчет.
//   Форма - УправляемаяФорма, Неопределено - форма отчета.
Процедура ИнициализироватьСхемуКомпоновки(Источник, Форма = Неопределено) Экспорт
	
	ТекстЗапроса = Источник.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос;
	
	ТекстПоиска = Источник.ПереопределяемаяЧасть();
	ТекстЗамены = Неопределено;
	ОтчетыИСПереопределяемый.ПриПереопределенииТекстаЗапроса(ТекстЗамены, Источник);
	
	Если Не(ТекстЗамены = Неопределено) Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
		Источник.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = ТекстЗапроса;
		
		Если Не(Форма = Неопределено) Тогда
			Форма.НастройкиОтчета.СхемаМодифицирована = Истина;
			Форма.НастройкиОтчета.АдресСхемы = ПоместитьВоВременноеХранилище(Источник.СхемаКомпоновкиДанных, Форма.УникальныйИдентификатор);
			Форма.Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Источник.СхемаКомпоновкиДанных));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Переопределяемая область данных прикладных документов отчетов о расхождениях при оформлении
//
//Возвращаемое значение:
//   Строка - типовая часть запроса, которую требуется переопределять
//
Функция ШаблонПолученияДанныхПрикладныхДокументов() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	""Переопределяемый"" КАК Ссылка,
	|	&ПустаяНоменклатура КАК Номенклатура,
	|	&ПустаяХарактеристика КАК Характеристика,
	|	&ПустаяСерия КАК Серия,
	|	0 КАК Количество
	|ПОМЕСТИТЬ ТоварыНакладной
	|;
	|
	|";
	
КонецФункции

#КонецОбласти
