&После("ОбработкаПроведения")
Процедура БЗ_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Отказ Тогда Возврат КонецЕсли;
	БЗ_WMS_Обмен.БЗ_WMS_СозданиеЗНП(Ссылка);
		Если  БЗ_СтарыйГлавныйЗаказ<>БЗ_ГлавныйЗаказ и ЗначениеЗаполнено(БЗ_СтарыйГлавныйЗаказ) Тогда
		БЗ_WMS_Обмен.БЗ_WMS_СозданиеЗНП(БЗ_СтарыйГлавныйЗаказ);		
	КонецЕсли;
	

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура БЗ_ОбработкаУдаленияПроведения(Отказ)	
	БЗ_WMS_Обмен.БЗ_WMS_СозданиеЗНП(Ссылка);
		Если  БЗ_СтарыйГлавныйЗаказ<>БЗ_ГлавныйЗаказ и ЗначениеЗаполнено(БЗ_СтарыйГлавныйЗаказ) Тогда
		БЗ_WMS_Обмен.БЗ_WMS_СозданиеЗНП(БЗ_СтарыйГлавныйЗаказ);		
	КонецЕсли;
	

КонецПроцедуры

&Перед("ПередЗаписью")
Процедура БЗ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не Этоновый() Тогда
		БЗ_СтарыйГлавныйЗаказ=Ссылка.БЗ_ГлавныйЗаказ;		
	КонецЕсли;
	Если не значениеЗаполнено(Бз_Назначение) И ЗначениеЗАполнено(Контрагент) Тогда
			
			бз_Назначение=Контрагент.БЗ_НазначениеПоУмолчанию;
			
		конецЕсли;


КонецПроцедуры
