
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура БЗ_ОбработкаПроведения(Отказ, РежимПроведения)

	// Этапы производства
	ПроверитьЗаполнениеЭтаповПроизводства(Отказ, ВариантЗавершения=Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	// Инициализация данных документа
	Документы.ЗаказНаПроизводство.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьГрафикДвиженияЗапасов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыНаПроизводство(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПотребностьВЗапасах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРазмещениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ);

	// Этапы производства
	Если ВидОперации=Перечисления.ВидыОперацийЗаказНаПроизводство.Сборка Тогда
		УправлениеНебольшойФирмойСервер.ОтразитьЭтапыПроизводства(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли; 

	// Ресурсы предприятия
	Если ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятия") Тогда
		УправлениеНебольшойФирмойСервер.ОтразитьРесурсыПредприятия(ДополнительныеСвойства, Движения, Отказ);
		ТаблицаРесурсыПредприятия = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРесурсыПредприятия;
		ПланированиеРесурсовУНФ.СформироватьЗаписиКолендаряСотрудникаПоРесурсам(Ссылка,ТаблицаРесурсыПредприятия,Отказ);
	КонецЕсли;

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.ЗаказНаПроизводство.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
#Удаление

#КонецУдаления
#Вставка
Если БЗ_УчитыватьВОстаткахНазначений Тогда
движения.БЗ_ОстаткиНазначений.Записывать=Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаЗапасовПродукция.НомерСтроки КАК НомерСтроки,
		|	СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница КАК Подразделение,
		|	СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
		|	СборкаЗапасовПродукция.Характеристика КАК Характеристика,
		|	СборкаЗапасовПродукция.БЗ_Назначение КАК Назначение,
		|	СборкаЗапасовПродукция.Количество КАК Количество,
		|	&Ссылка КАК Регистратор,
		|	СборкаЗапасовПродукция.Ссылка.Дата КАК Период,
		|	&Ссылка КАК ЗаказНаПроизводство
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК СборкаЗапасовПродукция
		|ГДЕ
		|	СборкаЗапасовПродукция.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  НоваяСтрока=   Движения.БЗ_ОстаткиНазначений.ДобавитьПриход();
	  ЗаполнитьЗначенияСвойств(новаяСтрока,ВыборкаДетальныеЗАписи);
  КонецЦикла;
КонецЕсли;

#КонецВставки
КонецПроцедуры

&После("ПередЗаписью")
Процедура БЗ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда 
		БЗ_УчитыватьВОстаткахНазначений=Истина;	
	КонецЕсли;
КонецПроцедуры
