
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИскатьПоКоду") Тогда	
		ИскатьПоКоду = Параметры.ИскатьПоКоду;
	КонецЕсли;
	Если Параметры.Свойство("ИскатьПоШтрихкоду") Тогда	
		ИскатьПоШтрихкоду = Параметры.ИскатьПоШтрихкоду;
	КонецЕсли;
	Если Параметры.Свойство("ИскатьПоАртикулу") Тогда	
		ИскатьПоАртикулу = Параметры.ИскатьПоАртикулу;
	КонецЕсли;
	Если Параметры.Свойство("ИскатьПоНаименованию") Тогда	
		ИскатьПоНаименованию = Параметры.ИскатьПоНаименованию;
	КонецЕсли;
	Если Параметры.Свойство("ИскатьПоНаименованиюЛевойЧасти") Тогда	
		ИскатьПоНаименованиюЛевойЧасти = Параметры.ИскатьПоНаименованиюЛевойЧасти;
	КонецЕсли;
	Если Параметры.Свойство("ИскатьПоНаименованиюПолному") Тогда	
		ИскатьПоНаименованиюПолному	= Параметры.ИскатьПоНаименованиюПолному;
	КонецЕсли;
	Если Параметры.Свойство("ИскатьПоНаименованиюПолномуЛевойЧасти") Тогда	
		ИскатьПоНаименованиюПолномуЛевойЧасти = Параметры.ИскатьПоНаименованиюПолномуЛевойЧасти;
	КонецЕсли;
	Если Параметры.Свойство("ВариантПоиска") Тогда	
		ВариантПоиска = Параметры.ВариантПоиска;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатНастройки = Новый Структура;
	РезультатНастройки.Вставить("ВариантПоиска",	ВариантПоиска);
	РезультатНастройки.Вставить("ИскатьПоКоду",		ИскатьПоКоду);
	РезультатНастройки.Вставить("ИскатьПоШтрихкоду",ИскатьПоШтрихкоду);
	РезультатНастройки.Вставить("ИскатьПоАртикулу", ИскатьПоАртикулу);
	РезультатНастройки.Вставить("ИскатьПоНаименованию",	ИскатьПоНаименованию);
	РезультатНастройки.Вставить("ИскатьПоНаименованиюЛевойЧасти", ИскатьПоНаименованиюЛевойЧасти);
	РезультатНастройки.Вставить("ИскатьПоНаименованиюПолному",	ИскатьПоНаименованиюПолному);
	РезультатНастройки.Вставить("ИскатьПоНаименованиюПолномуЛевойЧасти", ИскатьПоНаименованиюПолномуЛевойЧасти);
	
	Закрыть(РезультатНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти