#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора=ЭтаФорма.Параметры.РежимВыбора;

	Если Элементы.Список.РежимВыбора Тогда
		РежимОткрытияОкна=РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ТекущийПользователь=Пользователи.ТекущийПользователь();
	
	Если Параметры.Свойство("Отбор") Тогда
		Параметры.Отбор.Свойство("ВидПроцесса", ВидПроцесса);
		Параметры.Отбор.Свойство("ТочкаКБП", ТочкаКБП);
		Параметры.Отбор.Свойство("АвторШаблона", АвторШаблона);
		Параметры.Отбор.Свойство("ОтчетИсполнителя", ОтчетИсполнителя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидПроцессаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидПроцесса", ?(ЗначениеЗаполнено(ВидПроцесса), ВидПроцесса, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрыватьСписокШаблоновВыполненияЗадачБезОтбораЗначение=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("НастройкиПользователя", "ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора", , СокрЛП(ТекущийПользователь));
	Если ОткрыватьСписокШаблоновВыполненияЗадачБезОтбораЗначение=Неопределено Тогда
		ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора=Ложь;
		
	Иначе
		ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора=ОткрыватьСписокШаблоновВыполненияЗадачБезОтбораЗначение;
		
	КонецЕсли;

	Если ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора Тогда
		ВидПроцесса=NULL;
		ТочкаКБП=NULL;
		АвторШаблона=NULL;
		ОтчетИсполнителя=NULL;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидПроцесса", ?(ЗначениеЗаполнено(ВидПроцесса), ВидПроцесса, NULL));
	Список.Параметры.УстановитьЗначениеПараметра("ТочкаКБП", ?(ЗначениеЗаполнено(ТочкаКБП), ТочкаКБП, NULL));
    Список.Параметры.УстановитьЗначениеПараметра("АвторШаблона", ?(ЗначениеЗаполнено(АвторШаблона), АвторШаблона, NULL));
	Список.Параметры.УстановитьЗначениеПараметра("ОтчетИсполнителя", ?(ЗначениеЗаполнено(ОтчетИсполнителя), ОтчетИсполнителя, NULL));
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ТочкаКБППриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ТочкаКБП", ?(ЗначениеЗаполнено(ТочкаКБП), ТочкаКБП, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура АвторШаблонаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("АвторШаблона", ?(ЗначениеЗаполнено(АвторШаблона), АвторШаблона, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетИсполнителяПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ОтчетИсполнителя", ?(ЗначениеЗаполнено(ОтчетИсполнителя), ОтчетИсполнителя, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=Истина;
	ПараметрыФормы=Новый Структура;
	
	ПараметрыЗаполнения=Новый Структура;
	ПараметрыЗаполнения.Вставить("ВидПроцесса", ВидПроцесса);
	ПараметрыЗаполнения.Вставить("ОтчетИсполнителя", ОтчетИсполнителя);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.КП_ШаблоныОбработкиЗадач.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

