
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ИсходныйПоказатель") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗаголовокФормы(Параметры.ИсходныйПоказатель);
	ИсходныйПоказатель = Параметры.ИсходныйПоказатель;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактирование(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ИсходныйПоказатель", ИсходныйПоказатель);
	
	ПараметрыЗакрытия.Вставить("ВыбранныйПоказатель", ПоказательИсточник);
	ПараметрыЗакрытия.Вставить("Процент", Процент);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗаголовокФормы(Показатель)
	
	ШаблонСтроки = НСтр("ru = 'Сформировать сумму %2 по показателю'");
	ЭтаФорма.Заголовок = СтрШаблон(ШаблонСтроки, Показатель);
	
КонецПроцедуры

#КонецОбласти




