
&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент) 
	ОтборРодительНайден = Ложь;	
	Для Каждого ЭлементОтбора из ЭтаФорма.Список.Отбор.Элементы Цикл   
		Если ЭлементОтбора.ИдентификаторПользовательскойНастройки = "Родитель" Тогда
			ОтборРодительНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ОтборРодительНайден Тогда 
		ЭлементОтбора  = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	КонецЕсли;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель"); ;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	ЭлементОтбора.Использование	=Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;   
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "Родитель";
	ЭлементОтбора.ПравоеЗначение = Элемент.ТекущаяСтрока;
КонецПроцедуры
