#Область СлужебныеПроцедурыИФункции

// Функция выполняет формирования наименования на основании данных объекта
// Параметры:
//	СсылкаНаОбъект - ссылка на объект
// Возвращаемое значение: Строка
Функция СформироватьНаименование(СсылкаНаОбъект) Экспорт
	
	НазваниеРоли=СокрЛП(СсылкаНаОбъект.РольИсполнителя);	
	НазваниеОсновногоОбъекта=СокрЛП(СсылкаНаОбъект.ОсновнойОбъектАдресации);
	НазваниеДополнительногоОбъекта=СокрЛП(СсылкаНаОбъект.ДополнительныйОбъектАдресации);
	
	СтрокаНаименование=НазваниеРоли+?(НазваниеОсновногоОбъекта="", "", " | "+НазваниеОсновногоОбъекта)+?(НазваниеДополнительногоОбъекта="", "", " | "+НазваниеДополнительногоОбъекта);
	
	Возврат СтрокаНаименование;
	
КонецФункции

#КонецОбласти