Процедура ОбработчикОперации() Экспорт
	Если БЗ_TSDRU.Сессия().ПараметрыСессии.Режим="" Тогда
		Инициализация();
	Иначе
		Если БЗ_TSDRU.Запрос().action="" Тогда
			Выполнить(БЗ_TSDRU.Сессия().ПараметрыСессии.Режим+"_Активация()");
		Иначе
			Выполнить(БЗ_TSDRU.Сессия().ПараметрыСессии.Режим+"_ОбработчикСобытий()");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура АктивироватьРежим(Режим)
	БЗ_TSDRU.Сессия().ПараметрыСессии.Режим=Режим;
	Выполнить(Режим+"_Активация()");	
КонецПроцедуры

Процедура Инициализация()
	АктивироватьРежим("Авторизация");
КонецПроцедуры
//---- Авторизация -----
Процедура Авторизация_Активация()
	СТОтвет=БЗ_TSDRU.Ответ();
	БЗ_TSDAPI.ИнициализацияПакетаОтвета(БЗ_TSDRU.ТипыФреймов().authorization);
	Данные=Новый Структура();
	//Данные.Вставить("logo",БЗ_TSDAPI.ПолучитьКартинку("logo"));
	Данные.Вставить("logo_svg",БЗ_TSDAPI.ПолучитьКартинку("logo_svg"));
	                                                           
	ДопПараметры=БЗ_TSDRU.ПараметрыПакетОтвета();
	СТОтвет.payload=Данные;
	СТОтвет.Вставить(ДопПараметры.scan_hook,"y");
	СТОтвет.Вставить(ДопПараметры.key_hook,"0004,0066");	
КонецПроцедуры

Процедура Авторизация_ОбработчикСобытий()
	СТСессия=БЗ_TSDRU.Сессия();
	СТЗапрос=БЗ_TSDRU.Запрос();
	СТОтвет=БЗ_TSDRU.Ответ();
	БЗ_TSDAPI.УдалитьПросроченныеСессии();
	Если СТЗапрос.action="pin" Тогда
		Если СТЗапрос.data<>"" Тогда
			СТСессия.Сотрудник=Справочники.БЗ_Сотрудники_ТСД.НайтиПоРеквизиту("ПинКод",БЗ_TSDAPI.ПолучитьПоле(СТЗапрос.data,Символ(13)));
		КонецЕсли;
		Ошибка="ОШИБКА !!!"+Символы.ПС+"ВВЕДЕН НЕВЕРНЫЙ ПИН-КОД";
	ИначеЕсли СТЗапрос.action="idscan" Тогда	
		СТСессия.Сотрудник=Справочники.БЗ_Сотрудники_ТСД.НайтиПоРеквизиту("СканКод",БЗ_TSDAPI.ПолучитьПоле(СТЗапрос.data,Символ(13)));
		Ошибка="ОШИБКА !!!"+Символы.ПС+"НЕДЕЙСТВИТЕЛЬНЫЙ БЕЙДЖ";
	Иначе
		БЗ_TSDAPI.ПустойОтветНаЗапрос();
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СТСессия.Сотрудник) Тогда
		БЗ_TSDAPI.ПоказатьОшибку(Ошибка,БЗ_TSDRU.ТипыФреймов().authorization_update);
		Возврат;
	Иначе		
		БЗ_TSDRU.Ответ().Вставить(БЗ_TSDRU.ПараметрыПакетОтвета().play_sound,"login");
		БЗ_TSDAPI.ВосстановитьДанныеСессии();
	КонецЕсли;
КонецПроцедуры