#Область ПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ ПО СОТРУДНИКАМ


Функция ВыполнитьРасчетВзносовИНалоговПоСотрудникам(Организация,ПериодРасчета, СобытиеКалендаря) Экспорт
	
		
	СтруктураРасчета = Новый Структура(
		"Организация,
		|СобытиеКалендаря,
		|ПериодОтчетности,
		|НДФЛСотрудники,
		|ПФРПоСуммарномуТарифу,
		|ПФРНакопительнаяСотрудники,
		|ПФРСтраховаяСотрудники,
		|ФСССотрудники,
		|ФССТравматизмСотрудники,
		|ФОМССотрудники,
		|ВидВзаиморасчетовСБюджетом,
		|СуммаВзаиморасчетовСБюджетом,
		|ДокументВзаиморасчетовСБюджетом,
		|СуммаНалога",
		Организация,
		СобытиеКалендаря,
		ПериодРасчета,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		Справочники.ВидыНалогов.ПустаяСсылка(),
		0,
		Неопределено,
		0);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК НДФЛНалогОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФФОМСОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураРасчета.НДФЛСотрудники = Выборка.НДФЛ;
	КонецЕсли;
	
	Выборка = Пакет[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		СтруктураРасчета.ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		СтруктураРасчета.ФСССотрудники = Выборка.ФССОборот;
		СтруктураРасчета.ФОМССотрудники = Выборка.ФФОМСОборот;
		СтруктураРасчета.ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
	СтруктураРасчета.СуммаНалога = СтруктураРасчета.НДФЛСотрудники+
			СтруктураРасчета.ПФРСтраховаяСотрудники+
			СтруктураРасчета.ПФРНакопительнаяСотрудники+
			СтруктураРасчета.ФСССотрудники+
			СтруктураРасчета.ФОМССотрудники+
			СтруктураРасчета.ФССТравматизмСотрудники;
	
		// запись состояние события календаря
	Если СобытиеКалендаря <> Неопределено Тогда
		
		КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
			Организация,
			СобытиеКалендаря,
			Перечисления.СостоянияСобытийКалендаря.Ознакомиться,
			"",
			СтруктураРасчета.СуммаНалога);
			
		
	КонецЕсли;
	РегламентированнаяОтчетностьУСН.ОтразитьЗначенияПоказателейОтчетности(СтруктураРасчета);
	
	
	ЗафиксироватьТранзакцию();
	
	Возврат СтруктураРасчета;
	
КонецФункции

Процедура ВыполнитьРасчетВзносовИНалоговПоСотрудникамПредварительный(Организация,ПериодРасчета, ДатаДокументаОбработкиСобытия, ЗаписьСобытия) Экспорт
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК НДФЛНалогОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФФОМСОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		НДФЛСотрудники = Выборка.НДФЛ;
	Иначе
		НДФЛСотрудники = 0;
	КонецЕсли;
	
	Выборка = Пакет[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		ФСССотрудники = Выборка.ФССОборот;
		ФОМССотрудники = Выборка.ФФОМСОборот;
		ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
		// запись состояние события календаря
	Если ЗаписьСобытия <> Неопределено Тогда
		
		СуммаЗаПредыдущиеПериоды = РегламентированнаяОтчетностьУСН.ПредварительнаяСуммаНалогаЗаПредыдущиеПериоды(Организация, Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300тр, ДатаДокументаОбработкиСобытия);
		СобытиеКалендаряОбъект = ЗаписьСобытия.ПолучитьОбъект();
		СобытиеКалендаряОбъект.СуммаНалога = 
			НДФЛСотрудники+
			ПФРСтраховаяСотрудники+
			ПФРНакопительнаяСотрудники+
			ФСССотрудники+
			ФОМССотрудники+
			ФССТравматизмСотрудники;
		
		СобытиеКалендаряОбъект.СуммаНалога = ?(СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды > 0, СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды, 0);;
		СобытиеКалендаряОбъект.Записать();
		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьПроверкуНаличияДокументовПоЗарплатеСотрудников(Организация,ПериодРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	НачислениеЗарплаты.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплаты.Организация КАК Организация
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Организация = &Организация
	|	И НачислениеЗарплаты.ПериодРегистрации МЕЖДУ &НачалоКвартала И &КонецКвартала
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплаты.ПериодРегистрации";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоКвартала",НачалоКвартала(ПериодРасчета));
	Запрос.УстановитьПараметр("КонецКвартала",КонецКвартала(ПериодРасчета));
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивДат.Добавить(НачалоМесяца(Выборка.ПериодРегистрации));
	КонецЦикла;
	
	ТекстПустыхМесяцев = "";
	НачальнаяДата = НачалоКвартала(ПериодРасчета);
	Для инд = 0 По 2 Цикл
		Если МассивДат.Найти(ДобавитьМесяц(НачальнаяДата, инд)) <> Неопределено Тогда
			ТекстПустыхМесяцев = ТекстПустыхМесяцев + ?(ПустаяСтрока(ТекстПустыхМесяцев),"",", ")+Формат(ДобавитьМесяц(НачальнаяДата, инд), "ДФ=MMMM");
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстПустыхМесяцев) Тогда 
		Возврат Новый Структура("ДокументыВНаличии, ТекстУведомления",Истина,"");
	Иначе
		Возврат Новый Структура("ДокументыВНаличии, ТекстУведомления", Ложь,
			Нстр("ru = 'Отсутствуют документы Начисление зарплаты за месяцы:"+ТекстПустыхМесяцев+"
				|Если зарплата в эти месяцы начислялась, необходимо добавить и документы.'"));
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьПроверкуНаличияДокументаПоЗарплатеСотрудниковЗаМесяц(Организация,ПериодРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	НачислениеЗарплаты.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплаты.Организация КАК Организация
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Организация = &Организация
	|	И НачислениеЗарплаты.ПериодРегистрации = &ПериодРегистрации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплаты.ПериодРегистрации";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации",НачалоМесяца(ПериодРасчета));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции


#КонецОбласти
