
Функция СтрокаСпискаУзловГруппировок() Экспорт
	
	СтрокаСписка="{""#"",4772b3b4-f4a3-49c0-a1a5-8cb5961511a3,
			|{6,1e512aab-1b41-4ef6-9375-f0137be9dd91,0,0,
			|{3,
			|{1e512aab-1b41-4ef6-9375-f0137be9dd91,
			|{""Новые задачи"",0,
			|{""#"",7c2a069c-8bdf-4e87-8ec0-1747f7f100f8,
			|{0,
			|{""S"",""Новые задачи""},""ТипЗадач"",""ТипЗадач"",
			|{""U""}
			|}
			|},
			|{3,0,
			|{0},"""",-1,-1,0,0},0,0,""""}
			|},
			|{1e512aab-1b41-4ef6-9375-f0137be9dd91,
			|{""Задачи в работе"",0,
			|{""#"",7c2a069c-8bdf-4e87-8ec0-1747f7f100f8,
			|{0,
			|{""S"",""Задачи в работе""},""ТипЗадач"",""ТипЗадач"",
			|{""U""}
			|}
			|},
			|{3,0,
			|{0},"""",-1,-1,0,0},1,0,""""}
			|},
			|{1e512aab-1b41-4ef6-9375-f0137be9dd91,
			|{""Выполненные задачи"",0,
			|{""#"",7c2a069c-8bdf-4e87-8ec0-1747f7f100f8,
			|{0,
			|{""S"",""Выполненные задачи""},""ТипЗадач"",""ТипЗадач"",
			|{""U""}
			|}
			|},
			|{3,0,
			|{0},"""",-1,-1,0,0},2,0,""""}
			|}
			|},
			|{""Pattern""},0,2}
			|}";

	Возврат СтрокаСписка;

КонецФункции