
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Телефония(Команда)
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", "Телефония");
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение",ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы",ПараметрыНастроек,,,,,ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура Почта(Команда)
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", "Настроить учетные записи");
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение",ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы",ПараметрыНастроек,,,,,ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура Телеграм(Команда)
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", "Интеграция с мессенджерами");
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение",ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы",ПараметрыНастроек,,,,,ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура Вконтакте(Команда)
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", "Интеграция с мессенджерами");
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение",ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы",ПараметрыНастроек,,,,,ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура ОбменССайтом(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение",ЭтотОбъект);
	ОткрытьФорму("ПланОбмена.ОбменУправлениеНебольшойФирмойСайт.Форма.ФормаСписка",,,,,ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура КабинетКлиента(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение",ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиПубликацииМЛК.Форма.КонструкторМобильногоПриложения",,,,,ОповещениеОЗакрытии);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаКаналовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	РазрешеноПодключатьКаналы = Пользователи.ЭтоПолноправныйПользователь();
	
	УстановитьПривилегированныйРежим(Истина);
	Подключено_Телефония = КонтактЦентр.ПодключенаТелефония();
	Подключено_Почта     = КонтактЦентр.ПодключенаПочта();
	Подключено_КабинетКлиента = КонтактЦентр.ПодключенКабинетКлиента();
	Подключено_Сайт = КонтактЦентр.ПодключенСайт();
	Подключено_Телеграм = КонтактЦентр.ПодключенТелеграм();
	Подключено_Вконтакте = КонтактЦентр.ПодключенВконтакте();
	УстановитьПривилегированныйРежим(Ложь);

	УстановитьПризнакиПодключенияКаналов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиПодключенияКаналов()
	Реквизиты = ЭтотОбъект.ПолучитьРеквизиты();
	Для Каждого Реквизит Из Реквизиты Цикл
		Если СтрНайти(Реквизит.Имя, "Подключено") = 0 Тогда
			Продолжить;
		КонецЕсли;
		Канал = Прав(Реквизит.Имя, СтрДлина(Реквизит.Имя) - СтрНайти(Реквизит.Имя, "_"));
		Элементы["ВРаботе_"+Канал].Видимость = ЭтотОбъект[Реквизит.Имя];
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
