#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗначениеНастройки=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("КП_ЗадачиСотрудников", "ФлагПоказыватьПанельНастроек");
	Если ЗначениеНастройки=Неопределено Тогда
		Элементы.ПоказатьСкрытьПанельНастроек.Пометка=Ложь;
	Иначе
		Элементы.ПоказатьСкрытьПанельНастроек.Пометка=ЗначениеНастройки;
	КонецЕсли;
	
	Элементы.ПользовательскиеНастройки.Видимость=Элементы.ПоказатьСкрытьПанельНастроек.Пометка;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЭлементыНастройки=Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ОтборПоСроку=Новый ПараметрКомпоновкиДанных("КрайнийСрок");
	
	Для НомерЭлемента=0 По ЭлементыНастройки.Элементы.Количество()-1 Цикл
		ЭлементНастройки=ЭлементыНастройки.Элементы[НомерЭлемента];
		
		Если ТипЗнч(ЭлементНастройки)=Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ЭлементНастройки.Параметр=ОтборПоСроку И НЕ ЭлементНастройки.Использование Тогда
				ПоказатьПредупреждение(Неопределено, НСтр("en='Please specify a deadline.';ru='Внимание! Требуется указывать крайний срок.'"), ,КП_ОбщееКлиент.ЗаголовокДиалога());
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.СкомпоноватьРезультат();
	
	ОбработкаЯчеекТабличногоДокумента();	
	
	Результат.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры

Процедура ОбработкаЯчеекТабличногоДокумента()
	
	Если ТекущийЯзыкСистемы()="en" Тогда
		Результат.Область("R2C3").Текст="Total"; //Всего
		Результат.Область("R2C4").Текст="In time"; //В срок
		Результат.Область("R2C5").Текст="Not in time"; //Не в срок
		Результат.Область("R2C6").Текст="Total"; //Всего 
		Результат.Область("R2C7").Текст="Overdue"; //Просрочено 
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеНастройкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ЭлементыНастройки=Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ОтборПоСроку=Новый ПараметрКомпоновкиДанных("КрайнийСрок");
	
	Для НомерЭлемента=0 По ЭлементыНастройки.Элементы.Количество()-1 Цикл
		ЭлементНастройки=ЭлементыНастройки.Элементы[НомерЭлемента];
		
		Если ТипЗнч(ЭлементНастройки)=Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ЭлементНастройки.Параметр=ОтборПоСроку И НЕ ЭлементНастройки.Использование Тогда
				ОтменаРедактирования=Истина;
				Отказ=Истина;
				ПоказатьПредупреждение(Неопределено, НСтр("en='System needs to specify a deadline.';ru='Внимание! Требуется указывать крайний срок.'"), ,КП_ОбщееКлиент.ЗаголовокДиалога());
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Проверяет, находится ли в ячейке отчета ссылка на задачу и в параметре
// ЗначениеРасшифровки возвращает значение расшифровки.
// Параметры:
//	Расшифровка - расшифровка отчета
//	ДанныеРасшифровкиОтчета - данные расшифровки отчета
//	ЗначениеРасшифровки - значение расшифровки
// Возвращаемое значение: Булево
&НаКлиенте
Функция ЭтоЗадачаИсполнителю(Знач Расшифровка, Знач ДанныеРасшифровкиОтчета, ЗначениеРасшифровки) Экспорт
	
	Возврат КП_ОбщееСерверПС.ЭтоЗадачаКорпоративногоПроцесса(ЗначениеРасшифровки);
	
КонецФункции
 
&НаКлиенте
Процедура ПоказатьСкрытьПанельНастроек(Команда)
	Элементы.ПоказатьСкрытьПанельНастроек.Пометка=НЕ Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	Элементы.ПользовательскиеНастройки.Видимость=Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	КП_ОбщееСервер.СохранитьНастройкуПользователя("КП_ЗадачиСотрудников", "ФлагПоказыватьПанельНастроек", Элементы.ПоказатьСкрытьПанельНастроек.Пометка);
	
КонецПроцедуры

#КонецОбласти
