
#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму текущих напоминаний пользователя.
//
Процедура ПроверитьТекущиеОбсуждения() Экспорт

	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	ИнтервалПроверкиНапоминаний = ПараметрыРаботыКлиента.НастройкиНапоминаний.ИнтервалПроверкиНапоминаний;
	
	ТаблицаОповещений = ОбсужденияУНФВызовСервера.ПолучитьОбсужденияТекущегоПользователя();
	ИнтервалСледующейПроверки = ИнтервалПроверкиНапоминаний * 60;
	
	Если ТаблицаОповещений.Количество() > 0 Тогда
		НапоминанияПользователяКлиент.ОткрытьФормуОповещения();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьТекущиеОбсуждения", ИнтервалСледующейПроверки, Истина);
	
КонецПроцедуры

#КонецОбласти