
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//заполним список макетов
	
	//сначала добавим элементы с пометкой
	СписокМакетов.Добавить("ВидПоручениеСотрудникам", "Поручение сотрудникам", Истина);
	СписокМакетов.Добавить("ВидСлужебнаяЗаписка", "Служебная записка", Истина);
	СписокМакетов.Добавить("ВидОзнакомлениеСДокументами", "Ознакомление с документами", Истина);
	СписокМакетов.Добавить("ВидСогласованиеДокументов", "Согласование документов", Истина);
	СписокМакетов.Добавить("ВидОплатаСчета", "Оплата счета", Истина);
	
	//добавим прочие элементы
	Для Каждого МакетПроцесса Из Метаданные.Справочники.КП_ВидыПроцессов.Макеты Цикл
		ИмяМакета=МакетПроцесса.Имя;
		НаименованиеМакета=МакетПроцесса.Синоним;
		
		Если ИмяМакета="СхемаНовый" 
			ИЛИ ИмяМакета="ВидТехПоддержка" 
			ИЛИ ИмяМакета="СхемаБиблиотекиЭлементов" 
			ИЛИ ИмяМакета="СКД_КритерииПравилаРабочегоПроцесса" 
		Тогда
			Продолжить;
			
		КонецЕсли;
		
		Если ИмяМакета="ВидПоручениеСотрудникам"
			ИЛИ ИмяМакета="ВидСогласованиеДокументов"
			ИЛИ ИмяМакета="ВидОзнакомлениеСДокументами"
			ИЛИ ИмяМакета="ВидСлужебнаяЗаписка"
			ИЛИ ИмяМакета="ВидОплатаСчета"
		Тогда
			Продолжить;
			
		Иначе
			Пометка=Ложь;
			
		КонецЕсли;
		
		СписокМакетов.Добавить(ИмяМакета, НаименованиеМакета, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыбранныеВидыПроцессов(Команда)
	
	СписокВыбранныхПроцессов=Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокМакетов Цикл
		Если НЕ ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеЭлемента=ЭлементСписка.Значение;
		
		Если СписокВыбранныхПроцессов.НайтиПоЗначению(ЗначениеЭлемента)=Неопределено Тогда
			СписокВыбранныхПроцессов.Добавить(ЗначениеЭлемента, ЭлементСписка.Представление, ЭлементСписка.Пометка);
		КонецЕсли;
				
	КонецЦикла;
	
	Закрыть(СписокВыбранныхПроцессов);
	
КонецПроцедуры
