#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КорпоративныйПроцесс=Параметры.Отбор.БизнесПроцесс;
	ТекущийПользователь=Пользователи.ТекущийПользователь();
	
	КП_ОформлениеСтрокСервер.УстановитьОформлениеСписка(Список, "Наименование");
	
	ОбновитьСписок();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СохранитьНастройкиСервером();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура БизнесПроцессПриИзменении(Элемент)
	
	//{Режим открытия окна
	#Если ВебКлиент Тогда
		ЭтоВебКлиент=Истина;
	#Иначе
		ЭтоВебКлиент=Ложь;
	#КонецЕсли
	//}
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	
	Список.Параметры.УстановитьЗначениеПараметра("БизнесПроцесс", КорпоративныйПроцесс);
	Список.Параметры.УстановитьЗначениеПараметра("СлужебнаяТочкаМаршрута", БизнесПроцессы.КП_БизнесПроцесс.ТочкиМаршрута.ВыполнениеКорпоративногоПроцесса);		
	Список.Параметры.УстановитьЗначениеПараметра("ПараметрЗадачиВыполнениеПроцент", ПланыВидовХарактеристик.КП_ПараметрыЗадач.ВыполнениеПроцент);
	Список.Параметры.УстановитьЗначениеПараметра("ПараметрЗадачиДатаНачалаВыполнения", ПланыВидовХарактеристик.КП_ПараметрыЗадач.ДатаНачалаВыполнения);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", ДобавитьМесяц(ТекущаяДата(), 1));
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="КП_КорпоративныйБизнесПроцесс" И (Параметр="Записан" ИЛИ Параметр="Запущен") Тогда
		КорпоративныйПроцесс=Источник;
		ОбновитьСписок();
		
	ИначеЕсли ИмяСобытия="КП_ИзменениеНастройкиЦвета" Тогда
		 ОбновитьОформлениеСписка();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСервером()
	
	//Пользователь=СокрЛП(ТекущийПользователь);

	//аДООбщееСервер.СохранитьНастройкуПользователя("ЗадачиПоПроцессу.ФормаСписка", "ГруппировкаСпискаПоСостояниямЗадачВключена", ГруппировкаСпискаПоСостояниямЗадачВключена, , Пользователь);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОформлениеСписка()
	КП_ОформлениеСтрокСервер.УстановитьОформлениеСписка(Список, "Наименование");
	ОбновитьСписок();
КонецПроцедуры

#КонецОбласти