////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы (УНФ)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Версия = "1.6.23.117";
	
	УправлениеНебольшойФирмойСервер.ПередДобавлениемПодсистемы(Описание);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей 
//                                  см. в процедуре ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.0.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//  Обработчик.Опциональный        = Истина;
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

#Область ПервыйЗапуск
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_РазделенныеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_ОбщиеДанные";
	Обработчик.ОбщиеДанные = Истина;
	
#КонецОбласти

#Область _1_6_21_ххх

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.63";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ВыполнитьЗаданиеПереносаДанныхВНовыйРегистр";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("36d02263-823f-4743-9e86-a8550d067f69");
	Обработчик.Комментарий = НСтр("ru = 'Выполнить задание по переносу штрихкодов'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.12";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьВариантПечатиДоставки";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("924cc268-d648-4ee2-914f-d329d36498ea");
	Обработчик.Комментарий = НСтр("ru = 'Установка варианта печати доставки по умолчанию'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.27";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьПредопределенныеВидыКонтактнойИнформацииПВЗ";
	Обработчик.Комментарий = НСтр("ru = 'Обновление предопределенных видов контактной информации ""Пункты выдачи заказа"".'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.87";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_1_6_21";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("de78ffc2-4ea4-471c-b29d-666cc175ca77");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.103";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьПризнакИспользованияМаркировкиШинПокрышек";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7d949f5e-728b-433b-b60d-077d32c59149");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить признак использования маркировки шин и покрышек.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.103";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьРеквизитВидПродукцииИС";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7d949f5e-728b-433b-b60d-077d32c59148");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить реквизит ""Вид продукции ИС"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.21.103";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОчиститьСсылкиНаСправочникУдалитьПапкиФайловПрисоединенныеУдалитьФайлы";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c3c146c9-f077-48ae-a178-bef57195e9b5");
	Обработчик.Комментарий = НСтр("ru = 'Очистить неиспользуемый справочник ""УдалитьПапкиФайловПрисоединенныеУдалитьФайлы"".'");
	
	Обработчик.Версия = "1.6.21.120";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьТарифДляПострадавших";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c9e47891-18fd-4ddc-a6f5-8c9cc96896a6");
	Обработчик.Комментарий = НСтр("ru = 'Обновить тариф страховых взносов'");
	
#КонецОбласти

#Область _1_6_22_ххх
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.22.21";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьКаталогТоваровВКонструктореМобильногоПриложения";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7d949f5e-728b-433b-b60d-077d32c59007");
	Обработчик.Комментарий = НСтр("ru = 'Обновление каталога товаров в конструкторе мобильного приложения'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.22.23";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ВыполнитьЗаполнениеРегистраДвиженияДенежныхСредств";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("36d02263-823f-1443-9e87-a8551d067f64");
	Обработчик.Комментарий = НСтр("ru = 'Выполнить заполнение регистра Движения денежных средств'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.22.28";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалитьСтарыеЗаписиОчередиЗадачАссистентаУправления";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("970acc99-3dfd-4e6d-a04f-cd8a5acc8183");
	Обработчик.Комментарий = НСтр("ru = 'Удаление старых записей очереди задач ассистента управления'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.22.28";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьСвойстваСлужебногоПользователяАссистентУправления";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e50fe560-0864-408a-bf76-718a522a2592");
	Обработчик.Комментарий = НСтр("ru = 'Обновление свойств служебного пользователя АссистентУправления'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.22.30";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьРасписаниеРегламентногоЗаданияОбработкаПравилРабочихПроцессов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("320bd292-a844-4146-8122-6e4e5f910064");
	Обработчик.Комментарий = НСтр("ru = 'Обновление расписания регламентного задания ОбработкаПравилРабочихПроцессов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.22.30";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьИмяДопРеквизитовПВХ";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e8eef913-d7dc-11ea-879d-708bcd551b2d");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение пустого реквизита Имя в ПВХ ДополнительныеРеквизитыИСведения'");
	
#КонецОбласти
	
#Область _1_6_23_ххх
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.27";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьЗначениеПризнакаИспользуется";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7b818934-a40d-4432-81f8-8d83fb91c78c");
	Обработчик.Комментарий = НСтр("ru = 'Установка использования дополнительного набора свойств для документа Передача товаров между организациями'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.27";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_1_6_23";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e2efebfe-451b-4176-a81d-bf5ed258fbf2");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.37";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОчисткаЗаказовПокупателейВПриходнойНакладной";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("331aa372-9476-410c-87b8-4db9a97d2312");
	Обработчик.Комментарий = НСтр("ru = 'Очистка заказа покупателя в строках приходной накладной для неподходящих операций.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.41";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановкаЗавершающихЭтаповДляПоэтапногоПроизводства";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d6b55220-64a1-4a90-94c0-519a80c17d0e");
	Обработчик.Комментарий = НСтр("ru = 'Установка завершающих этапов для поэтапного производства.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.53";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьЗаписиКалендаряСотрудника";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fb3295bb-4626-44d4-94f1-7d730d0b66f0");
	Обработчик.Комментарий = НСтр("ru = 'Обновление записей календаря сотрудника.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.108";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьКалендарьНа2021ГодИПредельнуюВеличинуБазыСтраховыхВзносов";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4c6698eb-cd12-40e6-b98b-b061e2ab1965");
	Обработчик.Комментарий = НСтр("ru = 'Обновить календарь на 2021 год'");
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.23.116";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьТарифыСтраховыхВзносов";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7b4ceb65-b35e-4242-bd9b-ded14de68bd0");
	Обработчик.Комментарий = НСтр("ru = 'Обновить тарифы страховых взносов'");
	Обработчик.ОбщиеДанные = Истина;
	
#КонецОбласти
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ИтерацииОбновления, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	
	
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПервыйЗапуск_ОбщиеДанные

// (5.Общий) Заполняем справочник ОКУН
Процедура ЗагрузитьОКУН()
	
	Справочники.ОКУН.ЗагрузитьКлассификатор();
	Справочники.ОКУН.ПроставитьВидДеятельностиОКУН();
	
КонецПроцедуры

// (6.Общий) Заполняет РС КоэффициентДефлятор
//
Процедура ЗаполнитьКоэффициентДефлятор()
	
	// переписываем сразу весь набор
	Набор = РегистрыСведений.КоэффициентДефлятор.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20030101';
	Запись.Значение = 1;
	
	Запись = Набор.Добавить();
	Запись.Период = '20040101';
	Запись.Значение = 1.133;
	
	Запись = Набор.Добавить();
	Запись.Период = '20050101';
	Запись.Значение = 1.104;
	
	Запись = Набор.Добавить();
	Запись.Период = '20060101';
	Запись.Значение = 1.132;
	
	Запись = Набор.Добавить();
	Запись.Период = '20070101';
	Запись.Значение = 1.096;
	
	Запись = Набор.Добавить();
	Запись.Период = '20080101';
	Запись.Значение = 1.081;
	
	Запись = Набор.Добавить();
	Запись.Период = '20090101';
	Запись.Значение = 1.148;
	
	Запись = Набор.Добавить();
	Запись.Период = '20100101';
	Запись.Значение = 1.295;
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.Значение = 1.372;
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.Значение = 1.4942;
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.Значение = 1.569;
	
	Запись = Набор.Добавить();
	Запись.Период = '20140101';
	Запись.Значение = 1.672;
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20180101';
	Запись.Значение = 1.868;
	
	Запись = Набор.Добавить();
	Запись.Период = '20190101';
	Запись.Значение = 1.915;
	
	Запись = Набор.Добавить();
	Запись.Период = '20200101';
	Запись.Значение = 2.005;
	
	Набор.Записать();
	
КонецПроцедуры

// (7.Общий) Заполнять РС МРОТ
//
Процедура ЗагрузитьМРОТ()
	
	Набор = РегистрыСведений.МРОТ.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20000701';
	Запись.Значение = 132;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20010101';
	Запись.Значение = 200;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20010701';
	Запись.Значение = 300;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20020501';
	Запись.Значение = 450;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20031001';
	Запись.Значение = 600;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20050101';
	Запись.Значение = 720;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20050901';
	Запись.Значение = 800;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20060501';
	Запись.Значение = 1100;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20070901';
	Запись.Значение = 2300;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20090101';
	Запись.Значение = 4330;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20110601';
	Запись.Значение = 4611;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20130101';
	Запись.Значение = 5205;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20140101';
	Запись.Значение = 5554;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20150101';
	Запись.Значение = 5965;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20160101';
	Запись.Значение = 6204;
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.Значение = 7500;
	
	Запись = Набор.Добавить();
	Запись.Период = '20180101';
	Запись.Значение = 7800;
	
	Запись = Набор.Добавить();
	Запись.Период = '20190101';
	Запись.Значение = 11280;
	
	Запись = Набор.Добавить();
	Запись.Период = '20200101';
	Запись.Значение = 12130;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПервыйЗапуск_РазделенныеДанные

// (1) Процедура загружает управленческий план счетов из макета.
//
Процедура ЗагрузитьУправленческийПланСчетовПервыйЗапуск()
	
	// 00.
	Счет = ПланыСчетов.Управленческий.Служебный.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 01.
	Счет = ПланыСчетов.Управленческий.ВнеоборотныеАктивы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ВнеоборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 02.
	Счет = ПланыСчетов.Управленческий.АмортизацияВнеоборотныхАктивов.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.АмортизацияВнеоборотныхАктивов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 08.
	Счет = ПланыСчетов.Управленческий.ВложенияВоВнеоборотныеАктивы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеВнеоборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 10.
	Счет = ПланыСчетов.Управленческий.СырьеИМатериалы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Запасы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 20.
	Счет = ПланыСчетов.Управленческий.НезавершенноеПроизводство.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство;
	Счет.СчетЗакрытия = ПланыСчетов.Управленческий.ТоварыПродукция;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 25.
	Счет = ПланыСчетов.Управленческий.КосвенныеЗатраты.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты;
	Счет.СчетЗакрытия = ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска;
	Счет.Записать();
	
	// 41.
	Счет = ПланыСчетов.Управленческий.ТоварыПродукция.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Запасы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 42.
	Счет = ПланыСчетов.Управленческий.ТорговаяНаценка.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ТорговаяНаценка;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 50.
	Счет = ПланыСчетов.Управленческий.Касса.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 51.
	Счет = ПланыСчетов.Управленческий.Банк.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 57.
	Счет = ПланыСчетов.Управленческий.ПереводыВПути.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 58.
	Счет = ПланыСчетов.Управленческий.ФинансовыеВложения.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 60.
	Счет = ПланыСчетов.Управленческий.РасчетыСПоставщикамиИПодрядчиками.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 60.01
		Счет = ПланыСчетов.Управленческий.РасчетыСПоставщиками.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПоставщикамиИПодрядчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 60.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПоставщикамиИПодрядчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
	// 62.
	Счет = ПланыСчетов.Управленческий.РасчетыСПокупателямиИЗаказчиками.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 62.01
		Счет = ПланыСчетов.Управленческий.РасчетыСПокупателями.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПокупателямиИЗаказчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 62.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПокупателямиИЗаказчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
	// 66.
	Счет = ПланыСчетов.Управленческий.РасчетыПоКраткосрочнымКредитамИЗаймам.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.КредитыИЗаймы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 67.
	Счет = ПланыСчетов.Управленческий.РасчетыПоДолгосрочнымКредитамИЗаймам.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДолгосрочныеОбязательства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 68.
	Счет = ПланыСчетов.Управленческий.РасчетыПоНалогам.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 68.01
		Счет = ПланыСчетов.Управленческий.Налоги.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыПоНалогам;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 68.02
		Счет = ПланыСчетов.Управленческий.НалогиКВозмещению.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыПоНалогам;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	
	// 70.
	Счет = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоОплатеТруда.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 71.
	Счет = ПланыСчетов.Управленческий.РасчетыСПодотчетнымиЛицами.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 71.01
		Счет = ПланыСчетов.Управленческий.РасчетыСПодотчетниками.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПодотчетнымиЛицами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 71.02
		Счет = ПланыСчетов.Управленческий.ПерерасходПодотчетников.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПодотчетнымиЛицами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
	// Прочие расчеты
	// 73
	Счет = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоПрочимОперациям.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 73.01
		Счет = ПланыСчетов.Управленческий.РасчетыПоПредоставленнымЗаймам.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоПрочимОперациям;
		Счет.ТипСчета = Перечисления.ТипыСчетов.КредитыИЗаймы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 73.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоВозмещениюМатериальногоУщерба.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоПрочимОперациям;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	
	// 75
	Счет = ПланыСчетов.Управленческий.РасчетыСУчредителями.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 75.01
		Счет = ПланыСчетов.Управленческий.РасчетыПоВкладамВУставныйКапитал.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСУчредителями;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 75.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоВыплатеДоходов.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСУчредителями;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	
	// 76
	Счет = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 76.01
		Счет = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторами.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 76.02
		Счет = ПланыСчетов.Управленческий.РасчетыСРазнымиКредиторами.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		//76.05
		Счет = ПланыСчетов.Управленческий.РасчетыСПрочимиПоставщикамиИТаможеннымиОрганами.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	// Конец Прочие расчеты
	
	// 80.
	Счет = ПланыСчетов.Управленческий.УставныйКапитал.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Капитал;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 82.
	Счет = ПланыСчетов.Управленческий.РезервныйИДобавочныйКапитал.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.РезервныйИДобавочныйКапитал;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 84.
	Счет = ПланыСчетов.Управленческий.НераспределеннаяПрибыль.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.НераспределеннаяПрибыль;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();

	// 90.
	Счет = ПланыСчетов.Управленческий.Продажи.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 90.01
		Счет = ПланыСчетов.Управленческий.ВыручкаОтПродаж.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Доходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 90.02
		Счет = ПланыСчетов.Управленческий.СебестоимостьПродаж.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.СебестоимостьПродаж;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 90.07
		Счет = ПланыСчетов.Управленческий.КоммерческиеРасходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Расходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
		// 90.08
		Счет = ПланыСчетов.Управленческий.УправленческиеРасходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Расходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
	// 91.
	Счет = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 91.01
		Счет = ПланыСчетов.Управленческий.ПрочиеДоходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеДоходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
		// 91.02
		Счет = ПланыСчетов.Управленческий.ПрочиеРасходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
		// 91.03
		Счет = ПланыСчетов.Управленческий.ПроцентыПоКредитам.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПроцентыПоКредитам;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
	// 94.
	Счет = ПланыСчетов.Управленческий.НедостачиИПотериОтПорчиЦенностей.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 97.
	Счет = ПланыСчетов.Управленческий.РасходыБудущихПериодов.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 99.
	Счет = ПланыСчетов.Управленческий.ПрибылиИУбытки.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 99.01
		Счет = ПланыСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрибылиИУбытки;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПрибылиУбытки;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 99.02
		Счет = ПланыСчетов.Управленческий.ПрибылиИУбытки_НалогНаПрибыль.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрибылиИУбытки;
		Счет.ТипСчета = Перечисления.ТипыСчетов.НалогНаПрибыль;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();		
		
КонецПроцедуры // ЗагрузитьУправленческийПланСчетовПервыйЗапуск()

// (3) Процедура заполняет в ИБ справочник "Виды налогов".
//
Процедура ЗаполнитьВидыНалоговПервыйЗапуск()
	
	// 1. НДС.
	ВидНалога = Справочники.ВидыНалогов.СоздатьЭлемент();
	ВидНалога.Наименование = "НДС";
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	// 2. Налог на прибыль.
	ВидНалога = Справочники.ВидыНалогов.СоздатьЭлемент();
	ВидНалога.Наименование = "Налог на прибыль";
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.АвансовыйПлатежПриУСН.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ЕдиныйНалогПриУСН.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ПФРНакопительная.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_НакопительнаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ПФРСтраховая.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ТФОМС.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ФФОМС.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ЕНВД.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.ЕНВД;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.НДФЛСотрудники.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.НДФЛ;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ФСССотрудники.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ФССТравматизмСотрудники.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ФОМССотрудники.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ПФРСвыше300тр.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.Патент.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ТорговыйСбор.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.ВидНалога = Перечисления.ВидыНалогов.ТорговыйСбор;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(ВидНалога.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		ВидНалога.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ВидНалога.Записать();
	
КонецПроцедуры // ЗаполнитьВидыНалоговПервыйЗапуск()

// (5) Функция заполняет в ИБ спрвочник "Ставки НДС" и возвращает
// ссылку на ставку НДС 18% для дальнейшего использования.
//
Функция ЗаполнитьСтавкиНДСПервыйЗапуск()
	
	// 10%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "10%";
	СтавкаНДС.Ставка = 10;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Пониженная;
	СтавкаНДС.Записать();
	
	// 18% / 118%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "18% / 118%";
	СтавкаНДС.Расчетная = Истина;
	СтавкаНДС.Ставка = 18;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	СтавкаНДС.Записать();
	
	// 10% / 110%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "10% / 110%";
	СтавкаНДС.Расчетная = Истина;
	СтавкаНДС.Ставка = 10;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная;
	СтавкаНДС.Записать();
	
	// 0%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "0%";
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Нулевая;
	СтавкаНДС.Записать();
	
	// Без НДС
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "Без НДС";
	СтавкаНДС.НеОблагается = Истина;
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС;
	СтавкаНДС.Записать();
	
	// 20% / 120%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "20% / 120%";
	СтавкаНДС.Расчетная = Истина;
	СтавкаНДС.Ставка = 20;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	СтавкаНДС.Записать();
	
	// 20%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "20%";
	СтавкаНДС.Ставка = 20;	
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	СтавкаНДС.Записать();
	
	// 18%
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "18%";
	СтавкаНДС.Ставка = 18;	
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	СтавкаНДС.Записать();
	
	Возврат СтавкаНДС.Ссылка;
	
КонецФункции // ЗаполнитьСтавкиНДСПервыйЗапуск()

// (7) Процедура создает график работы на основе производственного календаря 
// Российской Федерации по шаблону "Пятидневка"
//
Процедура СоздатьКалендарьПятидневкаРоссийскойФедерации()
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	Если ПроизводственныйКалендарь = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Справочники.Календари.НайтиПоРеквизиту("ПроизводственныйКалендарь", ПроизводственныйКалендарь).Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	НовыйГрафикРаботы = Справочники.Календари.СоздатьЭлемент();
	НовыйГрафикРаботы.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроизводственныйКалендарь, "Наименование");
	НовыйГрафикРаботы.ПроизводственныйКалендарь = ПроизводственныйКалендарь;
	НовыйГрафикРаботы.СпособЗаполнения = Перечисления.СпособыЗаполненияГрафикаРаботы.ПоНеделям;
	НовыйГрафикРаботы.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	НовыйГрафикРаботы.УчитыватьПраздники = Истина;
	
	// Заполняем недельный цикл как пятидневку
	Для НомерДня = 1 По 7 Цикл
		НовыйГрафикРаботы.ШаблонЗаполнения.Добавить().ДеньВключенВГрафик = НомерДня <= 5;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйГрафикРаботы, Истина, Истина);
	
КонецПроцедуры // СоздатьКалендарьПятидневкаРоссийскойФедерации()

// (15) Процедура заполняет справочники "Параметры расчетов" и "Виды начислений и удержаний".
//
Процедура ЗаполнитьПараметрыРасчетовИВидыНачислений()
	
	// Параметры расчетов.
	
	// Сумму продаж по ответственному (СПО)
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("СуммуПродажПоОтветственному") Тогда
		
		ПараметрРасчетовСПО = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		
		ПараметрРасчетовСПО.Наименование 		 = "Сумму продаж по ответственному";
		ПараметрРасчетовСПО.Идентификатор 	 = "СуммуПродажПоОтветственному"; 
		ПараметрРасчетовСПО.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовСПО.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаУчетаКурс";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаУчетаКурс";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаДокументаКратность";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаДокументаКратность";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаДокументаКурс";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаДокументаКурс";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаУчетаКратность";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаУчетаКратность";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "НачалоПериода";
		НовыйПараметрЗапроса.Представление 			 = "НачалоПериода";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "КонецПериода";
		НовыйПараметрЗапроса.Представление 			 = "КонецПериода";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Организация";
		НовыйПараметрЗапроса.Представление 			 = "Организация";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Подразделение";
		НовыйПараметрЗапроса.Представление 			 = "Подразделение";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Сотрудник";
		НовыйПараметрЗапроса.Представление 			 = "Сотрудник";
		
		ПараметрРасчетовСПО.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(Продажи.Сумма * &ВалютаУчетаКурс * &ВалютаДокументаКратность / (&ВалютаДокументаКурс * &ВалютаУчетаКратность), 0)) КАК СуммаПродаж
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Сумма >= 0
		|	И Продажи.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Продажи.Организация = &Организация
		|	И Продажи.Подразделение = &Подразделение
		|	И Продажи.Ответственный = &Сотрудник
		|	И (ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.АктВыполненныхРабот) ССЫЛКА Документ.АктВыполненныхРабот
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ЗаказПокупателя) ССЫЛКА Документ.ЗаказПокупателя
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ОтчетОПереработке) ССЫЛКА Документ.ОтчетОПереработке
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ОтчетОРозничныхПродажах) ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.РасходнаяНакладная) ССЫЛКА Документ.РасходнаяНакладная
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ЧекККМ) ССЫЛКА Документ.ЧекККМ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Продажи.Ответственный";
		
		ПараметрРасчетовСПО.Записать();
		
	КонецЕсли;
	
	// Фиксированная сумма
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ФиксированнаяСумма") Тогда
		
		ПараметрРасчетовФиксированнаяСумма = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовФиксированнаяСумма.Наименование 				= "Фиксированная сумма";
		ПараметрРасчетовФиксированнаяСумма.Идентификатор 	 			= "ФиксированнаяСумма";
		ПараметрРасчетовФиксированнаяСумма.ПроизвольныйЗапрос 			= Ложь;
		ПараметрРасчетовФиксированнаяСумма.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовФиксированнаяСумма.Записать();
		
	КонецЕсли;
	
	// Норма дней
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("НормаДней") Тогда
		
		ПараметрРасчетовНормаДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаДней.Наименование 		 = "Норма дней (производственный календарь)";
		ПараметрРасчетовНормаДней.Идентификатор 	 = "НормаДней";
		ПараметрРасчетовНормаДней.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаДней.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Организация";
		НовыйПараметрЗапроса.Представление 			 = "Организация";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		ПараметрРасчетовНормаДней.Запрос 			 = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК НормаДней
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КалендарныеГрафики.Календарь = Организации.ПроизводственныйКалендарь
		|			И (Организации.Ссылка = &Организация)
		|ГДЕ
		|	КалендарныеГрафики.Год = ГОД(&ПериодРегистрации)
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И КалендарныеГрафики.ДеньВключенВГрафик";
		
		ПараметрРасчетовНормаДней.Записать();
		
	КонецЕсли;
	
	// Норма часов
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("НормаЧасов") Тогда
		
		ПараметрРасчетовНормаЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаЧасов.Наименование 	  = "Норма часов (производственный календарь)";
		ПараметрРасчетовНормаЧасов.Идентификатор 	  = "НормаЧасов";
		ПараметрРасчетовНормаЧасов.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаЧасов.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Организация";
		НовыйПараметрЗапроса.Представление 			 = "Организация";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		ПараметрРасчетовНормаЧасов.Запрос 			 = 
		"ВЫБРАТЬ
		|	СУММА(8) КАК НормаЧасов
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КалендарныеГрафики.Календарь = Организации.ПроизводственныйКалендарь
		|			И (Организации.Ссылка = &Организация)
		|ГДЕ
		|	КалендарныеГрафики.Год = ГОД(&ПериодРегистрации)
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И КалендарныеГрафики.ДеньВключенВГрафик";
		ПараметрРасчетовНормаЧасов.Записать();
		
	КонецЕсли;
	
	// Норма дней по графику
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("НормаДнейГрафикСотрудника") Тогда
		
		ПараметрРасчетовНормаДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаДней.Наименование 		 = "Норма дней (график работы сотрудника)";
		ПараметрРасчетовНормаДней.Идентификатор 	 = "НормаДнейГрафикСотрудника";
		ПараметрРасчетовНормаДней.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаДней.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ГрафикРаботы";
		НовыйПараметрЗапроса.Представление 			 = "График работы";
		
		ПараметрРасчетовНормаДней.Запрос 			 = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДЕНЬ(ГрафикиРаботы.ВремяНачала)) КАК НормаДней
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботы.ВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикиРаботы.Год = ГОД(&ПериодРегистрации)";
		
		ПараметрРасчетовНормаДней.Записать();
		
	КонецЕсли;
	
	// Норма часов по графику
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("НормаЧасовГрафикСотрудника") Тогда
		
		ПараметрРасчетовНормаЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаЧасов.Наименование 	  = "Норма часов (график работы сотрудника)";
		ПараметрРасчетовНормаЧасов.Идентификатор 	  = "НормаЧасовГрафикСотрудника";
		ПараметрРасчетовНормаЧасов.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаЧасов.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ГрафикРаботы";
		НовыйПараметрЗапроса.Представление 			 = "График работы";
		
		ПараметрРасчетовНормаЧасов.Запрос 			 = 
		"ВЫБРАТЬ
		|	СУММА(ГрафикиРаботы.ЧасыРаботы) КАК НормаЧасов
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботы.ВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикиРаботы.Год = ГОД(&ПериодРегистрации)";
		ПараметрРасчетовНормаЧасов.Записать();
		
	КонецЕсли;
	
	// Отработано дней
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ОтработаноДней") Тогда
		
		ПараметрРасчетовОтработаноДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовОтработаноДней.Наименование 	  = "Отработано дней";
		ПараметрРасчетовОтработаноДней.Идентификатор	  = "ОтработаноДней";
		ПараметрРасчетовОтработаноДней.ПроизвольныйЗапрос = Ложь;
		ПараметрРасчетовОтработаноДней.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовОтработаноДней.Записать();
		
	КонецЕсли;
	
	// Отработано часов
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ОтработаноЧасов") Тогда
		
		ПараметрРасчетовОтработаноЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовОтработаноЧасов.Наименование 	   = "Отработано часов";
		ПараметрРасчетовОтработаноЧасов.Идентификатор 	   = "ОтработаноЧасов";
		ПараметрРасчетовОтработаноЧасов.ПроизвольныйЗапрос = Ложь;
		ПараметрРасчетовОтработаноЧасов.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовОтработаноЧасов.Записать();
		
	КонецЕсли;
	
	// Тарифная ставка
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ТарифнаяСтавка") Тогда
		
		ПараметрРасчетовТарифнаяСтавка = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовТарифнаяСтавка.Наименование 	  = "Тарифная ставка";
		ПараметрРасчетовТарифнаяСтавка.Идентификатор 	  = "ТарифнаяСтавка";
		ПараметрРасчетовТарифнаяСтавка.ПроизвольныйЗапрос = Ложь;
		ПараметрРасчетовТарифнаяСтавка.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовТарифнаяСтавка.Записать();
		
	КонецЕсли;
	
	// Отработано по заданиям
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ОтработаноЧасовПоЗаданиям") Тогда
		
		ПараметрРасчетовСдельнаяВыработка = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовСдельнаяВыработка.Наименование 	= "Отработано часов по заданиям";
		ПараметрРасчетовСдельнаяВыработка.Идентификатор = "ОтработаноЧасовПоЗаданиям";
		ПараметрРасчетовСдельнаяВыработка.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовСдельнаяВыработка.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "НачалоПериода"; 
		НовыйПараметрЗапроса.Представление = "Начало периода"; 
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "КонецПериода";
		НовыйПараметрЗапроса.Представление = "Конец периода";
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "Сотрудник";
		НовыйПараметрЗапроса.Представление = "Сотрудник";
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "Организация"; 
		НовыйПараметрЗапроса.Представление = "Организация"; 
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "Подразделение";
		НовыйПараметрЗапроса.Представление = "Подразделение";
		
		ПараметрРасчетовСдельнаяВыработка.Запрос =
		"ВЫБРАТЬ
		|	Источник.ЗагрузкаФактОборот
		|ИЗ
		|	РегистрНакопления.ЗаданияНаРаботу.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК Источник
		|ГДЕ
		|	Источник.Сотрудник = &Сотрудник
		|	И Источник.СтруктурнаяЕдиница = &Подразделение
		|	И Источник.Организация = &Организация";
		
		ПараметрРасчетовСдельнаяВыработка.Записать();
		
	КонецЕсли;
	
	// Виды начислений
	Если НЕ УправлениеНебольшойФирмойСервер.НачальноеЗаполнениеВидовНачисленийУдержанийПроизводилось() Тогда
		
		// Группы
		НовоеНачисление 			 = Справочники.ВидыНачисленийИУдержаний.СоздатьГруппу();
		НовоеНачисление.Наименование = "Начисления";
		НовоеНачисление.Записать(); 
		
		ГруппаНачисление 			 = НовоеНачисление.Ссылка;
		
		НовоеНачисление 			 = Справочники.ВидыНачисленийИУдержаний.СоздатьГруппу();
		НовоеНачисление.Наименование = "Удержания";
		НовоеНачисление.Записать();
		ГруппаУдержание 			 = НовоеНачисление.Ссылка;
		
		// Оклад по дням
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оклад по дням (производственный календарь)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДней]";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Оклад по часам
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оклад по часам (производственный календарь)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
		НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасов]";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Оклад по дням Графики
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оклад по дням (график работы сотрудника)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Оклад по часам Графики
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оклад по часам (график работы сотрудника)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
		НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Оплата по заданиям
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оплата по заданиям";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасовПоЗаданиям]";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Процент от продаж по ответственному
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Процент от продаж по ответственному";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "[СуммуПродажПоОтветственному]  / 100 *  [ТарифнаяСтавка]";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Оплата по сдельным нарядам
		НовоеНачислениеСсылка				= Справочники.ВидыНачисленийИУдержаний.СдельнаяОплата;
		НовоеНачисление						= НовоеНачислениеСсылка.ПолучитьОбъект();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Сдельная оплата (тариф)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "";
		НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2010;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ДоговорыГПХ;
		НовоеНачисление.Записать();
		
		// Сдельная оплата процентом
		НовоеНачислениеСсылка				= Справочники.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент;
		НовоеНачисление						= НовоеНачислениеСсылка.ПолучитьОбъект();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Сдельная оплата (% от суммы)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "";
		НовоеНачисление.КодДоходаНДФЛ = Справочники.КодыДоходовНДФЛ.Код2010;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ДоговорыГПХ;
		НовоеНачисление.Записать();
		
		// Фиксированная сумма
		НовоеНачислениеСсылка				= Справочники.ВидыНачисленийИУдержаний.ФиксированнаяСумма;
		НовоеНачисление						= НовоеНачислениеСсылка.ПолучитьОбъект();
		НовоеНачисление.Код					= "";
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Сдельная оплата (фиксированная сумма)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "[ФиксированнаяСумма]";
		НовоеНачисление.УстановитьНовыйКод();
		НовоеНачисление.КодДоходаНДФЛ = Справочники.КодыДоходовНДФЛ.Код2010;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ДоговорыГПХ;
		НовоеНачисление.Записать();
		
		// Отпускные
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Отпускные";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовоеНачисление.Формула				= "";
		НовоеНачисление.КодДоходаНДФЛ = Справочники.КодыДоходовНДФЛ.Код2012;
		НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
		НовоеНачисление.Записать();
		
		// Налог на доходы
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= ГруппаУдержание;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.НДФЛСотрудники;
		НовыйНалог.Записать();
		
		// ПФР по суммарному тарифу
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ПФРПоСуммарномуТарифу;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= ГруппаУдержание;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат	= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
		НовыйНалог.Записать();
		
		// ПФР накопительная
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ПФРНакопительная;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= ГруппаУдержание;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат	= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники;
		НовыйНалог.Записать();
		
		// ПФР страховая
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ПФРСтраховая;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= ГруппаУдержание;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат	= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
		НовыйНалог.Записать();
		
		// ФСС
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ФСС;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= ГруппаУдержание;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат	= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ФСССотрудники;
		НовыйНалог.Записать();
		
		// ФСС несчастные случаи
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ФССНесчастныеСлучаи;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= ГруппаУдержание;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат	= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ФССТравматизмСотрудники;
		НовыйНалог.Записать();
		
		// ФФОМС
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ФФОМС;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= ГруппаУдержание;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.СчетЗатрат	= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ФОМССотрудники;
		НовыйНалог.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПараметрыРасчетовИВидыНачислений()

// (24) Процедура заполняет в настройки подбора при первом запуске
//
Процедура ЗаполнитьПользовательскиеНастройкиПодбора()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	УправлениеНебольшойФирмойСервер.УстановитьСтандартныеНастройкиПодбора(ТекущийПользователь);
	
КонецПроцедуры // ЗаполнитьПользовательскиеНастройкиПодбора()

// (27) Процедура удаляет регистрацию изменений базовых классификаторов, которые должны выгружаться
// только при наличии на них ссылок в других выгружаемых объектах.
//
Процедура УдалитьРегистрациюИзмененийБазовыхКлассификаторов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия20.Ссылка КАК УзелОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия20 КАК ОбменУправлениеНебольшойФирмойБухгалтерия20
	|ГДЕ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия20.Ссылка <> &ЭтотУзелБП20
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия30.Ссылка КАК УзелОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия30 КАК ОбменУправлениеНебольшойФирмойБухгалтерия30
	|ГДЕ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия30.Ссылка <> &ЭтотУзелБП30";
	
	Запрос.УстановитьПараметр("ЭтотУзелБП20", ПланыОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия20.ЭтотУзел());
	Запрос.УстановитьПараметр("ЭтотУзелБП30", ПланыОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия30.ЭтотУзел());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	УзлыОбменаСБП20 = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("УзелОбмена");
	УзлыОбменаСБП30 = МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("УзелОбмена");
	
	Попытка
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП20, Метаданные.Справочники.Банки);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП20, Метаданные.Справочники.Валюты);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП20, Метаданные.Справочники.КлассификаторЕдиницИзмерения);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП20, Метаданные.Справочники.СтраныМира);
	Исключение
	КонецПопытки;
	
	Попытка
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП30, Метаданные.Справочники.Банки);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП30, Метаданные.Справочники.Валюты);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП30, Метаданные.Справочники.КлассификаторЕдиницИзмерения);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБП30, Метаданные.Справочники.СтраныМира);
	Исключение
	КонецПопытки;
	
КонецПроцедуры // УдалитьРегистрациюИзмененийБазовыхКлассификаторов()

// (29) Процедура заполняет бланки договоров из макета.
//
Процедура ЗаполнитьБланкиДоговоров()
	
	НачатьТранзакцию();
	Попытка
		МакетДоговорАренды 			= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорАренды");
		МакетДоговорКуплиПродажи 	= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорКуплиПродажи");
		МакетДоговорОказанияУслуг 	= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорОказанияУслуг");
		МакетДоговорПоставки 		= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорПоставки");
		
		Макеты = Новый Массив(4);
		Макеты[0] = МакетДоговорАренды;
		Макеты[1] = МакетДоговорКуплиПродажи;
		Макеты[2] = МакетДоговорОказанияУслуг;
		Макеты[3] = МакетДоговорПоставки;
		
		НаименованияМакетов = Новый Массив(4);
		НаименованияМакетов[0] = "МакетДоговорАренды";
		НаименованияМакетов[1] = "МакетДоговорКуплиПродажи";
		НаименованияМакетов[2] = "МакетДоговорОказанияУслуг";
		НаименованияМакетов[3] = "МакетДоговорПоставки";
		
		Бланки = Новый Массив(4);
		Бланки[0] = Справочники.БланкиДоговоров.ДоговорАренды.Ссылка.ПолучитьОбъект();
		Бланки[1] = Справочники.БланкиДоговоров.ДоговорКуплиПродажи.Ссылка.ПолучитьОбъект();
		Бланки[2] = Справочники.БланкиДоговоров.ДоговорОказанияУслуг.Ссылка.ПолучитьОбъект();
		Бланки[3] = Справочники.БланкиДоговоров.ДоговорПоставки.Ссылка.ПолучитьОбъект();
		
		Итератор = 0;
		Пока Итератор < Макеты.Количество() Цикл 
			
			МакетДоговора = Справочники.БланкиДоговоров.ПолучитьМакет(НаименованияМакетов[Итератор]);
			
			ТекстХТМЛ = МакетДоговора.ПолучитьТекст();
			Вложения = Новый Структура;
			
			КоличествоРедактируемыхПараметров = СтрЧислоВхождений(ТекстХТМЛ, "{ЗаполняемоеПоле");
			
			Бланки[Итератор].РедактируемыеПараметры.Очистить();
			НомерПараметра = 1;
			Пока НомерПараметра <= КоличествоРедактируемыхПараметров Цикл 
				НоваяСтрока = Бланки[Итератор].РедактируемыеПараметры.Добавить();
				НоваяСтрока.Представление = "{ЗаполняемоеПоле" + НомерПараметра + "}";
				НоваяСтрока.Идентификатор = "parameter" + НомерПараметра;
				
				НомерПараметра = НомерПараметра + 1;
			КонецЦикла;
			
			Падежи = Новый Массив;
			Падежи.Добавить(Неопределено);
			Падежи.Добавить("именительный");
			Падежи.Добавить("родительный");
			Падежи.Добавить("дательный");
			Падежи.Добавить("винительный");
			Падежи.Добавить("творительный");
			Падежи.Добавить("предложный");
			
			Для каждого ПараметрПеречисление Из Перечисления.ПараметрыБланковДоговоровСКонтрагентами Цикл
				
				Для каждого Падеж Из Падежи Цикл
					Если Падеж = Неопределено Тогда
						ПредставлениеПадежа = "";
					Иначе
						ПредставлениеПадежа = " (" + Падеж + ")";
					КонецЕсли;
					
					Параметр = "{" + Строка(ПараметрПеречисление) + ПредставлениеПадежа + "}";
					ЧислоВхождений = СтрЧислоВхождений(ТекстХТМЛ, Параметр);
					Для НомерПараметра = 1 По ЧислоВхождений Цикл
						Если НомерПараметра = 1 Тогда
							Представление = "{" + Строка(ПараметрПеречисление) + ПредставлениеПадежа + "%deleteSymbols%" + "}";
							Идентификатор = "infoParameter" + Строка(ПараметрПеречисление) + НомерПараметра;
						Иначе
							Представление = "{" + Строка(ПараметрПеречисление) + НомерПараметра + ПредставлениеПадежа + "}";
							Идентификатор = "infoParameter" + Строка(ПараметрПеречисление) + НомерПараметра;
						КонецЕсли;
						
						ПервоеВхождение = Найти(ТекстХТМЛ, Параметр);
						
						ТекстХТМЛ = Лев(ТекстХТМЛ, ПервоеВхождение - 1) + Представление + Сред(ТекстХТМЛ, ПервоеВхождение + СтрДлина(Параметр));
						
						НоваяСтрока = Бланки[Итератор].ПараметрыИнфобазы.Добавить();
						НоваяСтрока.Представление = СтрЗаменить(Представление, "%deleteSymbols%", "");
						НоваяСтрока.Идентификатор = Идентификатор;
						НоваяСтрока.Параметр = ПараметрПеречисление;
						
					КонецЦикла;
					ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%deleteSymbols%", "");
				КонецЦикла;
			КонецЦикла;
			
			СтруктураФорматированногоДокумента = Новый Структура;
			СтруктураФорматированногоДокумента.Вставить("ТекстHTML", ТекстХТМЛ);
			СтруктураФорматированногоДокумента.Вставить("Вложения", Вложения);
			
			Бланки[Итератор].Бланк = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента);
			Бланки[Итератор].МакетПредопределенногоБланка = НаименованияМакетов[Итератор];
			Бланки[Итератор].КоличествоРедактируемыхПараметров = КоличествоРедактируемыхПараметров;
			Бланки[Итератор].Записать();
			
			Итератор = Итератор + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение бланков договоров.'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

// (35) Заполняем регистр сведений ЗначенияКБК
Процедура ЗагрузитьЗначенияКБК()
	
	Набор = РегистрыСведений.ЗначенияКБК.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202110061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТФОМС;
	Запись.Значение = "39210202110091000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТФОМС;
	Запись.Значение = "39210202101081012160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202100081000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202101081011160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ЕНВД;
	Запись.Значение = "18210502010021000110";
	
	// 2012 год
	
	// начисление зп
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники;
	Запись.Значение = "39210202020061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "39210202010061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "39310202090071000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФССТравматизмСотрудники;
	Запись.Значение = "39310202050071000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛСотрудники;
	Запись.Значение = "18210102010011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "39210202101081011160";
	
	// 2013 год
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202150061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202140061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300тр;
	Запись.Значение = "39210202140061000160";
	
	
	
	// 2015 год
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТорговыйСбор;
	Запись.Значение = "18210505010020000110";
	
	// 2017 год
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "18210202140061100160";
	// Было 39210202140061100160
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300тр;
	Запись.Значение = "18210202140061200160";
	// Было 39210202140061200160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300тр;
	Запись.Значение = "18210202140061110160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "18210202140061110160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "18210202010061000160";
	// Было 39210202010061000160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "18210202010061010160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "18210202090071000160";
	// Было 39310202090071000160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "18210202090071010160";
	// Было 39310202090071000160
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "18210202101081011160";
	// Было 39210202101081011160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "18210202101081013160";
	// Было 39210202101081011160
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "18210202103081011160";
	// Было 39210202103081011160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "18210202103081013160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТорговыйСбор;
	Запись.Значение = "18210505010021000110";
	
	Набор.Записать();
	
КонецПроцедуры

// (39) Заполняет справочник КодыДоходовНДФЛ
//
Процедура ЗаполнитьКодыНДФЛ()
	
	Код2000 = Справочники.КодыДоходовНДФЛ.Код2000.ПолучитьОбъект();
	Код2000.СтавкаНДФЛ = 13;
	Код2000.Записать();
	
	Код2010 = Справочники.КодыДоходовНДФЛ.Код2010.ПолучитьОбъект();
	Код2010.СтавкаНДФЛ = 13;
	Код2010.Записать();
	
	Код2012 = Справочники.КодыДоходовНДФЛ.Код2012.ПолучитьОбъект();
	Код2012.СтавкаНДФЛ = 13;
	Код2012.Записать();
	
КонецПроцедуры

// (40) Процедура заполняет справочник ДокументыФизическихЛиц по классификатору МВД.
// Для тех конфигураций, в которых в справочнике "Виды документов физических лиц" нет реквизитов.
//
Процедура ЗаполнитьДокументыФизическихЛицПоКлассификаторуМВД(СтруктураПараметров = Неопределено)
	
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР,			"", 	"01", "ПАСПОРТ");						// R-ББ 999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР,		"", 	"02", "ЗГПАСПОРТ");						// 99 0999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении,	"", 	"03", "СВИД О РОЖД");					// R-ББ 999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера,	"", 	"04", "УДОСТ ОФИЦЕРА");					// ББ 9999990
	ОписатьДокумент(,"Справка об освобождении из места лишения свободы",					"05", "СПРАВКА ОБ ОСВ");				// -
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота, 	"",		"06", "ПАСПОРТ МОРФЛТ");				// ББ 999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет, "Военный билет солдата (матроса, сержанта, старшины)", "07", "ВОЕННЫЙ БИЛЕТ"); // ББ 0999999
	ОписатьДокумент(, "Временное удостоверение, выданное взамен военного билета",			"08", "ПРОЧЕЕ");						// -
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт, "",		"09", "ДИППАСПОРТ РФ"); 				// 99 9999999
	ОписатьДокумент(, "Паспорт иностранного гражданина",									"10", "ИНПАСПОРТ");						// -
	ОписатьДокумент(, "Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу", "11", "СВИД БЕЖЕНЦА"); // -
	ОписатьДокумент(, "Вид на жительство в Российской Федерации",							"12", "ВИД НА ЖИТЕЛЬ");					// -
	ОписатьДокумент(, "Удостоверение беженца",												"13", "УДОСТ БЕЖЕНЦА");					// -
	ОписатьДокумент(, "Временное удостоверение личности гражданина Российской Федерации",	"14", "ВРЕМ УДОСТ");					// -
	ОписатьДокумент(, "Разрешение на временное проживание в Российской Федерации",			"15", "ПРОЧЕЕ");						// -
	ОписатьДокумент(, "Свидетельство о предоставлении временного убежища на территории Российской Федерации", "18", "ПРОЧЕЕ");		// ББ-999 9999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ,				"",		"21", "ПАСПОРТ РОССИИ");				// 99 99 9999990
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ,		"",		"22", "ЗГПАСПОРТ РФ");					// 99 9999999
	ОписатьДокумент(, "Свидетельство о рождении, выданное уполномоченным органом иностранного государства", "23", "ПРОЧЕЕ");		// -
	ОписатьДокумент(, "Удостоверение личности военнослужащего Российской Федерации",		"24", "ПРОЧЕЕ");						// ББ 9999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка,			"",		"26", "ПАСПОРТ МОРЯКА");				// ББ 0999999
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса, "",	"27", "БИЛЕТ ОЗ");						// ББ 0999999
	ОписатьДокумент(, "Иные документы, выдаваемые ОВД",										"91", "ПРОЧЕЕ");						// -
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьДокумент(СсылкаНаЭлемент = Неопределено, Наименование = "", КодМВД = "", КодПФР = "")

	Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Если Наименование = "" Тогда
			Возврат
		КонецЕсли;
		СсылкаНаЭлемент = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(Наименование);
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "КодМВД, КодПФР");
		Если ДанныеИБ.КодМВД = КодМВД И ДанныеИБ.КодПФР = КодПФР Тогда
			Возврат
		КонецЕсли;
		Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВидыДокументовФизическихЛиц.СоздатьЭлемент();
	КонецЕсли;

	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	Элемент.КодМВД = КодМВД;
	Элемент.КодПФР = КодПФР;
	
	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.Записать();

КонецПроцедуры

// (43) Создание шаблонов условий печати в счетах на оплату
Процедура ЗаполнитьДополнительныеУсловияДляПечати()
	
	Справочники.ДополнительныеУсловия.ЗаполнениеТиповыхДополнительныхУсловий();
	
КонецПроцедуры

// (45) Идентификаторы формул и типы видов цен
Процедура ОбновитьПредопределенныеВидыЦен()
	
	// Наличие видов цен контрагентов в новой ИБ не предполагается, но такую возможность поддержим...
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ Справочник.ВидыЦен.Ссылка КАК ВидЦен, ИСТИНА КАК ЭтоЦеныНоменклатуры 
	|	ГДЕ Справочник.ВидыЦен.ИдентификаторФормул = """" ИЛИ Справочник.ВидыЦен.ТипВидаЦен = Значение(Перечисление.ТипыВидовЦен.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ Справочник.ВидыЦенКонтрагентов.Ссылка, ЛОЖЬ ГДЕ Справочник.ВидыЦенКонтрагентов.ИдентификаторФормул = """"");
	
	РезультатЗапроса = Запрос.Выполнить();
	Попытка
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ВидЦенОбъект = Выборка.ВидЦен.ПолучитьОбъект();
			
			ОписаниеВладельца = "";
			Если Выборка.ЭтоЦеныНоменклатуры Тогда
				
				ВидЦенОбъект.ТипВидаЦен = Перечисления.ТипыВидовЦен.Статический;
				
			Иначе
				
				ОписаниеВладельца = Строка(Выборка.ВидЦен.Владелец);
				
			КонецЕсли;
			
			ЦенообразованиеФормулыСервер.СформироватьНовыйИдентификаторВидаЦен(ВидЦенОбъект.ИдентификаторФормул, Выборка.ВидЦен.Наименование, ОписаниеВладельца);
			
			ВидЦенОбъект.Записать();
			
		КонецЦикла;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Идентификаторы.ВидыЦен", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

// (47) Устанавливает константу ФункциональнаяОпцияОпросНалоги
Процедура УстановитьКонстантуУчастияВОпросеПоНалогам()
	
	Константы.ФункциональнаяОпцияОпросНалоги.Установить(Истина);
	
КонецПроцедуры

// (49) Заполняет справочник ключевых операций, устанавливает целевое время
Процедура ЗаполнитьРеквизитыКлючевыхОпераций()
	
	Попытка
		ОценкаПроизводительностиПереопределяемый.ЗаполнитьЦелевоеВремяОперацийПроизводительности();
	Исключение
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение ключевых операций.'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

// (4) Возвращает объект по коду.
//    Если объект не найден в справочнике, создаёт новый объет и заполняет его из классификатора.
Функция СправочникОбъектВалютыПоКоду(Знач КодВалюты)
	
	ВалютаСсылка = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	Если ЗначениеЗаполнено(ВалютаСсылка) Тогда
		Возврат ВалютаСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Результат = Справочники.Валюты.СоздатьЭлемент();
	
	КлассификаторXML = Обработки.ЗагрузкаКурсовВалют.ПолучитьМакет("ОбщероссийскийКлассификаторВалют").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	ЗаписьОКВ = КлассификаторТаблица.Найти(КодВалюты, "Code"); 
	Если ЗаписьОКВ = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Код = ЗаписьОКВ.Code;
	Результат.Наименование = ЗаписьОКВ.CodeSymbol;
	Результат.НаименованиеПолное = ЗаписьОКВ.Name;
	Если ЗаписьОКВ.RBCLoading Тогда
		Результат.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета;
	Иначе
		Результат.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
	КонецЕсли;
	Результат.ПараметрыПрописи = ЗаписьОКВ.NumerationItemOptions;
	
	Возврат Результат;
	
КонецФункции

// (50) МобильноеПриложение
Процедура УстановитьКонстантуЭтоОбычноеПриложение()
	
	Если НЕ Константы.ЭтоМобильноеПриложение.Получить()
		И НЕ Константы.ЭтоМобильноеПриложение20.Получить() Тогда
		Константы.ЭтоОбычноеПриложение.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

// (51) Процедура заполняет справочники "Параметры расчетов доставки".
Процедура ЗаполнитьПараметрыРасчетовДоставки()
	
	// Параметры расчетов.
	
	// Цена
	Если НЕ ДоставкаСервер.ПараметрРасчетаСуществует("Цена") Тогда
		
		ПараметрРасчетов = Справочники.ПараметрыРасчетовДоставки.СоздатьЭлемент();
		
		ПараметрРасчетов.Наименование 	 = "Цена";
		ПараметрРасчетов.Идентификатор 	 = "Цена"; 
		ПараметрРасчетов.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетов.ЗадаватьЗначениеПриРасчете = Ложь;
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Заказ.ВидЦен";
		НовыйПараметрЗапроса.Представление 			 = "Вид цен";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Заказ.Дата";
		НовыйПараметрЗапроса.Представление 			 = "Дата заказа";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Заказ.НоменклатураДоставки";
		НовыйПараметрЗапроса.Представление 			 = "Услуга";
		
		ПараметрРасчетов.Запрос = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ЗаказДата,
		|			ВидЦен = &ЗаказВидЦен
		|				И Номенклатура = &ЗаказНоменклатураДоставки) КАК ЦеныНоменклатурыСрезПоследних";
		
		ПараметрРасчетов.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПараметрыРасчетовДоставки()

// (52) Процедура заполняет реквизиты собственной службы доставки.
//
Процедура ЗаполнитьРеквизитыСобственнойСлужбыДоставки()
	
	СсылкаНаОбъект = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СлужбыДоставки.ДоставкаСобственнымиСилами");
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Объект.ВариантУчета = Перечисления.ВариантыУчетаДоставки.ДоставкаСОплатой;
	Объект.ПараметрыРасчетов.Очистить();
	Объект.ЗначенияФормулы.Очистить();
	Объект.ДоступныеСпособыДоставки.Очистить();
	Объект.ДоступныеСпособыДоставки.Добавить().СпособДоставки = Перечисления.СпособыДоставки.Курьер;
	Объект.ДоступныеСпособыДоставки.Добавить().СпособДоставки = Перечисления.СпособыДоставки.Почта;
	Объект.ДоступныеСпособыОтгрузки.Очистить();
	Объект.ФормулаСтоимости = "0";
	Объект.ФормулаСебестоимости = "0";
	Объект.Записать();
	
КонецПроцедуры

// (55) Настройки представлений кодов в печатных формах
//
Процедура ЗаполнитьНастройкиПредставленийВПечатныхФормахПриНачалеРаботы()
	
	Если Константы.УдалитьАртикулНоменклатурыВСодержание.Получить() = Истина Тогда
		
		Константы.ПредставлениеКодовВПечатныхФормах.Установить(Перечисления.КодыНоменклатурыВДокументах.Артикул);
		
	Иначе
		
		Константы.ПредставлениеКодовВПечатныхФормах.Установить(Перечисления.КодыНоменклатурыВДокументах.Код);
		
	КонецЕсли;
	
	Константы.ПредставлениеСкидкиВПечатнойФорме.Установить(Перечисления.СпособОтображенияСкидок.Сумма);
	
	Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Установить(Истина);
	Константы.ПредставлениеНомераДокументаБезПрефиксаПользователя.Установить(Истина);
	Константы.ПредставлениеНомераДокументаБезПрефиксаОрганизации.Установить(Истина);
	Константы.ПредставлениеНомераДокументаСЛидирующимиНулями.Установить(Ложь);
	
КонецПроцедуры

// (58) Предзаполненное округление копеек в суммах документов
Процедура СоздатьПредзаполняемоеОкруглениеСуммДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АвтоматическиеСкидки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|ГДЕ
	|	АвтоматическиеСкидки.СпособПредоставления = Значение(Перечисление.СпособыПредоставленияСкидокНаценок.Округление)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 0 Тогда
	
		Округление = Справочники.АвтоматическиеСкидки.СоздатьЭлемент();
		Округление.Наименование = "Без копеек";
		Округление.Действует = Ложь;
		Округление.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Округление;
		Округление.Назначение = Перечисления.НазначенияАвтоматическихСкидок.Везде;
		Округление.ОбластьПредоставления = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе;
		Округление.ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
		Округление.ВалютаПредоставления = Константы.ВалютаУчета.Получить();
		Округление.ВариантОкругления = Перечисления.ВариантыОкругления.ПоАрифметическимПравилам;
		Округление.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
		
		Попытка
			Округление.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// (59) Установка значений по умолчанию для реквизитов расчетов в карточке котрагента.
Процедура УстановитьЗначенияПоУмолчаниюДляРеквизитовРасчетов()
	
	Константы.ВестиРасчетыПоДоговорам.Установить(Истина);
	Константы.ВестиРасчетыПоДокументам.Установить(Истина);
	Константы.ВестиРасчетыПоЗаказам.Установить(Истина);
	Константы.ВестиУчетОплатыПоСчетам.Установить(Истина);
	
КонецПроцедуры

// (60) Начало действия Постановления Правительства РФ № 981 (счет-фактура)
Процедура УстановитьДатуНачалаДействияПостановления981()
	
	Константы.НачалоИспользованияСФ981.Установить(Дата(2017, 10, 01));
	
КонецПроцедуры

// (63) Установить константу "ИспользоватьЧатВОбсуждениях"
//
Процедура УстановитьКонстантуИспользоватьЧатВОбсуждениях()
	
	Если НЕ Константы.ИспользоватьЧатВОбсуждениях.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Обсуждения.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.Обсуждения КАК Обсуждения
		|ГДЕ
		|	НЕ Обсуждения.Системный";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Константы.ИспользоватьЧатВОбсуждениях.Установить(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// (64) Установка варианта возврата по чеку из закрытой смены
Процедура УстановитьВариантВозвратаПоЗакрытойСмене()
	
	Если Константы.ВариантВозвратаПоЗакрытойСмене.Получить() = Перечисления.ВариантыВозвратаПоЗакрытойСмене.ПустаяСсылка() Тогда
		Константы.ВариантВозвратаПоЗакрытойСмене.Установить(Перечисления.ВариантыВозвратаПоЗакрытойСмене.ПН_Чек);
	КонецЕсли;
	
КонецПроцедуры

// (65) Установка значений констант начального заполнения оснований печати для заказа покупателя и счета на оплату
Процедура НачальноеЗаполнениеОснованийПечатиСчетовИЗаказов()
	
	Константы.ОснованиеПечатиЗаказПокупателя.Установить(Перечисления.ОснованиеПечатиСпособНачальногоЗаполнение.ДоговорКонтрагента);
	Константы.ОснованиеПечатиСчетНаОплату.Установить(Перечисления.ОснованиеПечатиСпособНачальногоЗаполнение.ДоговорКонтрагента);
	
КонецПроцедуры

// (67) Обработчик обновления графиков учета рабочего времени
Процедура ОбновитьГрафикиУчетаРабочегоВремени()
	
	ВыборкаГрафиков = Справочники.ГрафикиРаботы.Выбрать();
	Если ВыборкаГрафиков.Следующий() Тогда
		
		Справочники.ГрафикиРаботы.ОбновитьГрафикиУчетаРабочегоВремени();
		Справочники.ПараметрыРасчетов.ДополнитьПараметрыРасчета();
		Справочники.ВидыНачисленийИУдержаний.ДополнитьВидыНачислений();
		
	Иначе
		
		Справочники.ГрафикиРаботы.СозадьПредопреденныеШаблоныГрафиков();
		
	КонецЕсли;
	
КонецПроцедуры

// (34) Заполнение предопределенных элементов справочника статьи движения денежных средств
Процедура ВыполнитьПервоначальноеЗаполнениеСтатейДвиженияДенежныхСредств()
	
	ОплатаОтПокупателей = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей.ПолучитьОбъект();
	ОплатаОтПокупателей.УчитыватьВНУ = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОплатаОтПокупателей);
	
	ОплатаПоставщикам = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам.ПолучитьОбъект();
	ОплатаПоставщикам.УчитыватьВНУ = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОплатаПоставщикам);
	
	// Добавляем подсказку для групп верхнего уровня
	ОперационнаяДеятельность = Справочники.СтатьиДвиженияДенежныхСредств.ОперационнаяДеятельность.ПолучитьОбъект();
	ОперационнаяДеятельность.Описание = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьОписаниеПредопределеннойСтатьи(ОперационнаяДеятельность.Ссылка);
	ОперационнаяДеятельность.Порядок = 0;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОперационнаяДеятельность);
	
	ИнвестиционнаяДеятельность = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционнаяДеятельность.ПолучитьОбъект();
	ИнвестиционнаяДеятельность.Описание = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьОписаниеПредопределеннойСтатьи(ИнвестиционнаяДеятельность.Ссылка);
	ИнвестиционнаяДеятельность.Порядок = 1;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ИнвестиционнаяДеятельность);
	
	ФинансоваяДеятельность = Справочники.СтатьиДвиженияДенежныхСредств.ФинансоваяДеятельность.ПолучитьОбъект();
	ФинансоваяДеятельность.Описание = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьОписаниеПредопределеннойСтатьи(ФинансоваяДеятельность.Ссылка);
	ФинансоваяДеятельность.Порядок = 2;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФинансоваяДеятельность);
	
	ПеремещенияКурсовыеРазницы = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещенияКурсовыеРазницы.ПолучитьОбъект();
	ПеремещенияКурсовыеРазницы.Описание = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьОписаниеПредопределеннойСтатьи(ПеремещенияКурсовыеРазницы.Ссылка);
	ПеремещенияКурсовыеРазницы.Порядок = 3;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПеремещенияКурсовыеРазницы);
	
	// Поступления по инвестиционной деятельности
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПоступления;
	НовыйЭлемент.Наименование = НСтр("ru = 'Поступления от продажи оборудования, помещений'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПоступления;
	НовыйЭлемент.Наименование = НСтр("ru = 'Поступления от продажи других бизнесов'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	// Платежи по инвестиционной деятельности
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Покупка оборудования, помещений'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Покупка других бизнесов'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	// Поступления по финансовой деятельности
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ФинансовыеПоступления;
	НовыйЭлемент.Наименование = НСтр("ru = 'Получение кредитов и займов'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	// Платежи по финансовой деятельности
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ФинансовыеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Возврат кредита /займа'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ФинансовыеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Дивиденды'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	// Финансовая деятельность
	ЛичныеСредства = Справочники.СтатьиДвиженияДенежныхСредств.ЛичныеСредстваПредпринимателя.ПолучитьОбъект();
	ЛичныеСредства.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ФинансоваяДеятельность;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛичныеСредства);
	
	// Перемещения
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещенияКурсовыеРазницы;
	НовыйЭлемент.Наименование = НСтр("ru = 'Перемещение между кассами, счетами'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	// Операционные платежи
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Заработная плата'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Реклама и маркетинг'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Проценты по кредитам / займам'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Командировки'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Коммунальные платежи'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Банковское обслуживание'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Связь, интернет'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Транспортные расходы'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Аренда помещений'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Обслуживание офиса'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
	НовыйЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйЭлемент.Родитель = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи;
	НовыйЭлемент.Наименование = НСтр("ru = 'Налоги'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПервогоЗапуска

// Процедура заполняет пустую ИБ общими данными
//
// К данным относятся неразделенные сведения, например, глобальные настройки сервиса
//
Процедура ПервыйЗапуск_ОбщиеДанные() Экспорт
	
	НачатьТранзакцию();
	
	// 1. Заполним константу ИзвлекатьТекстыФайловНаСервере
	Константы.ИзвлекатьТекстыФайловНаСервере.Установить(Истина);
	Константы.ИспользоватьПроверкуКонтрагентов.Установить(Истина);
	
	// 2. Заполним календарь отчетности
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
	// 3. Загружаем  тарифы страховых взносов с предельными величинами
	Справочники.ВидыТарифовСтраховыхВзносов.ЗаполнитьСправочникВидыТарифовСтраховыхВзносов();
	Справочники.ВидыТарифовСтраховыхВзносов.ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012();
	РегистрыСведений.ТарифыСтраховыхВзносов.УстановитьЗначенияТарифовСтраховыхВзносов2011_2012();
	РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов();
	
	// 4. Заполняем виды предпринимательской деятельности
	Справочники.ВидыПредпринимательскойДеятельности.ЗаполнитьВидыПредпринимательскойДеятельности();
	
	// 5. Заполняем справочник ОКУН
	ЗагрузитьОКУН();
	
	// 6. Заполняем регистр сведений КоэффициентДефлятор
	ЗаполнитьКоэффициентДефлятор();
	
	// 7. Заполняем регистр сведений МРОТ
	ЗагрузитьМРОТ();
	
	// 8. Заполняем справочник Вычеты НДФЛ
	Справочники.ВычетыНДФЛ.НачальноеЗаполнение();
	
	// 9. Заполним регистр сведений НДФЛРазмерВычетов.
	Сотрудники.ЗаполнитьРазмерыВычетовНДФЛ();
	
	// 10. Отчетность
	Справочники.ОсобыеУсловияТрудаПФР.ЗаполнитьКоды();
	Справочники.ПараметрыИсчисляемогоСтраховогоСтажа.НачальноеЗаполнение();
	Справочники.ОснованияДосрочногоНазначенияПенсии.НачальноеЗаполнение();
	Справочники.ТерриториальныеУсловияПФР.НачальноеЗаполнение();
	РегистрыСведений.ФиксированныеВзносыИП.УстановитьФиксированныеВзносыИП();
	Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК.НачальноеЗаполнение();
	
	Справочники.ОснованияУвольнения.НачальноеЗаполнение();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура заполняет пустую ИБ данными пользователей
//
Процедура ПервыйЗапуск_РазделенныеДанные() Экспорт
	
	НачатьТранзакцию();
	
	// 1. Загрузим план счетов.
	ЗагрузитьУправленческийПланСчетовПервыйЗапуск();
	
	// 2. Заполним вид и направление деятельности.
	ПрочееНаправлениеДеятельностиСсылка = Справочники.НаправленияДеятельности.Прочее;
	ПрочееНаправлениеДеятельности = ПрочееНаправлениеДеятельностиСсылка.ПолучитьОбъект();
	ПрочееНаправлениеДеятельности.СчетУчетаВыручкиОтПродаж = ПланыСчетов.Управленческий.ПрочиеДоходы;
	ПрочееНаправлениеДеятельности.СчетУчетаСебестоимостиПродаж = ПланыСчетов.Управленческий.ПрочиеРасходы;
	ПрочееНаправлениеДеятельности.СчетУчетаПрибыли = ПланыСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль;
	ПрочееНаправлениеДеятельности.Записать();
	
	ОсновноеНаправлениеДеятельностиСсылка = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	ОсновноеНаправлениеДеятельности = ОсновноеНаправлениеДеятельностиСсылка.ПолучитьОбъект();
	ОсновноеНаправлениеДеятельности.СчетУчетаВыручкиОтПродаж = ПланыСчетов.Управленческий.ВыручкаОтПродаж;
	ОсновноеНаправлениеДеятельности.СчетУчетаСебестоимостиПродаж = ПланыСчетов.Управленческий.СебестоимостьПродаж;
	ОсновноеНаправлениеДеятельности.СчетУчетаПрибыли = ПланыСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль;
	ОсновноеНаправлениеДеятельности.Записать();
	
	// 3. Заполним виды налогов.
	ЗаполнитьВидыНалоговПервыйЗапуск();
	
	// 4. Заполним валюты.
	ВалютаОбъект = СправочникОбъектВалютыПоКоду("643");
	ВалютаОбъект.Наименование = НСтр("ru = 'руб.'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВалютаОбъект);
	РаботаСКурсамиВалют.ПроверитьКорректностьКурсаНа01_01_1980(ВалютаОбъект.Ссылка);
	
	// 5. Заполним ставки НДС.
	СтавкаНДС18 = ЗаполнитьСтавкиНДСПервыйЗапуск();
	
	// 6. Заполним кассы.
	КассаРублевая = Справочники.Кассы.СоздатьЭлемент();
	КассаРублевая.Наименование = НСтр("ru = 'Основная касса'");
	КассаРублевая.ВалютаПоУмолчанию = ВалютаОбъект.Ссылка;
	КассаРублевая.СчетУчета = ПланыСчетов.Управленческий.Касса;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КассаРублевая);
	
	// 7. Заполним Календарь на основании ПроизводственногоКалендаря.
	Календарь = УправлениеНебольшойФирмойСервер.ПолучитьКалендарьПоПроизводственномуКалендарюРФ(); 
	Если Календарь = Неопределено Тогда
		
		СоздатьКалендарьПятидневкаРоссийскойФедерации();
		Календарь = УправлениеНебольшойФирмойСервер.ПолучитьКалендарьПоПроизводственномуКалендарюРФ(); 
		
	КонецЕсли;
	
	// 8. Заполним организации.
	Константы.НеИспользоватьНесколькоОрганизаций.Установить(Истина);
	
	НашаОрганизацияСсылка = Справочники.Организации.ОсновнаяОрганизация;
	НашаОрганизация = НашаОрганизацияСсылка.ПолучитьОбъект();
	НашаОрганизация.НаименованиеПолное	  = НСтр("ru = 'ООО ""Наша фирма""'");
	НашаОрганизация.Префикс				  = НСтр("ru = 'НФ-'");
	НашаОрганизация.ЮридическоеФизическоеЛицо			  = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	НашаОрганизация.НДСВключатьВСтоимость = Истина;
	НашаОрганизация.КассаПоУмолчанию	  = КассаРублевая.Ссылка;
	НашаОрганизация.ВидСтавкиНДСПоУмолчанию  = Перечисления.ВидыСтавокНДС.Общая;
	НашаОрганизация.ПроизводственныйКалендарь = Календарь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НашаОрганизация);
	
	// 9. Заполним подразделения.
	ОсновноеПодразделениеСсылка = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	ОсновноеПодразделение = ОсновноеПодразделениеСсылка.ПолучитьОбъект();
	ОсновноеПодразделение.Организация = НашаОрганизация.Ссылка;
	ОсновноеПодразделение.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение;
	ОсновноеПодразделение.Записать();
	
	// 10. Заполним основной склад.
	ОсновнойСкладСсылка = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	ОсновнойСклад = ОсновнойСкладСсылка.ПолучитьОбъект();
	ОсновнойСклад.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад;
	ОсновнойСклад.Организация = НашаОрганизация.Ссылка;
	ОсновнойСклад.Записать();
	
	// 11. Заполним виды цен.
	// Оптовая.
	ОптоваяСсылка = Справочники.ВидыЦен.Оптовая;
	Оптовая = ОптоваяСсылка.ПолучитьОбъект();
	Оптовая.ИдентификаторФормул = Нстр("ru ='Оптовая'");
	Оптовая.ВалютаЦены = ВалютаОбъект.Ссылка;
	Оптовая.ЦеныАктуальны = Истина;
	Оптовая.ЦенаВключаетНДС = Истина;
	Оптовая.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
	Оптовая.ОкруглятьВБольшуюСторону = Ложь;
	Оптовая.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
	Оптовая.Записать();
	
	// Учетная.
	УчетнаяСсылка = Справочники.ВидыЦен.Учетная;
	Учетная = УчетнаяСсылка.ПолучитьОбъект();
	Учетная.ИдентификаторФормул = Нстр("ru ='Учетная'");
	Учетная.ВалютаЦены = ВалютаОбъект.Ссылка;
	Учетная.ЦеныАктуальны = Истина;
	Учетная.ЦенаВключаетНДС = Истина;
	Учетная.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
	Учетная.ОкруглятьВБольшуюСторону = Ложь;
	Учетная.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
	Учетная.Записать();
	
	// 12. Заполним константы.
	Константы.ВалютаУчета.Установить(ВалютаОбъект.Ссылка);
	Константы.НациональнаяВалюта.Установить(ВалютаОбъект.Ссылка);
	Константы.КонтролироватьОстаткиПриПроведении.Установить(Истина);
	Константы.ИспользоватьНапоминанияПользователя.Установить(Истина);
	
	Константы.ФункциональнаяОпцияКонтрольДоговоров.Установить(Перечисления.ВидыКонтроляДоговоровПриПроведении.НеПроводить);
	Константы.ЧастотаРасчетаКурсовыхРазниц.Установить(Перечисления.ЧастотаРасчетаКурсовыхРазниц.ТолькоПриЗакрытииПериода);
	Если Не РаботаВМоделиСервиса.РазделениеВключено() Тогда
		
		Префикс = "";
		ОбменДаннымиПереопределяемый.ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Префикс);
		Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Установить(Префикс);
		
	КонецЕсли;
	Константы.ИспользоватьШаблоныСообщений.Установить(Истина);
	
	// Взаиморасчеты
	Константы.СпособЗачетаПредоплатыПоУмолчанию.Установить(Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную);
	Константы.СпособРазнесенияОплатыПоУмолчанию.Установить(Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную);
	// Конец Взаиморасчеты
	
	// 13. Заполним сценарий планирования.
	Справочники.СценарииПланирования.ЗаполнитьФактическийСценарий();
	Справочники.СценарииПланирования.ЗаполнитьПоставляемыеСценарии();
	
	// 14. Заполним классификатор использования рабочего времени.
	Справочники.ВидыРабочегоВремени.ЗаполнитьКлассификаторИспользованияРабочегоВремени();
	
	// 15. Заполним параметры расчета и виды начислений.
	ЗаполнитьПараметрыРасчетовИВидыНачислений();
	
	// 16. Заполним наборы свойств.
	ОсновнаяКатегорияСсылка = Справочники.КатегорииНоменклатуры.БезКатегории;
	ОсновнаяКатегория = ОсновнаяКатегорияСсылка.ПолучитьОбъект();
	ОсновнаяКатегория.Заполнить(Неопределено);
	ОсновнаяКатегория.Записать();
	
	// 17. Заполним реквизиты предопределенных единиц измерения.
	
	// Штука.
	ШтСсылка = Справочники.КлассификаторЕдиницИзмерения.шт;
	ШтОбъект = ШтСсылка.ПолучитьОбъект();
	ШтОбъект.НаименованиеПолное = "Штука";
	ШтОбъект.МеждународноеСокращение = "PCE";
	ШтОбъект.Записать();
	
	// Час.
	чСсылка = Справочники.КлассификаторЕдиницИзмерения.ч;
	чОбъект = чСсылка.ПолучитьОбъект();
	чОбъект.НаименованиеПолное = "Час";
	чОбъект.МеждународноеСокращение = "HUR";
	чОбъект.Записать();
	
	// 18. Заполним состояния заказов
	Справочники.СостоянияЗаказовПокупателей.ЗаполнитьПоставляемыеСостояния();
	Справочники.ВидыЗаказовПокупателей.ЗаполнитьОсновнойВидЗаказа();
	Справочники.СостоянияЗаказНарядов.ЗаполнитьПоставляемыеСостояния();
	Справочники.ВидыЗаказНарядов.ЗаполнитьОсновнойВидЗаказа();
	Справочники.СостоянияЗаказовПоставщикам.ЗаполнитьПоставляемыеСостояния();
	Справочники.СостоянияЗаказовНаПроизводство.ЗаполнитьПоставляемыеСостояния();
	
	// 21. Установим дату изменения движений по ордерному складу.
	Константы.ДатаОбновленияНаРелиз_1_2_1.Установить("19800101");
	
	// 22. Установим признак контроля остатков при пробитии чеков ККМ.
	Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Установить(Истина);
	
	// 23. Настройки подбора
	ЗаполнитьПользовательскиеНастройкиПодбора();
	
	// 25. Контактная информация
	КонтактнаяИнформацияУНФ.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	
	// 26. Константы прайс-листа.
	Константы.ПрайсЛистВыводитьКод.Установить(Перечисления.ДаНет.Да);
	Константы.ПрайсЛистВыводитьПолноеНаименование.Установить(Перечисления.ДаНет.Нет);
	Константы.ПрайсЛистИспользоватьИерархиюНоменклатуры.Установить(Истина);
	Константы.ПрайсЛистФормироватьПоНаличиюНаСкладах.Установить(Ложь);
	
	// 28. Регистрация
	УдалитьРегистрациюИзмененийБазовыхКлассификаторов();
	
	// 29. Заполнение бланков договоров.
	ЗаполнитьБланкиДоговоров();
	
	// 30. Константа.НачалоИспользованияСФ1137
	Константы.НачалоИспользованияСФ1137.Установить(Дата(2012, 04, 01));
	
	// 31. Константа.ЗачитыватьАвансыДолгиАвтоматически
	Константы.ЗачитыватьАвансыДолгиАвтоматически.Установить(Перечисления.ДаНет.Нет);
	
	// 32. БПО
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновлениеБиблиотеки();
	
	// 33. Заполним состояния событий.
	СостояниеЗапланированоОбъект = Справочники.СостоянияСобытий.Запланировано.ПолучитьОбъект();
	СостояниеЗапланированоОбъект.РеквизитДопУпорядочивания = 1;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеЗапланированоОбъект);
	
	СостояниеЗавершеноОбъект = Справочники.СостоянияСобытий.Завершено.ПолучитьОбъект();
	СостояниеЗавершеноОбъект.РеквизитДопУпорядочивания = 2;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеЗавершеноОбъект);
	
	СостояниеОтмененоОбъект = Справочники.СостоянияСобытий.Отменено.ПолучитьОбъект();
	СостояниеОтмененоОбъект.РеквизитДопУпорядочивания = 3;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеОтмененоОбъект);
	
	// 34. Заполнение предопределенных элементов справочника статьи движения денежных средств
	ВыполнитьПервоначальноеЗаполнениеСтатейДвиженияДенежныхСредств();
	
	// 35. Заполняем регистр сведений ЗначенияКБК
	ЗагрузитьЗначенияКБК();
	
	// 36. Заполним сегменты контрагентов.
	Справочники.Сегменты.ЗаполнитьПоставляемыеСегменты();
	
	// 37. Заполним источники привлечения покупателей.
	Справочники.ИсточникиПривлеченияПокупателей.ЗаполнитьПоставляемыеИсточникиПривлеченияПокупателей();
	
	// 38. Заполним справочник ВидыДоходовПоСтраховымВзносам.
	Справочники.ВидыДоходовПоСтраховымВзносам.ЗаполнитьВидыДоходовПоСтраховымВзносам();
	
	// 39. Заполним справочник ВидыДоходовПоСтраховымВзносам.
	ЗаполнитьКодыНДФЛ();
	
	// 40. Заполним справочник ВидыДоходовПоСтраховымВзносам.
	ЗаполнитьДокументыФизическихЛицПоКлассификаторуМВД();
	
	// 41. Всегда ИспользоватьДополнительныеРеквизитыИСведения = Истина
	Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Истина);
	
	// 42. Настройка отбора номенклатуры.
	УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры, "ОсновнойВидОтбора");
	
	// 43. Создание шаблонов условий печати в счетах на оплату
	ЗаполнитьДополнительныеУсловияДляПечати();
	
	// 44. Создание шаблонов наименований для предопределенной категории.
	ШаблоныНаименований.СоздатьШаблоныПоУмолчанию(Справочники.КатегорииНоменклатуры.БезКатегории);
	
	// 45. Идентификаторы
	ОбновитьПредопределенныеВидыЦен();
	
	// 46. Обновление документов заработной платы
	ОтчетыУНФ.Обновить();
	ОтчетыУНФ.ОбновитьТегиОтчетов();
	
	// 47. Установка константы функциональной опции участия в опросе
	УстановитьКонстантуУчастияВОпросеПоНалогам();
	
	// 48. Заполним справочник ПравилаРабочегоПроцесса.
	Справочники.ПравилаРабочегоПроцесса.ЗаполнитьПоставляемыеПравила();
	
	// 49. Заполняет справочник ключевых операций, устанавливает целевое время
	ЗаполнитьРеквизитыКлючевыхОпераций();
	
	// МобильноеПриложение
	// 50. Установка ФО это обычное приложение.
	УстановитьКонстантуЭтоОбычноеПриложение();
	// Конец МобильноеПриложение
	
	// 51. Заполним параметры расчета доставки.
	ЗаполнитьПараметрыРасчетовДоставки();
	
	// 52. Заполним реквизиты собственной службы.
	ЗаполнитьРеквизитыСобственнойСлужбыДоставки();
	
	// 53. Шаблоны печати офисных документов.
	ШаблоныПечатиОфисныхДокументов.СоздатьПредопределенныеШаблоныКоммерческогоПредложения();
	ШаблоныПечатиОфисныхДокументов.СоздатьПредопределенныеШаблоныДоговоровКонтрагентов();
	
	// 54. Расчет стоимости операций сдельным нарядом с учетом нормы времени
	Константы.РасчетСтоимостиОперацийПоНормеВремени.Установить(Перечисления.ДаНет.Да);
	
	// 55. Настройка представлений кодов в печатных формах
	ЗаполнитьНастройкиПредставленийВПечатныхФормахПриНачалеРаботы();
	
	// 56. Настройка вида КИ для ПФ Товарный чек
	Константы.КонтактнаяИнформацияТоварногоЧека.Установить(Перечисления.КонтактнаяИнформацияТоварногоЧека.ОрганизацияИСтруктурнаяЕдиница);
	
	// 57. Коды товаров SKU 
	Константы.НижняяГраницаДиапазонаSKUВесовогоТовара.Установить(1);
	Константы.ВерхняяГраницаДиапазонаSKUВесовогоТовара.Установить(99999);
	
	// 58. Предзаполненное округление копеек в суммах документов
	СоздатьПредзаполняемоеОкруглениеСуммДокументов();
	
	// 59. Установка значений по умолчанию для реквизитов расчетов в карточке котрагента.
	УстановитьЗначенияПоУмолчаниюДляРеквизитовРасчетов();
	
	// 60. Начало действия Постановления Правительства РФ № 981 (счет-фактура)
	УстановитьДатуНачалаДействияПостановления981();
	
	// 61. Заполнение поставляемых состояний лидов.
	Справочники.СостоянияЛидов.ЗаполнитьПоставляемыеСостоянияЛидов();
	
	// 62. Заполнение поставляемых причин отказа лидов.
	Справочники.ПричиныНеуспешногоЗавершенияРаботыСЛидом.ЗаполнитьПоставляемыеПричиныНеуспешногоЗавершенияРаботыСЛидом();
	
	// 63. Установить константу "ИспользоватьЧатВОбсуждениях"
	УстановитьКонстантуИспользоватьЧатВОбсуждениях();
	
	// 64. Установка варианта возврата по чеку из закрытой смены
	УстановитьВариантВозвратаПоЗакрытойСмене();
	
	// 65. Установка значений констант начального заполнения оснований печати для заказа покупателя и счета на оплату
	НачальноеЗаполнениеОснованийПечатиСчетовИЗаказов();
	
	// 66. Установить значение константы использования ручного распределения материалов по умолчанию
	Константы.ИспользоватьРучноеРаспределениеМатериаловПоУмолчанию.Установить(Перечисления.ДаНет.Нет);
	
	// 67. Обработчик обновления графиков учета рабочего времени
	ОбновитьГрафикиУчетаРабочегоВремени();
	
	// 68. Заполнение констант ДатаНачалаРегистрацииРозничныхПродажВЕГАИС и ДатаНачалаРегистрацииРозничныхПродажВЕГАИСВСельскойМестности
	ИнтеграцияЕГАИСУНФ.УстановитьКонстантыЕГАИС();
	
	// 69. Поставляемые шаблоны сообщений.
	Документы.ЗаказПокупателя.СоздатьПоставляемыеШаблоныСообщений();
	
	// 70. Создание стартового набора показателей бизнеса
	Справочники.ПоказателиБизнеса.СформироватьПоказателиБизнесаДоходыРасходыПоШаблону();
	Справочники.ПоказателиБизнеса.СформироватьПоказателиБизнесаДенежныйПотокПоШаблону();
	Справочники.ПоказателиБизнеса.СформироватьПоказателиБизнесаБалансПоШаблону();
	
	// 71. Заполнение поставляемых соответствий реквизитов лида и контрагента
	РегистрыСведений.СоответствиеПолейЛидаИКонтрагента.ЗаполнитьПоставляемыеСоответствияРеквизитовЛидаИКонтрагента();
	
	// 72. Формирование печатных форм в пользовательских единицах измерения
	Константы.ПечатьПользовательскихЕдиницИзмерения.Установить(Перечисления.ПечатьПользовательскихЕдиницИзмерения.ПересчитыватьВБазовуюЕдиницуИзмеренияНоменклатуры);
	
	// 73. Создание стартового набора карточек анализа бизнеса
	Справочники.КарточкиАнализаБизнеса.СформироватьНаборПоставляемыхКарточек();
	
	// 74 Установка значения служебной константы для регистра ДвиженияДенежныхСредств
	Константы.РегистрДвиженияДенежныхСредствЗаполнен.Установить(Истина);
	
	// 75 Установка значения служебной константы для регистра ДвиженияДенежныхСредств
	Константы.МиграцияШтрихкодовВыполнена.Установить(Истина);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ПервыйЗапуск()

#КонецОбласти

#Область Обработчики_1_6_21

Процедура ЗаполнитьВариантПечатиДоставки(Параметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Константы.ВариантПечатиДоставки.Получить()) Тогда
		Возврат;
	КонецЕсли; 
	Константы.ВариантПечатиДоставки.Установить(Перечисления.ВариантыПечатиДоставки.ВыводитьВсегда);
	
КонецПроцедуры

Процедура ВыполнитьЗаданиеПереносаДанныхВНовыйРегистр(Параметры) Экспорт
	
	Если Константы.МиграцияШтрихкодовВыполнена.Получить() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ШтрихкодыНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	УдалитьШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	УдалитьШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	УдалитьШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	УдалитьШтрихкодыНоменклатуры.Партия КАК Партия,
		|	УдалитьШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.УдалитьШтрихкодыНоменклатуры КАК УдалитьШтрихкодыНоменклатуры
		|ГДЕ
		|	НЕ УдалитьШтрихкодыНоменклатуры.МиграцияВыполнена";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Не Выборка.Количество() Тогда
			Константы.МиграцияШтрихкодовВыполнена.Установить(Истина);
			Параметры.ОбработкаЗавершена = Истина;
		Иначе
			
			НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписейТекущий = РегистрыСведений.УдалитьШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей.Отбор.Штрихкод.Установить(Выборка.Штрихкод);
				
				НовСтр = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
				
				НаборЗаписей.Очистить();
				
				НаборЗаписейТекущий.Отбор.Штрихкод.Установить(Выборка.Штрихкод);
				
				НаборЗаписейТекущий.Прочитать();
				
				Для Каждого СтрокаНабора Из НаборЗаписейТекущий Цикл
					СтрокаНабора.МиграцияВыполнена = Истина;
				КонецЦикла;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейТекущий);
				
				НаборЗаписейТекущий.Очистить();
				
			КонецЦикла;
			
			Параметры.ОбработкаЗавершена = Ложь;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииПВЗ() Экспорт
	
	СправочникПунктыВыдачиЗаказаСсылка = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.ВидыКонтактнойИнформации.СправочникПунктыВыдачиЗаказа");
	
	Если СправочникПунктыВыдачиЗаказаСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СправочникПунктыВыдачиЗаказа = СправочникПунктыВыдачиЗаказаСсылка.ПолучитьОбъект();
	СправочникПунктыВыдачиЗаказа.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникПунктыВыдачиЗаказа);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресПунктаВыдачиЗаказа;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	ПараметрыВида.ВидРедактирования						= "Диалог";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Истина;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	КонтактнаяИнформацияУНФ.УстановитьФлагВыводитьВФормеВсегда(ПараметрыВида.Вид);
	
КонецПроцедуры

Процедура ОбновитьОтчеты_1_6_21(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ЗакрытиеМесяцаАнализОтрицательныхОстатков);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ЗакрытиеМесяца);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.РасшифровкаАнализаЗакрытияМесяца);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.Взаиморасчеты);
	// Контекстное открытие из обработки закрытия месяца
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.АнализБизнеса);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.Баланс);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ВнеоборотныеАктивы);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ДоходыИРасходы);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ОборотноСальдоваяВедомость);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ПрибылиИУбытки);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ФинансовыйРезультат);
	
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакИспользованияМаркировкиШинПокрышек() Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Если Константы.ВестиУчетШинИПокрышек.Получить() Тогда
			
			Константы.ВестиУчетМаркируемойПродукцииИСМП.Установить(Истина);
			
			НаборЗаписей = РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПродукции.Установить(Перечисления.ВидыПродукцииИС.Шины);
			Запись = НаборЗаписей.Добавить();
			Запись.ВидПродукции = Перечисления.ВидыПродукцииИС.Шины;
			Запись.ВестиУчетПродукции = Истина;
			Запись.ДатаОбязательнойМаркировки = Дата(2020,11,01);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Заполнить признак использования маркировки шин и покрышек'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитВидПродукцииИС(Параметры) Экспорт
	
	Если Константы.ЗаполнениеРеквизитаВидПродукцииИСВыполнено.Получить() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Номенклатура");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Номенклатура.ТабачнаяПродукция КАК ТабачнаяПродукция,
		|	Номенклатура.ОбувнаяПродукция КАК ОбувнаяПродукция,
		|	Номенклатура.ШиныИПокрышки КАК ШиныИПокрышки,
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(Номенклатура.ТабачнаяПродукция
		|			ИЛИ Номенклатура.ОбувнаяПродукция
		|			ИЛИ Номенклатура.ШиныИПокрышки)
		|	И Номенклатура.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Константы.ЗаполнениеРеквизитаВидПродукцииИСВыполнено.Установить(Истина);
			Параметры.ОбработкаЗавершена = Истина;
		Иначе
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если Выборка.ТабачнаяПродукция Тогда
					СправочникОбъект.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Табак;
				ИначеЕсли Выборка.ОбувнаяПродукция Тогда
					СправочникОбъект.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Обувь;
				ИначеЕсли Выборка.ШиныИПокрышки Тогда
					СправочникОбъект.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Шины;
					// отключаем механизм маркировки шин и покрышек в УНФ
					СправочникОбъект.ШиныИПокрышки = Ложь;
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
				
			КонецЦикла;
			
			Параметры.ОбработкаЗавершена = Ложь;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Заполнить реквизит ""ВидПродукцииИС""'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОчиститьСсылкиНаСправочникУдалитьПапкиФайловПрисоединенныеУдалитьФайлы(Параметры) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.УдалитьПапкиФайловПрисоединенныеУдалитьФайлы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДвоичныеДанныеФайлов.Файл КАК Файл,
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
		|ИЗ
		|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|ГДЕ
		|	ДвоичныеДанныеФайлов.Файл ССЫЛКА Справочник.УдалитьПапкиФайловПрисоединенныеУдалитьФайлы");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Константы.ЗаполнениеРеквизитаВидПродукцииИСВыполнено.Установить(Истина);
			Параметры.ОбработкаЗавершена = Истина;
		Иначе
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Файл.Установить(Выборка.Файл);
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
				
			КонецЦикла;
			
			Параметры.ОбработкаЗавершена = Ложь;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр(
			"ru = 'Очистить ссылки на неиспользуемый справочник ""УдалитьПапкиФайловПрисоединенныеУдалитьФайлы""'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьТарифДляПострадавших() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	Справочники.ВидыТарифовСтраховыхВзносов.ОбновитьТарифДляОтраслейПострадавшихОтКоронавируснойИнфекции();
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_1_6_22

Процедура ОбновитьКаталогТоваровВКонструктореМобильногоПриложения() Экспорт
	
	НастройкиПубликацииМЛКСсылка = Справочники.НастройкиПубликацииМЛК.ПолучитьНастройкиПубликацииМЛК();
	
	Если НастройкиПубликацииМЛКСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиПубликацииМЛК");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		НастройкиПубликацииМЛКОбъект = НастройкиПубликацииМЛКСсылка.ПолучитьОбъект();
		
		КаталогТоваров = НастройкиПубликацииМЛКОбъект.КаталогТоваров.Получить();
		
		Если ТипЗнч(КаталогТоваров) <> Тип("ТаблицаЗначений") Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Если КаталогТоваров.Колонки.Найти("ПорядковыйНомер") <> Неопределено Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		ТаблицаЗначений.Колонки.Добавить("Идентификатор");
		ТаблицаЗначений.Колонки.Добавить("РодительИдентификатор");
		ТаблицаЗначений.Колонки.Добавить("ГруппаКаталога");
		ТаблицаЗначений.Колонки.Добавить("Номенклатура");
		ТаблицаЗначений.Колонки.Добавить("ЭтоГруппа");
		ТаблицаЗначений.Колонки.Добавить("РодительКатегория");
		ТаблицаЗначений.Колонки.Добавить("РодительГруппа");
		ТаблицаЗначений.Колонки.Добавить("ПорядковыйНомер");
		
		ОтборПоГруппам = НастройкиПубликацииМЛКОбъект.ОтборГруппыКатегорииНоменклатуры = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры;
		МассивСГруппами = Новый Массив;
		
		НеобходимоСоздатьДополнительнуюГруппу = Ложь;
		УИНовойГруппыВСтроку = Строка(Новый УникальныйИдентификатор());
		
		Счетчик = 1;
		Для каждого Строка Из КаталогТоваров Цикл
			
			Если Строка.Номенклатура = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			НоваяСтрока.Идентификатор = Строка(Строка.Номенклатура.УникальныйИдентификатор());
			НоваяСтрока.ГруппаКаталога = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "Наименование");
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.ЭтоГруппа = Ложь;
			НоваяСтрока.ПорядковыйНомер = Счетчик;
			
			Счетчик = Счетчик + 1;
			
			Если ОтборПоГруппам Тогда
				Если ЗначениеЗаполнено(Строка.Номенклатура.Родитель) И МассивСГруппами.Найти(Строка.Номенклатура.Родитель) = Неопределено Тогда
					МассивСГруппами.Добавить(Строка.Номенклатура.Родитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка.Номенклатура.Родитель) Тогда
					НоваяСтрока.РодительИдентификатор = Строка(Строка.Номенклатура.Родитель.УникальныйИдентификатор());
					НоваяСтрока.РодительГруппа = Строка.Номенклатура.Родитель;
				Иначе
					НоваяСтрока.РодительИдентификатор = УИНовойГруппыВСтроку;
					НеобходимоСоздатьДополнительнуюГруппу = Истина;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(Строка.Номенклатура.КатегорияНоменклатуры) И МассивСГруппами.Найти(Строка.Номенклатура.КатегорияНоменклатуры) = Неопределено Тогда
					МассивСГруппами.Добавить(Строка.Номенклатура.КатегорияНоменклатуры);
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка.Номенклатура.КатегорияНоменклатуры) Тогда
					НоваяСтрока.РодительИдентификатор = Строка(Строка.Номенклатура.КатегорияНоменклатуры.УникальныйИдентификатор());
					НоваяСтрока.РодительКатегория = Строка.Номенклатура.КатегорияНоменклатуры;
				Иначе
					НоваяСтрока.РодительИдентификатор = УИНовойГруппыВСтроку;
					НеобходимоСоздатьДополнительнуюГруппу = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Счетчик = 1;
		Если ОтборПоГруппам Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура.Ссылка КАК Ссылка,
			|	Номенклатура.Наименование КАК Наименование,
			|	Номенклатура.Родитель КАК Родитель
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.ЭтоГруппа
			|	И Номенклатура.Ссылка В(&МассивСГруппами)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура.Наименование
			|ИТОГИ ПО
			|	Ссылка ИЕРАРХИЯ";
			
			Запрос.УстановитьПараметр("МассивСГруппами", МассивСГруппами);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			КоллекцияСтрок = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам).Строки;
			
			Для каждого Строка Из КоллекцияСтрок Цикл
				
				НоваяСтрока = ТаблицаЗначений.Добавить();
				
				НоваяСтрока.Идентификатор = Строка(Строка.Ссылка.УникальныйИдентификатор());
				НоваяСтрока.ГруппаКаталога = Строка.Наименование;
				НоваяСтрока.Номенклатура = Строка.Ссылка;
				НоваяСтрока.ЭтоГруппа = Истина;
				НоваяСтрока.ПорядковыйНомер = Счетчик;
				
				Счетчик = Счетчик + 1;
				
				Если ЗначениеЗаполнено(Строка.Ссылка.Родитель) Тогда
					НоваяСтрока.РодительИдентификатор = Строка(Строка.Ссылка.Родитель.УникальныйИдентификатор());
					НоваяСтрока.РодительГруппа = Строка.Ссылка.Родитель;
				Иначе
					НоваяСтрока.РодительИдентификатор = "";
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КатегорииНоменклатуры.Ссылка КАК Ссылка,
			|	КатегорииНоменклатуры.Наименование КАК Наименование,
			|	КатегорииНоменклатуры.Родитель КАК Родитель
			|ИЗ
			|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
			|ГДЕ
			|	КатегорииНоменклатуры.Ссылка В(&МассивСГруппами)
			|
			|УПОРЯДОЧИТЬ ПО
			|	КатегорииНоменклатуры.Наименование
			|ИТОГИ ПО
			|	Ссылка ИЕРАРХИЯ";
			
			Запрос.УстановитьПараметр("МассивСГруппами", МассивСГруппами);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			КоллекцияСтрок = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам).Строки;
			
			Для каждого Строка Из КоллекцияСтрок Цикл
				
				НоваяСтрока = ТаблицаЗначений.Добавить();
				
				НоваяСтрока.Идентификатор = Строка(Строка.Ссылка.УникальныйИдентификатор());
				НоваяСтрока.ГруппаКаталога = Строка.Наименование;
				НоваяСтрока.Номенклатура = Строка.Ссылка;
				НоваяСтрока.ЭтоГруппа = Истина;
				НоваяСтрока.ПорядковыйНомер = Счетчик;
				
				Счетчик = Счетчик + 1;
				
				Если ЗначениеЗаполнено(Строка.Ссылка.Родитель) Тогда
					НоваяСтрока.РодительИдентификатор = Строка(Строка.Ссылка.Родитель.УникальныйИдентификатор());
					НоваяСтрока.РодительКатегория = Строка.Ссылка.Родитель;
				Иначе
					НоваяСтрока.РодительИдентификатор = "";
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НеобходимоСоздатьДополнительнуюГруппу Тогда
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			НоваяСтрока.Идентификатор = УИНовойГруппыВСтроку;
			НоваяСтрока.ГруппаКаталога = "Товары без категории";
			НоваяСтрока.ЭтоГруппа = Истина;
			НоваяСтрока.ПорядковыйНомер = Счетчик;
			НоваяСтрока.РодительИдентификатор = "";
			
		КонецЕсли;
		
		НастройкиПубликацииМЛКОбъект.КаталогТоваров = Новый ХранилищеЗначения(ТаблицаЗначений, Новый СжатиеДанных(9));
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НастройкиПубликацииМЛКОбъект);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Обновить каталог товаров в конструкторе мобильного приложения'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьЗаполнениеРегистраДвиженияДенежныхСредств(Параметры) Экспорт
	
	Если Константы.РегистрДвиженияДенежныхСредствЗаполнен.Получить() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПереносИзДенежныеСредстваЗавершен = Ложь;
	ПереносИзДенежныеСредстваПрогнозЗавершен = Ложь;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДвиженияДенежныхСредств");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		// Запрос по регистру ДенежныеСредства
		ЗапросДенежныеСредства = Новый Запрос;
		ЗапросДенежныеСредства.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	ДенежныеСредства.Период КАК Период,
		|	ДенежныеСредства.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ТаблицаРегистраторов
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияДенежныхСредств КАК ДвиженияДенежныхСредств
		|		ПО ДенежныеСредства.Регистратор = ДвиженияДенежныхСредств.Регистратор
		|ГДЕ
		|	НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ЗакрытиеМесяца
		|	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|	И ДвиженияДенежныхСредств.Регистратор ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДенежныеСредства.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДенежныеСредства.Период КАК Период,
		|	ТаблицаРегистраторов.Регистратор КАК Регистратор,
		|	ДенежныеСредства.НомерСтроки КАК НомерСтроки,
		|	ДенежныеСредства.ВидДвижения КАК ВидДвижения,
		|	ДенежныеСредства.Организация КАК Организация,
		|	ДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ДенежныеСредства.Валюта КАК Валюта,
		|	ДенежныеСредства.Сумма КАК Сумма,
		|	ДенежныеСредства.СуммаВал КАК СуммаВал,
		|	ДенежныеСредства.Статья КАК Статья,
		|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДенежныеСредства.Аналитика КАК Аналитика
		|ИЗ
		|	ТаблицаРегистраторов КАК ТаблицаРегистраторов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|		ПО ТаблицаРегистраторов.Регистратор = ДенежныеСредства.Регистратор
		|ИТОГИ ПО
		|	Регистратор";
		
		РезультатЗапросаДенежныеСредства = ЗапросДенежныеСредства.Выполнить();
		
		Если РезультатЗапросаДенежныеСредства.Пустой() Тогда
			ПереносИзДенежныеСредстваЗавершен = Истина;
		КонецЕсли;
		
		// Запрос по регистру ДенежныеСредстваПрогноз
		ЗапросДенежныеСредстваПрогноз = Новый Запрос;
		ЗапросДенежныеСредстваПрогноз.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	УдалитьДенежныеСредстваПрогноз.Период КАК Период,
		|	УдалитьДенежныеСредстваПрогноз.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ТаблицаРегистраторов
		|ИЗ
		|	РегистрНакопления.УдалитьДенежныеСредстваПрогноз КАК УдалитьДенежныеСредстваПрогноз
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияДенежныхСредств КАК ДвиженияДенежныхСредств
		|		ПО УдалитьДенежныеСредстваПрогноз.Регистратор = ДвиженияДенежныхСредств.Регистратор
		|ГДЕ
		|	НЕ УдалитьДенежныеСредстваПрогноз.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|	И ДвиженияДенежныхСредств.Регистратор ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	УдалитьДенежныеСредстваПрогноз.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдалитьДенежныеСредстваПрогноз.Период КАК Период,
		|	УдалитьДенежныеСредстваПрогноз.Регистратор КАК Регистратор,
		|	УдалитьДенежныеСредстваПрогноз.НомерСтроки КАК НомерСтроки,
		|	УдалитьДенежныеСредстваПрогноз.Организация КАК Организация,
		|	УдалитьДенежныеСредстваПрогноз.СценарийПланирования КАК СценарийПланирования,
		|	УдалитьДенежныеСредстваПрогноз.СчетУчета КАК СчетУчета,
		|	УдалитьДенежныеСредстваПрогноз.Валюта КАК Валюта,
		|	УдалитьДенежныеСредстваПрогноз.Статья КАК Статья,
		|	УдалитьДенежныеСредстваПрогноз.СуммаПриход КАК СуммаПриход,
		|	УдалитьДенежныеСредстваПрогноз.СуммаПриходВал КАК СуммаПриходВал,
		|	УдалитьДенежныеСредстваПрогноз.СуммаРасход КАК СуммаРасход,
		|	УдалитьДенежныеСредстваПрогноз.СуммаРасходВал КАК СуммаРасходВал
		|ИЗ
		|	ТаблицаРегистраторов КАК ТаблицаРегистраторов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УдалитьДенежныеСредстваПрогноз КАК УдалитьДенежныеСредстваПрогноз
		|		ПО ТаблицаРегистраторов.Регистратор = УдалитьДенежныеСредстваПрогноз.Регистратор
		|ИТОГИ ПО
		|	Регистратор";
		
		РезультатЗапросаДенежныеСредстваПрогноз = ЗапросДенежныеСредстваПрогноз.Выполнить();
		
		Если РезультатЗапросаДенежныеСредстваПрогноз.Пустой() Тогда
			ПереносИзДенежныеСредстваПрогнозЗавершен = Истина;
		КонецЕсли;
		
		// Обработка данных по регистру ДенежныеСредства
		Если НЕ ПереносИзДенежныеСредстваЗавершен Тогда
			
			НаборЗаписейРегистра = РегистрыНакопления.ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
			ВыборкаДенежныеСредства = РезультатЗапросаДенежныеСредства.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДенежныеСредства.Следующий() Цикл
				
				НаборЗаписейРегистра.Отбор.Регистратор.Установить(ВыборкаДенежныеСредства.Регистратор);
				ВыборкаДетальныхЗаписей = ВыборкаДенежныеСредства.Выбрать();
				
				Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
					
					НоваяЗапись = НаборЗаписейРегистра.Добавить();
					НоваяЗапись.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныхЗаписей,,"Регистратор");
					
					Если ВыборкаДетальныхЗаписей.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
						НоваяЗапись.СуммаРасход = ВыборкаДетальныхЗаписей.Сумма;
						НоваяЗапись.СуммаРасходВал = ВыборкаДетальныхЗаписей.СуммаВал;
					Иначе
						НоваяЗапись.СуммаПриход = ВыборкаДетальныхЗаписей.Сумма;
						НоваяЗапись.СуммаПриходВал = ВыборкаДетальныхЗаписей.СуммаВал;
					КонецЕсли;
					
				КонецЦикла;
				
				НаборЗаписейРегистра.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейРегистра);
				НаборЗаписейРегистра.Очистить();
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Обработка данных по регистру ДенежныеСредстваПрогноз
		Если НЕ ПереносИзДенежныеСредстваПрогнозЗавершен Тогда
			
			НаборЗаписейРегистра = РегистрыНакопления.ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
			ВыборкаДенежныеСредстваПрогноз = РезультатЗапросаДенежныеСредстваПрогноз.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДенежныеСредстваПрогноз.Следующий() Цикл
				
				НаборЗаписейРегистра.Отбор.Регистратор.Установить(ВыборкаДенежныеСредстваПрогноз.Регистратор);
				ВыборкаДетальныхЗаписей = ВыборкаДенежныеСредстваПрогноз.Выбрать();
				
				Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
					
					НоваяЗапись = НаборЗаписейРегистра.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныхЗаписей,,"Регистратор");
					
					Если ВыборкаДетальныхЗаписей.СчетУчета = ПланыСчетов.Управленческий.Касса Тогда
						НоваяЗапись.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
					Иначе
						НоваяЗапись.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
					КонецЕсли;
					
				КонецЦикла;
				
				НаборЗаписейРегистра.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейРегистра);
				НаборЗаписейРегистра.Очистить();
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Заполнение регистра ДвиженияДенежныхСредств'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
	КонецПопытки;
	
	// Условия окончания - обработаны оба регистра
	Если ПереносИзДенежныеСредстваЗавершен И ПереносИзДенежныеСредстваПрогнозЗавершен Тогда
		Константы.РегистрДвиженияДенежныхСредствЗаполнен.Установить(Истина);
		Параметры.ОбработкаЗавершена = Истина;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСтарыеЗаписиОчередиЗадачАссистентаУправления(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОчередьЗадачАссистентаУправления.Предмет КАК Предмет,
	|	ОчередьЗадачАссистентаУправления.Задача КАК Задача,
	|	ОчередьЗадачАссистентаУправления.Событие КАК Событие,
	|	ОчередьЗадачАссистентаУправления.Источник КАК Источник
	|ИЗ
	|	РегистрСведений.ОчередьЗадачАссистентаУправления КАК ОчередьЗадачАссистентаУправления
	|ГДЕ
	|	ОчередьЗадачАссистентаУправления.Дата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаписиОчереди = Результат.Выгрузить();
	Для каждого Запись Из ЗаписиОчереди Цикл
		МенеджерЗаписи = РегистрыСведений.ОчередьЗадачАссистентаУправления.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Предмет = Запись.Предмет;
		МенеджерЗаписи.Задача = Запись.Задача;
		МенеджерЗаписи.Событие = Запись.Событие;
		МенеджерЗаписи.Источник = Запись.Источник;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОбновитьСвойстваСлужебногоПользователяАссистентУправления(Параметры) Экспорт
	
	Если НЕ АссистентУправления.Используется() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяПользователяАссистента = "АссистентУправленияНашейФирмой";
	
	СвойстваПользователяАссистент = Пользователи.СвойстваПользователяИБ(ИмяПользователяАссистента);
	
	Если СвойстваПользователяАссистент = Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Если Пользователи.ВходВПрограммуРазрешен(СвойстваПользователяАссистент) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ОбновляемыеСвойства = Новый Структура;
	ОбновляемыеСвойства.Вставить("АутентификацияСтандартная", Истина);
	Пользователи.УстановитьСвойстваПользователяИБ(ИмяПользователяАссистента, ОбновляемыеСвойства, Ложь, Ложь);
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОбновитьРасписаниеРегламентногоЗаданияОбработкаПравилРабочихПроцессов(Параметры) Экспорт
	
	ОтборЗаданий = Новый Структура;
	ОтборЗаданий.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбработкаПравилРабочихПроцессов);
	Если Не РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ОтборЗаданий.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания.ОбработкаПравилРабочихПроцессов.ИмяМетода);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ОтборЗаданий);
	
	Если СписокЗаданий.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);
	
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДниНедели   = ДниНедели;
	Расписание.Месяцы      = Месяцы;
	Расписание.ПериодПовтораВТечениеДня = ?(ОбщегоНазначения.РежимОтладки(), 5, 180);
	Расписание.ПериодПовтораДней        = 1; // каждый день
	
	Для каждого Задание Из СписокЗаданий Цикл
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Расписание", Расписание);
		РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьИмяДопРеквизитовПВХ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = """"";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РазрешенныеСимволыИмениРеквизита = Новый Соответствие;
	СтрСимволы = "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890";
	Для н=1 По СтрДлина(СтрСимволы) Цикл
		РазрешенныеСимволыИмениРеквизита.Вставить(Сред(СтрСимволы, н, 1), Истина);
	КонецЦикла;	
	
	Пока Выборка.Следующий() Цикл
	
		УИД = Новый УникальныйИдентификатор();
		СтрокаУИД = СтрЗаменить(Строка(УИД), "-", "");
		
		ИмяРеквизита = "";
		номерСимвола = 1;
		
		Пока номерСимвола <= СтрДлина(Выборка.Наименование) Цикл
			ПроверСимвол = Сред(Выборка.Наименование, номерСимвола, 1);
			Если РазрешенныеСимволыИмениРеквизита.Получить(НРег(ПроверСимвол)) <> Неопределено Тогда
				ИмяРеквизита = ИмяРеквизита + ПроверСимвол;
			КонецЕсли;
			номерСимвола = номерСимвола + 1;
		КонецЦикла;
		
		Если ИмяРеквизита = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ПВХОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПВХОбъект.Заблокировать();
			ПВХОбъект.Имя = ИмяРеквизита+СтрокаУИД;
			ПВХОбъект.Записать();
		Исключение
		КонецПопытки; 
	
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначениеПризнакаИспользуется(Параметры) Экспорт
	
	НаборОбъект =Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПередачаТоваровМеждуОрганизациями.ПолучитьОбъект();
	НаборОбъект.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_1_6_23

Процедура ОбновитьОтчеты_1_6_23(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.РезервыТоваровОрганизаций);
	
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОбновитьЗаписиКалендаряСотрудника(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	ЗаписиКалендаряСотрудника.Ссылка КАК Ссылка,
	|	ЗаписиКалендаряСотрудника.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаписиКалендаряСотрудника.Наименование КАК Наименование,
	|	ЗаписиКалендаряСотрудника.Источник КАК Источник,
	|	ЗаписиКалендаряСотрудника.Календарь КАК Календарь,
	|	ЗаписиКалендаряСотрудника.Начало КАК Начало,
	|	ЗаписиКалендаряСотрудника.Окончание КАК Окончание,
	|	ЗаписиКалендаряСотрудника.Описание КАК Описание,
	|	ЗаписиКалендаряСотрудника.ОтветственныйИсточника КАК ОтветственныйИсточника,
	|	ЗаписиКалендаряСотрудника.Календарь.ВладелецКалендаря КАК КалендарьВладелецКалендаря,
	|	ЗаписиКалендаряСотрудника.УдалитьETag КАК УдалитьETag,
	|	ЗаписиКалендаряСотрудника.УдалитьИдентификатор КАК УдалитьИдентификатор,
	|	ЗаписиКалендаряСотрудника.УдалитьКлюч КАК УдалитьКлюч,
	|	ВЫБОР
	|		КОГДА ОбновленныеЗаписиКалендаряСотрудника.ЗаписьКалендаря ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗаписьУжеОбновлена,
	|	ОбновленныеЗаписиКалендаряСотрудника.Задача КАК УжеСозданнаяЗадача
	|ИЗ
	|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаряСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбновленныеЗаписиКалендаряСотрудника КАК ОбновленныеЗаписиКалендаряСотрудника
	|		ПО ЗаписиКалендаряСотрудника.Ссылка = ОбновленныеЗаписиКалендаряСотрудника.ЗаписьКалендаря
	|ГДЕ
	|	(ОбновленныеЗаписиКалендаряСотрудника.ЗаписьКалендаря ЕСТЬ NULL
	|			ИЛИ НЕ ОбновленныеЗаписиКалендаряСотрудника.ЗаписьОбновлена)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начало УБЫВ";
	
	ЕстьОшибки = Ложь;
	
	КоличествоОбработанных = 0;
	
	НачатьТранзакцию();
	Попытка
		
		ТекущаяЗаписьКалендаря = Неопределено;
		
		ВыборЗаписейКалендаря = Запрос.Выполнить().Выбрать();
		Пока ВыборЗаписейКалендаря.Следующий() Цикл
			ТекущаяЗаписьКалендаря = ВыборЗаписейКалендаря.Ссылка;
			
			ЗаписиПерехода = РегистрыСведений.ОбновленныеЗаписиКалендаряСотрудника.СоздатьНаборЗаписей();
			ЗаписиПерехода.Отбор.ЗаписьКалендаря.Установить(ВыборЗаписейКалендаря.Ссылка);
			
			ЗаписьПерехода = ЗаписиПерехода.Добавить();
			ЗаписьПерехода.ЗаписьКалендаря = ВыборЗаписейКалендаря.Ссылка;
			ЗаписьПерехода.ЗаписьОбновлена = Истина;
			
			Если ЗначениеЗаполнено(ВыборЗаписейКалендаря.Источник) Тогда
				ОбновитьЗаписьКалендаряНаОснованииИсточника(ВыборЗаписейКалендаря.Ссылка);
				ДобавитьДанныеЗаписиКалендаряGoogle(ВыборЗаписейКалендаря, ВыборЗаписейКалендаря.Ссылка);
			Иначе
				Если ВыборЗаписейКалендаря.ЗаписьУжеОбновлена Тогда
					ЗаписьПерехода.Задача = ВыборЗаписейКалендаря.УжеСозданнаяЗадача;
				Иначе
					НоваяЗадачаДокумент = СоздатьНовуюЗадачуНаОснованииЗаписиКалендаря(ВыборЗаписейКалендаря);
					ДобавитьДанныеЗаписиКалендаряGoogle(ВыборЗаписейКалендаря, НоваяЗадачаДокумент.Ссылка);
					ЗаписьПерехода.Задача = НоваяЗадачаДокумент.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(ЗаписиПерехода);
			
			КоличествоОбработанных = КоличествоОбработанных + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЕстьОшибки = Истина;
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение обработчика ОбновитьЗаписиКалендаряСотрудника'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,ТекущаяЗаписьКалендаря,ТекстСообщения);
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки И КоличествоОбработанных < 500;
	
КонецПроцедуры

// Старые записи календаря созданные вручную конвертируются в ЗадачаСотрудка,
// а сами записи справочника помечаются на удаление.
//
Функция СоздатьНовуюЗадачуНаОснованииЗаписиКалендаря(ВыборЗаписейКалендаря)
	
	Ответственный = ВыборЗаписейКалендаря.КалендарьВладелецКалендаря;
	
	НоваяЗадачаДокумент = Документы.ЗадачаСотрудника.СоздатьДокумент();
	НоваяЗадачаДокумент.ПометкаУдаления = ВыборЗаписейКалендаря.ПометкаУдаления;
	НоваяЗадачаДокумент.ДатаНачала = ВыборЗаписейКалендаря.Начало;
	НоваяЗадачаДокумент.ДатаОкончания = ВыборЗаписейКалендаря.Окончание;
	НоваяЗадачаДокумент.Дата = ВыборЗаписейКалендаря.Начало;
	НоваяЗадачаДокумент.Календарь = ВыборЗаписейКалендаря.Календарь;
	НоваяЗадачаДокумент.Ответственный = Ответственный;
	НоваяЗадачаДокумент.Автор = РегистрыСведений.СотрудникиПользователя.ПолучитьПользователяПоСотруднику(Ответственный);
	НоваяЗадачаДокумент.Наименование = ВыборЗаписейКалендаря.Наименование;
	НоваяЗадачаДокумент.Описание = ВыборЗаписейКалендаря.Наименование + Символы.ПС + ВыборЗаписейКалендаря.Описание;
	
	Если НЕ ЗначениеЗаполнено(НоваяЗадачаДокумент.Дата) Тогда
		НоваяЗадачаДокумент.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НоваяЗадачаДокумент);
	
	СтараяЗапись = ВыборЗаписейКалендаря.Ссылка.ПолучитьОбъект();
	СтараяЗапись.УстановитьПометкуУдаления(Истина);
	
	Возврат НоваяЗадачаДокумент;
	
КонецФункции

Процедура ОбновитьЗаписьКалендаряНаОснованииИсточника(ЗаписьКалендаряСсылка)
	
	ЗаписьКалендаря = ЗаписьКалендаряСсылка.ПолучитьОбъект();
	ЗаписьКалендаря.Заблокировать();
	
	Если ТипЗнч(ЗаписьКалендаря.Источник) = Тип("ДокументСсылка.Событие") Тогда
		
		ДанныеИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьКалендаря.Источник, "Состояние,Ответственный");
		СобытиеЗавершено = ДанныеИсточника.Состояние = Справочники.СостоянияСобытий.Завершено
			Или ДанныеИсточника.Состояние = Справочники.СостоянияСобытий.Отменено;
		ЗаписьКалендаря.Завершено = СобытиеЗавершено;
		ЗаписьКалендаря.ОтветственныйИсточника = ДанныеИсточника.Ответственный;
		
	ИначеЕсли ТипЗнч(ЗаписьКалендаря.Источник) = Тип("ДокументСсылка.ЗаданиеНаРаботу") Тогда
		
		ДанныеИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьКалендаря.Источник, "Состояние,Сотрудник");
		ЗаданиеЗавершено = ДанныеИсточника.Состояние = Справочники.СостоянияСобытий.Завершено
			Или ДанныеИсточника.Состояние = Справочники.СостоянияСобытий.Отменено;
		ЗаписьКалендаря.Завершено = ЗаданиеЗавершено;
		ЗаписьКалендаря.ОтветственныйИсточника = ДанныеИсточника.Сотрудник;
		
	ИначеЕсли ТипЗнч(ЗаписьКалендаря.Источник) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		
		ДанныеИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьКалендаря.Источник, "СостояниеЗаказа,Ответственный");
		ЗаказЗавершен = ДанныеИсточника.СостояниеЗаказа = Справочники.СостоянияЗаказовНаПроизводство.Завершен;
		ЗаписьКалендаря.Завершено = ЗаказЗавершен;
		ЗаписьКалендаря.ОтветственныйИсточника = ДанныеИсточника.Ответственный;
		
	ИначеЕсли ТипЗнч(ЗаписьКалендаря.Источник) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ДанныеИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьКалендаря.Источник, "СостояниеЗаказа,Ответственный");
		ЗаказЗавершен = ДанныеИсточника.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
		ЗаписьКалендаря.Завершено = ЗаказЗавершен;
		ЗаписьКалендаря.ОтветственныйИсточника = ДанныеИсточника.Ответственный;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаписьКалендаря);
	
КонецПроцедуры

Процедура ДобавитьДанныеЗаписиКалендаряGoogle(ВыборЗаписейКалендаря, ЗаписьКалендаряСсылка)
	
	Если ВыборЗаписейКалендаря.ЗаписьУжеОбновлена Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.ДанныеЗаписейКалендаряGoogle.СоздатьНаборЗаписей();
	Набор.Отбор.Источник.Установить(ЗаписьКалендаряСсылка);
	
	Запись = Набор.Добавить();
	Запись.Источник      = ЗаписьКалендаряСсылка;
	Запись.Календарь     = ВыборЗаписейКалендаря.Календарь;
	Запись.ETag          = ВыборЗаписейКалендаря.УдалитьETag;
	Запись.Идентификатор = ВыборЗаписейКалендаря.УдалитьИдентификатор;
	Запись.Ключ          = ВыборЗаписейКалендаря.УдалитьКлюч;
	
	Если НЕ ЗначениеЗаполнено(Запись.ETag)
		И НЕ ЗначениеЗаполнено(Запись.Идентификатор) Тогда
		Запись.Идентификатор = СтрЗаменить(Новый УникальныйИдентификатор(), "-", "");
		Запись.Ключ = ОбменСGoogle.КлючИзИдентификатора(Запись.Идентификатор, ТипЗнч(ЗаписьКалендаряСсылка));
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
	
КонецПроцедуры

Процедура ОчисткаЗаказовПокупателейВПриходнойНакладной(Параметры) Экспорт
	
	ЕстьОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НЕ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяЗапасы.Ссылка";
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.ПриходнаяНакладная");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	СсылкаНаДокумент = Неопределено;
	ПустойЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
	НачатьТранзакцию();
	
	Попытка
		
		Результат = Запрос.Выполнить();
		ЭлементБлокировки.ИсточникДанных = Результат;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СсылкаНаДокумент = Выборка.Ссылка;
			ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
			ДокументОбъект.Заблокировать();
			Для каждого СтрокаТабличнойЧасти Из ДокументОбъект.Запасы Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) Тогда
					Продолжить;
				КонецЕсли; 
				СтрокаТабличнойЧасти.ЗаказПокупателя = ПустойЗаказ;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЕстьОшибки = Истина;
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение обработчика ОчисткаЗаказовПокупателейВПриходнойНакладной'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка , , СсылкаНаДокумент, ТекстСообщения);
			
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

Процедура УстановкаЗавершающихЭтаповДляПоэтапногоПроизводства(Параметры) Экспорт
	
	ЕстьОшибки = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭтапыПроизводства")
		И НЕ ПолучитьФункциональнуюОпцию("ВыполнениеЭтаповРазнымиПодразделениями") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Запасы.Регистратор КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Запасы.Регистратор ССЫЛКА Документ.СборкаЗапасов
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Тип
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|	И Запасы.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.НезавершенноеПроизводство)
		|	И (Запасы.Регистратор ССЫЛКА Документ.СборкаЗапасов
		|			ИЛИ Запасы.Регистратор ССЫЛКА Документ.СдельныйНаряд)
		|	И Запасы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И Запасы.Спецификация <> ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
		|	И Запасы.Спецификация.ВидПроизводства <> ЗНАЧЕНИЕ(Справочник.ВидыПроизводства.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.Регистратор";
		
		Блокировка = Новый БлокировкаДанных;
		СсылкаНаДокумент = Неопределено;
		ПустойЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		НачатьТранзакцию();
		
		Попытка
			
			Результат = Запрос.Выполнить();
			ТаблицаДокументов = Результат.Выгрузить();
			
			ТаблицаПроизводство = ТаблицаДокументов.Скопировать(Новый Структура("Тип", 0));
			ЭлементБлокировки = Блокировка.Добавить("Документ.СборкаЗапасов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТаблицаПроизводство;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			
			ТаблицаСдельныеНаряды = ТаблицаДокументов.Скопировать(Новый Структура("Тип", 1));
			ЭлементБлокировки = Блокировка.Добавить("Документ.СдельныйНаряд");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТаблицаСдельныеНаряды;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			
			Блокировка.Заблокировать();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				СсылкаНаДокумент = Выборка.Ссылка;
				ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
				ДокументОбъект.Заблокировать();
				Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СборкаЗапасов") Тогда
					Если ДокументОбъект.ВидОперации <> Перечисления.ВидыОперацийСборкаЗапасов.Сборка Тогда
						Продолжить;
					КонецЕсли; 
					ТипСтруктурнойЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.СтруктурнаяЕдиница, "ТипСтруктурнойЕдиницы", Истина);
					Если ТипСтруктурнойЕдиницы <> Перечисления.ТипыСтруктурныхЕдиниц.Подразделение Тогда
						Продолжить;
					КонецЕсли; 
					ИмяТЧ = "Продукция";
				ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СдельныйНаряд") Тогда
					ИмяТЧ = "Операции";
				Иначе
					Продолжить;
				КонецЕсли; 
				Для каждого СтрокаТабличнойЧасти Из ДокументОбъект[ИмяТЧ] Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Спецификация) Тогда
						СтрокаТабличнойЧасти.ПодразделениеЗавершающегоЭтапа = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
					Иначе 
						СтрокаТабличнойЧасти.ПодразделениеЗавершающегоЭтапа = ДокументОбъект.СтруктурнаяЕдиница;
					КонецЕсли; 
				КонецЦикла;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
				НаборЗаписей = ДокументОбъект.Движения.Запасы;
				НаборЗаписей.Прочитать();
				Для каждого Запись Из НаборЗаписей Цикл
					Если НЕ ЗначениеЗаполнено(Запись.СтруктурнаяЕдиница)
						И Запись.СчетУчета = ПланыСчетов.Управленческий.НезавершенноеПроизводство
						И ЗначениеЗаполнено(Запись.Номенклатура)
						И ЗначениеЗаполнено(Запись.Спецификация) Тогда
						Запись.СтруктурнаяЕдиница = ДокументОбъект.СтруктурнаяЕдиница;
					КонецЕсли; 
					Если НЕ ЗначениеЗаполнено(Запись.КоррСтруктурнаяЕдиница)
						И Запись.КоррСчетУчета = ПланыСчетов.Управленческий.НезавершенноеПроизводство
						И ЗначениеЗаполнено(Запись.КоррНоменклатура)
						И ЗначениеЗаполнено(Запись.КоррСпецификация) Тогда
						Запись.КоррСтруктурнаяЕдиница = ДокументОбъект.СтруктурнаяЕдиница;
					КонецЕсли; 
				КонецЦикла;
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, , Ложь);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ЕстьОшибки = Истина;
			ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение обработчика УстановкаЗавершающихЭтаповДляПоэтапногоПроизводства'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка , , СсылкаНаДокумент, ТекстСообщения);
				
		КонецПопытки;

	КонецЕсли; 
	
	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры


Процедура ОбновитьКалендарьНа2021ГодИПредельнуюВеличинуБазыСтраховыхВзносов() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов();
	
КонецПроцедуры

Процедура ОбновитьТарифыСтраховыхВзносов() Экспорт
	
	// Контроль
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	// Получение данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТарифыСтраховыхВзносов.ВидТарифа КАК ВидТарифа,
		|	ТарифыСтраховыхВзносов.Период КАК Период,
		|	ТарифыСтраховыхВзносов.ПФР КАК ПФР,
		|	ТарифыСтраховыхВзносов.ПФРНакопительная КАК ПФРНакопительная,
		|	ТарифыСтраховыхВзносов.ФСС КАК ФСС,
		|	ТарифыСтраховыхВзносов.ФФОМС КАК ФФОМС,
		|	ТарифыСтраховыхВзносов.ТФОМС КАК ТФОМС
		|ИЗ
		|	РегистрСведений.ТарифыСтраховыхВзносов КАК ТарифыСтраховыхВзносов
		|ГДЕ
		|	(ТарифыСтраховыхВзносов.Период = ДАТАВРЕМЯ(2021, 1, 1)
		|			ИЛИ ТарифыСтраховыхВзносов.Период = ДАТАВРЕМЯ(2028, 1, 1)
		|				И ТарифыСтраховыхВзносов.ВидТарифа = &ДляЧленовЭкипажейМорскихСудовПодФлагомРФ
		|			ИЛИ ТарифыСтраховыхВзносов.Период = ДАТАВРЕМЯ(2024, 1, 1)
		|				И ТарифыСтраховыхВзносов.ВидТарифа = &ITОрганизации)
		|	И ТарифыСтраховыхВзносов.ВидТарифа <> &РезидентТехникоВнедренческойЗоны
		|	И ТарифыСтраховыхВзносов.ВидТарифа <> &ХозОбществаБюджетныхВУЗов
		|	И ТарифыСтраховыхВзносов.ПФР = 26";
	
	РезидентТехникоВнедренческойЗоны = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "РезидентТехникоВнедренческойЗоны");
	ХозОбществаБюджетныхВУЗов = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ХозОбществаБюджетныхВУЗов");
	ДляЧленовЭкипажейМорскихСудовПодФлагомРФ = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ДляЧленовЭкипажейМорскихСудовПодФлагомРФ");
	ITОрганизации = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ITОрганизации");
	
	Запрос.УстановитьПараметр("ДляЧленовЭкипажейМорскихСудовПодФлагомРФ", ДляЧленовЭкипажейМорскихСудовПодФлагомРФ);
	Запрос.УстановитьПараметр("ITОрганизации", ITОрганизации);
	Запрос.УстановитьПараметр("РезидентТехникоВнедренческойЗоны", РезидентТехникоВнедренческойЗоны);
	Запрос.УстановитьПараметр("ХозОбществаБюджетныхВУЗов", ХозОбществаБюджетныхВУЗов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Обработка данных
	НачатьТранзакцию();
	
	Попытка
		
		// Изменим записи за 2021-й год.
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборТарифовСтраховыхВзносов = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();
			НаборТарифовСтраховыхВзносов.Отбор.ВидТарифа.Установить(ВыборкаДетальныеЗаписи.ВидТарифа);
			НаборТарифовСтраховыхВзносов.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
			
			ЗаписьТарифаСтраховыхВзносов = НаборТарифовСтраховыхВзносов.Добавить();
			
			ЗаполнитьЗначенияСвойств(ЗаписьТарифаСтраховыхВзносов, ВыборкаДетальныеЗаписи);
			ЗаписьТарифаСтраховыхВзносов.ПФР = 22;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборТарифовСтраховыхВзносов, Истина);
			
		КонецЦикла;
		
		// Обработаем ХозОбществаБюджетныхВУЗов и РезидентТехникоВнедренческойЗоны
		// Удалим записи за 2021-й год для некоторых видов тарифов.
		НаборУдалить = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();
		НаборУдалить.Отбор.ВидТарифа.Установить(РезидентТехникоВнедренческойЗоны);
		НаборУдалить.Отбор.Период.Установить('20210101');
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборУдалить, Истина);
		
		НаборУдалить = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();
		НаборУдалить.Отбор.ВидТарифа.Установить(ХозОбществаБюджетныхВУЗов);
		НаборУдалить.Отбор.Период.Установить('20210101');
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборУдалить, Истина);
		
		// Добавим записи на 2021-й год
		НаборДобавить = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();
		НаборДобавить.Отбор.ВидТарифа.Установить(ХозОбществаБюджетныхВУЗов);
		НаборДобавить.Отбор.Период.Установить('20200101');
		
		ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборДобавить, '20200101', ХозОбществаБюджетныхВУЗов,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
			
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборДобавить, Истина);
		
		НаборДобавить = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();
		НаборДобавить.Отбор.ВидТарифа.Установить(РезидентТехникоВнедренческойЗоны);
		НаборДобавить.Отбор.Период.Установить('20200101');
		
		ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборДобавить, '20200101', РезидентТехникоВнедренческойЗоны,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
			
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборДобавить, Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение обработчика ОбновитьТарифыСтраховыхВзносов'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка , , , ТекстСообщения);
			
	КонецПопытки;
	
КонецПроцедуры

Процедура ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей, ДатаСведений, ВидТарифа, ПФР = 0, ПФРНакопительная = 0, ФСС = 0, ФФОМС = 0, ТФОМС = 0)

    НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = ДатаСведений;
	НоваяСтрока.ВидТарифа = ВидТарифа;
	НоваяСтрока.ПФР = ПФР;
	НоваяСтрока.ПФРНакопительная = ПФРНакопительная;
	НоваяСтрока.ФСС = ФСС;
	НоваяСтрока.ТФОМС = ТФОМС;
	НоваяСтрока.ФФОМС = ФФОМС;

КонецПроцедуры

#КонецОбласти

#КонецОбласти