
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки["ТочкаПроцессаОтбор"]=Неопределено Тогда
		Настройки.Вставить("ТочкаПроцессаОтбор", Неопределено);
		
	КонецЕсли;
	
	ТочкаПроцесса=Настройки["ТочкаПроцессаОтбор"];
	
	ОбновитьСписок();

КонецПроцедуры

Процедура ОбновитьСписок()
	
	//установим отбор в списке
	КП_ОбщееСервер.УстановитьОтборПоСписку(Список, "ТочкаКБП", ТочкаПроцессаОтбор, ЗначениеЗаполнено(ТочкаПроцессаОтбор));
	
	Элементы.ТочкаКБП.Видимость=НЕ ЗначениеЗаполнено(ТочкаПроцессаОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура КорпоративныйПроцессПриИзменении(Элемент)
	ОбновитьСписок();
	
КонецПроцедуры
