#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ставка", "Видимость",
		Не Объект.НеОблагается);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Расчетная", "Видимость",
		Не Объект.НеОблагается);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеОблагаетсяПриИзменении(Элемент)

	Если Объект.НеОблагается Тогда

		Объект.Ставка = 0;
		Объект.Расчетная = Ложь;

	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ставка", "Видимость",
		Не Объект.НеОблагается);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Расчетная", "Видимость",
		Не Объект.НеОблагается);

КонецПроцедуры

#КонецОбласти