#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстФормулы") Тогда
		
		ТекстФормулы = Параметры.ТекстФормулы;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыРасчетов

&НаКлиенте
Процедура ПараметрыРасчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтруктураДанных = Новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока);

	ТекстВФормулу = ПолучитьИдентификаторПоказателя(СтруктураДанных);
	ВставитьТекстВФормулу(ТекстВФормулу);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(ТекстФормулы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВставитьТекстВФормулу(Показатель)
	
	ТекстФормулы = СтрШаблон("%1 [%2]", ТекстФормулы, СокрЛП(Показатель));
			
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторПоказателя(СтруктураДанных)
	
	Возврат СокрЛП(СтруктураДанных.ВыбраннаяСтрока.Идентификатор);

КонецФункции

#КонецОбласти
