
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ФорматШаблонаНаименований", ФорматШаблонаНаименований);
	Параметры.Свойство("ВидПроцесса", ВидПроцессаСсылка);
	
	ПрочитатьНастройкиСервером();
	
	УстановитьОформлениеЭлементов();
	
	ЗаполнитьТаблицуЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗакрытьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	РезультатФормы=СокрЛП(ФорматШаблонаНаименований);
	Модифицированность=Ложь;
	Закрыть(РезультатФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВФормат(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВФорматЗавершение", ЭтотОбъект), НСтр("en='Do you want to add items to the template?';ru='Добавить элементы в шаблон наименования?'"), РежимДиалогаВопрос.ДаНет,,,КП_ОбщееКлиент.ЗаголовокДиалога());	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВФорматЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
        Возврат;
        
    КонецЕсли;
    
    СтрокаЭлементов="";
    
    ЭлементДобавлен=Ложь;
    
    Для Каждого СтрокаТЧ Из ТаблицаЭлементов Цикл
        Если НЕ СтрокаТЧ.ДобавитьВФормат Тогда
            Продолжить;
        КонецЕсли;
        
        СтрокаЭлемента="{"+СокрЛП(СтрокаТЧ.ЭлементНаименования)+"}";
        
        Если Найти(ФорматШаблонаНаименований, СтрокаЭлемента)>0 Тогда
            //элемент уже есть в списке
            Продолжить;
        КонецЕсли;
        
        ФорматШаблонаНаименований=ФорматШаблонаНаименований+" "+СтрокаЭлемента;	
        ЭлементДобавлен=Истина;
        
    КонецЦикла;
    
    Модифицированность=ЭлементДобавлен;

КонецПроцедуры

//&НаКлиенте
//Процедура ДекорацияПоказатьДоступныеЭлементыНажатие(Элемент)
//	ФлагТаблицаЭлементовПоказана=НЕ ФлагТаблицаЭлементовПоказана;
//	
//	УстановитьОформлениеЭлементов();
//	
//КонецПроцедуры

Процедура УстановитьОформлениеЭлементов()
	//Если ФлагТаблицаЭлементовПоказана Тогда
	//	Элементы.ДекорацияПоказатьДоступныеЭлементы.Заголовок=НСтр("ru='↑ Скрыть доступные элементы'; en='↑ Hide template elements';");
	//	
	//Иначе
	//	Элементы.ДекорацияПоказатьДоступныеЭлементы.Заголовок=НСтр("ru='↓ Показать доступные элементы'; en='↓ Show template elements';");
	//	
	//КонецЕсли;
	//
	//Элементы.ГруппаДоступныеЭлементы.Видимость=ФлагТаблицаЭлементовПоказана;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиСервером()
	
	КП_ОбщееСервер.СохранитьНастройкуПользователя("ВидБизнесПроцессаШаблонФормированияНаименования", "ПоказыватьДоступныеЭлементы", ФлагТаблицаЭлементовПоказана);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиСервером()
	
	ФлагТаблицаЭлементовПоказана=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("ВидБизнесПроцессаШаблонФормированияНаименования", "ПоказыватьДоступныеЭлементы");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ЗаписатьНастройкиСервером();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматШаблонаНаименованийПриИзменении(Элемент)
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("en='Do you want to save changes?';ru='Сохранить изменения?'"), РежимДиалогаВопрос.ДаНет,,,КП_ОбщееКлиент.ЗаголовокДиалога());
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если Модифицированность И РезультатВопроса=КодВозвратаДиалога.Да Тогда
        ЗакрытьФорму();
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЭлементов()
	//добавим наименование
	НоваяСтрока=ТаблицаЭлементов.Добавить();
	НоваяСтрока.ЭлементНаименования="НаименованиеВида";
	НоваяСтрока.ДобавитьВФормат=ПустаяСтрока(ФорматШаблонаНаименований);
	
	//добавим реквизиты
	Для Каждого СтрокаТЧ Из ВидПроцессаСсылка.РеквизитыПроцессов Цикл
		ИмяРеквизитаДляФункций=СокрЛП(СтрокаТЧ.РеквизитПроцесса.ИмяРеквизитаДляФункций);
		НоваяСтрока=ТаблицаЭлементов.Добавить();
		НоваяСтрока.ЭлементНаименования="Реквизит."+ИмяРеквизитаДляФункций;
		НоваяСтрока.Примечание="Наименование реквизита из списка реквизитов процесса";
		НоваяСтрока.ДобавитьВФормат=Ложь;
		
	КонецЦикла;
	
	//добавим пользователей
	НоваяСтрока=ТаблицаЭлементов.Добавить();
	НоваяСтрока.ЭлементНаименования="ОсновныеИсполнители[0]";
	НоваяСтрока.ДобавитьВФормат=Ложь;
	НоваяСтрока.Примечание="Используете [НомерСтроки] для указания нужной строки исполнителя";
	
	//добавим документы
	НоваяСтрока=ТаблицаЭлементов.Добавить();
	НоваяСтрока.ЭлементНаименования="СписокДокументов[0]";
	НоваяСтрока.ДобавитьВФормат=Ложь;
	НоваяСтрока.Примечание="Используете [НомерСтроки] для указания нужной строки документа";
	
КонецПроцедуры
