#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
// Параметры:
//  ДополнительныеСвойства	 - Структура - структура с ключами ДляПроведения.СтруктураВременныеТаблицы
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	СерийныеНомераКПоступлению.НомерСтроки КАК НомерСтроки,
	|	СерийныеНомераКПоступлению.Номенклатура КАК Номенклатура,
	|	СерийныеНомераКПоступлению.Характеристика КАК Характеристика,
	|	СерийныеНомераКПоступлению.Партия КАК Партия,
	|	СерийныеНомераКПоступлению.СерийныйНомер КАК СерийныйНомер,
	|	СерийныеНомераКПоступлению.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СерийныеНомераКПоступлению.Ячейка КАК Ячейка,
	|	СерийныеНомераКПоступлению.Количество КАК КоличествоПередЗаписью,
	|	СерийныеНомераКПоступлению.Количество КАК КоличествоИзменение,
	|	СерийныеНомераКПоступлению.Количество КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСерийныеНомераКПоступлениюИзменение
	|ИЗ
	|	РегистрНакопления.СерийныеНомераКПоступлению КАК СерийныеНомераКПоступлению");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияСерийныеНомераКПоступлениюИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли