// ---- Переменные сессии ----
Функция Сессия() Экспорт
	Попытка
		Сессия=ПараметрыСеанса.БЗ_TSDAPI_ДанныеСеанса.Получить().Сессия;
		Возврат Сессия;
	Исключение
		Возврат Новый Структура();
	КонецПопытки;
КонецФункции

Функция Запрос() Экспорт
	Возврат Новый Структура();
КонецФункции

Функция Ответ() Экспорт
	Возврат Новый Структура();
КонецФункции
	
Функция ВременныеПеременные() Экспорт
	Попытка
		ВременныеПеременные=ПараметрыСеанса.БЗ_TSDAPI_ДанныеСеанса.Получить().ВременныеПеременные;
		Возврат ВременныеПеременные;
	Исключение
		Возврат Новый Структура();
	КонецПопытки;
КонецФункции

// ---- Параметры структур данных ----
Функция ПараметрыПакетОтвета() Экспорт
	Возврат Новый Структура("key_hook,scan_hook,play_sound,play_sound_loop,timer_action","key_hook","scan_hook","play_sound","play_sound_loop","timer_action");
КонецФункции

Функция ПараметрыРядШапка() Экспорт
	Возврат Новый Структура("hr1,hr2,hr3,hr4,hr5,hr6,hr7","hr1","hr2","hr3","hr4","hr5","hr6","hr7");
КонецФункции

Функция ПараметрыРядПодвал() Экспорт
	Возврат Новый Структура("fr1,fr2,fr3,fr4,fr5,fr6","fr1","fr2","fr3","fr4","fr5","fr6");
КонецФункции

Функция ПараметрыКолонки() Экспорт
	Возврат Новый Структура("c1,c2,c3,c4","c1","c2","c3","c4");
КонецФункции

Функция ПараметрыТекстовоеПоле() Экспорт
	Параметры=Новый Структура();
	Параметры.Вставить("tx","tx");
	Параметры.Вставить("tc","tc");
	Параметры.Вставить("sl","sl");
	Параметры.Вставить("bc","bc");
	Параметры.Вставить("al","al");
	Параметры.Вставить("wt","wt");
	Параметры.Вставить("ff","ff");
	Параметры.Вставить("tf","tf");
	Параметры.Вставить("fs","fs");
	Параметры.Вставить("pd","pd");
	Параметры.Вставить("mr","mr");
	Параметры.Вставить("sw","sw");
	Параметры.Вставить("sc","sc");
	Параметры.Вставить("st","st");
	Параметры.Вставить("ls","ls");
	Параметры.Вставить("im","im");
	Параметры.Вставить("imxy","imxy");
	Параметры.Вставить("imsc","imsc");
	Параметры.Вставить("imsw","imsw");
	Параметры.Вставить("hd","hd");	
	Возврат Параметры;
КонецФункции

Функция ПараметрыПолеВвода() Экспорт
	Параметры=Новый Структура();
	Параметры.Вставить("tp","tp");
	Параметры.Вставить("tx","tx");
	Параметры.Вставить("mx","mx");
	Параметры.Вставить("kb","kb");
	Параметры.Вставить("tc","tc");
	Параметры.Вставить("al","al");
	Параметры.Вставить("ff","ff");
	Параметры.Вставить("tf","tf");
	Параметры.Вставить("fs","fs");
	Параметры.Вставить("pd","pd");
	Параметры.Вставить("mr","mr");
	Параметры.Вставить("ls","ls");
	Параметры.Вставить("hd","hd");
	Возврат Параметры;
КонецФункции

Функция ПараметрыСписка() Экспорт
	Возврат Новый Структура("cl,rw,ct,sl,mr,fr,to,sz","cl","rw","ct","sl","mr","fr","to","sz");
КонецФункции

Функция ПараметрыПолейВвода() Экспорт
	Возврат Новый Структура("r1,r2,r3,re1,re2,re3,bc,mr,pd,sw,sc,st,edt","r1","r2","r3","re1","re2","re3","bc","mr","pd","sw","sc","st","edt");
КонецФункции

Функция ПараметрыПолейТекста() Экспорт
	Возврат Новый Структура("r1,r2,r3,r4,rsc,bc,mr,pd,sw,sc,st","r1","r2","r3","r5","rsc","bc","mr","pd","sw","sc","st");
КонецФункции

Функция ПараметрыТиповСтрокСписка() Экспорт
	Возврат Новый Структура("rwtp,rt","rwtp","rt");
КонецФункции

Функция ПеречислениеКнопок() Экспорт
	Кнопки=Новый Структура();
	Кнопки.Вставить("КН_ESC","0004");
	Кнопки.Вставить("КН_0","0007");
	Кнопки.Вставить("КН_1","0008");
	Кнопки.Вставить("КН_2","0009");
	Кнопки.Вставить("КН_3","0010");
	Кнопки.Вставить("КН_4","0011");
	Кнопки.Вставить("КН_5","0012");
	Кнопки.Вставить("КН_6","0013");
	Кнопки.Вставить("КН_7","0014");
	Кнопки.Вставить("КН_8","0015");
	Кнопки.Вставить("КН_9","0016");
	Кнопки.Вставить("КН_ENT","0066");
	Кнопки.Вставить("КН_BS","0067");
	Кнопки.Вставить("КН_DOT","0056");
	Кнопки.Вставить("КН_UP","0019");
	Кнопки.Вставить("КН_DOWN","0020");
	Кнопки.Вставить("КН_LEFT","0021");
	Кнопки.Вставить("КН_RIGHT","0022");
	Возврат Кнопки;
КонецФункции

// ---- Структуры ----
Функция МоделиТСД() Экспорт
	Модели=Новый Структура();
	Модели.Вставить("AtolSmartDroidLite","ATOL SMART DROID LITE");
	Модели.Вставить("AtolSmartDroid","ATOL SMART DROID");
	Возврат Модели;
КонецФункции

Функция ТипыФреймов() Экспорт
	Возврат Новый Структура("authorization,authorization_update,list,list_update,dynlist,edit,edit_update,view,view_update,web,web_update,empty,disconnect,reconnect",
				"authorization","authorization_update","list","list_update","dynlist","edit","edit_update","view","view_update","web","web_update","empty","disconnect","reconnect");
КонецФункции

// ---- Параметры данных фреймов ----
Функция ПараметрыДанныхФреймаСписка() Экспорт
	Возврат Новый Структура("hd,ls,ft","hd","ls","ft");
КонецФункции

Функция ПараметрыДанныхФреймаПолейВвода() Экспорт
	Возврат Новый Структура("hd,ct,ft","hd","ct","ft");
КонецФункции

Функция ПараметрыДанныхФреймаТекста() Экспорт
	Возврат Новый Структура("hd,ct,ft","hd","ct","ft");
КонецФункции

Функция ПараметрыДанныхФреймаВеб() Экспорт
	Возврат Новый Структура("hd,wv,ft,ct,url,mr","hd","wv","ft","ct","url","mr");
КонецФункции

Функция ГСЧ() Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	Возврат ГСЧ;
КонецФункции


