
&НаСервере
Функция ПолучитьПараметрРодителя(Родитель, Элемент) 
	Если ЗначениеЗаполнено(Родитель[Элемент]) Тогда
		Возврат Родитель[Элемент];
	ИначеЕсли ЗначениеЗаполнено(Родитель.Родитель) Тогда
		Возврат ПолучитьПараметрРодителя(Родитель.Родитель, Элемент)
	Иначе
		Возврат ""
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПодсказкуВвода("ТехнологическаяОперация");
	УстановитьПодсказкуВвода("ВидПрограммы");
	УстановитьПодсказкуВвода("ВариантНаладки");
	УстановитьПодсказкуВвода("ВидМатериалаКомпоновки");
КонецПроцедуры

Процедура УстановитьПодсказкуВвода (Элемент)          
	Элементы[Элемент].ПодсказкаВвода = ПолучитьПараметрРодителя(Объект.Родитель, Элемент);  
КонецПроцедуры
