
&НаКлиенте
&ИзменениеИКонтроль("ДокументыОснованияДокументОснованиеНачалоВыбора")
Процедура БЗ_ДокументыОснованияДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
#Удаление

#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
 //кэшЗначений.удалить("договор");
//Если КэшЗначений.ВидОперации=
#КонецВставки
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.СчетФактура.Форма.ФормаПодбораДокументовОснований", КэшЗначений, Элемент);

КонецПроцедуры
