
Процедура ПередЗаписью(Отказ)
	
	ЭтоНовый=(Ссылка.Дата=Дата("00010101"));
	
	Если ЭтоНовый Тогда
		//нужно для срабатывания правил обработки ПравилаРабочегоПроцесса
		ДанныеРабочегоПроцесса = Новый Структура;

		ДанныеРабочегоПроцесса.Вставить("ЭтоНовый", ЭтоНовый);
		ДанныеРабочегоПроцесса.Вставить("СобытиеРабочегоПроцесса",	Перечисления.СобытияРабочегоПроцесса.КП_Задача);
		
		ДополнительныеСвойства.Вставить("ДанныеРабочегоПроцесса", ДанныеРабочегоПроцесса);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	КП_ЗадачиПроцессов.УдалитьНапоминанияПоЗадаче(Ссылка);
КонецПроцедуры

