
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Документы") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Параметры.Свойство("Режим", Режим);
	Если Режим = "ИзмененныеДокументы" Тогда
		Заголовок = НСтр("ru = 'Список измененных документов'");
		Для каждого Документ Из Параметры.Документы Цикл
			НоваяСтрока = СписокДокументов.Добавить();
			НоваяСтрока.Документ = Документ;
		КонецЦикла; 
	ИначеЕсли Режим = "НеверноВыбранаСтатьяДДС" Тогда
		Заголовок = НСтр("ru = 'Список документов с неверной статьей ДДС'");
		Элементы.СписокДокументовСтатья.Видимость = Истина;
		Для каждого СтруктураОписания Из Параметры.Документы Цикл
			НоваяСтрока = СписокДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураОписания);
		КонецЦикла; 
	ИначеЕсли Режим = "НесоответствиеДоговоровОрганизаций" Тогда
		Заголовок = НСтр("ru = 'Список документов с несоответствием договоров и организаций'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Параметры.Тип, "Видимость", Истина);
		Для каждого СтруктураОписания Из Параметры.Документы Цикл
			НоваяСтрока = СписокДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураОписания);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле = Элементы.СписокДокументовДокумент
		ИЛИ Поле = Элементы.СписокДокументовСтатья Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Документ);
	ИначеЕсли Поле = Элементы.СписокДокументовОрганизация1 Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Организация);
	ИначеЕсли Поле = Элементы.СписокДокументовОрганизация1
		ИЛИ Поле = Элементы.СписокДокументовОрганизация2 Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Организация);
	ИначеЕсли Поле = Элементы.СписокДокументовДоговор1
		ИЛИ Поле = Элементы.СписокДокументовДоговор2 Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Договор);
	ИначеЕсли Поле = Элементы.СписокДокументовПодчиненныйДокумент1
		ИЛИ Поле = Элементы.СписокДокументовПодчиненныйДокумент2 Тогда
		ПоказатьЗначение(, ТекущаяСтрока.ПодчиненныйДокумент);
	ИначеЕсли Поле = Элементы.СписокДокументовОрганизацияДоговора Тогда
		ПоказатьЗначение(, ТекущаяСтрока.ОрганизацияДоговора);
	ИначеЕсли Поле = Элементы.СписокДокументовОрганизацияДокумента Тогда
		ПоказатьЗначение(, ТекущаяСтрока.ОрганизацияДокумента);
	ИначеЕсли Поле = Элементы.СписокДокументовДоговорДокумента Тогда
		ПоказатьЗначение(, ТекущаяСтрока.ДоговорДокумента);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ТекущаяСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ПоказатьЗначение(, ТекущаяСтрока.Документ);
	
КонецПроцедуры

#КонецОбласти 

 
