#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗначениеНастройки=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("КП_ЗадачиСотрудников", "ФлагПоказыватьПанельНастроек");
	Если ЗначениеНастройки=Неопределено Тогда
		Элементы.ПоказатьСкрытьПанельНастроек.Пометка=Ложь;
	Иначе
		Элементы.ПоказатьСкрытьПанельНастроек.Пометка=ЗначениеНастройки;
	КонецЕсли;
	
	Элементы.ПользовательскиеНастройки.Видимость=Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьСкрытьПанельНастроек(Команда)
	Элементы.ПоказатьСкрытьПанельНастроек.Пометка=НЕ Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	Элементы.ПользовательскиеНастройки.Видимость=Элементы.ПоказатьСкрытьПанельНастроек.Пометка;
	КП_ОбщееСервер.СохранитьНастройкуПользователя("КП_ЗадачиСотрудников", "ФлагПоказыватьПанельНастроек", Элементы.ПоказатьСкрытьПанельНастроек.Пометка);
КонецПроцедуры

#КонецОбласти
