#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстПредупрежденияОбАктивныхРасширенияхИзменяющихСтруктуруДанных() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АктивныеРасширенияИзменяющиеСтруктуруДанных = ОбщегоНазначенияБТС.АктивныеРасширенияИзменяющиеСтруктуруДанных();

	Если Не ЗначениеЗаполнено(АктивныеРасширенияИзменяющиеСтруктуруДанных) Тогда
		Возврат "";
	КонецЕсли;

	ЧастиТекстаПредупреждения = Новый Массив;
	ЧастиТекстаПредупреждения.Добавить(
		НСтр("ru = 'В приложении установлены и активны расширения конфигурации, изменяющие структуру данных:'"));

	ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	
	Для Каждого Расширение Из АктивныеРасширенияИзменяющиеСтруктуруДанных Цикл
		ЧастиТекстаПредупреждения.Добавить("● ");
		ЧастиТекстаПредупреждения.Добавить(Расширение.Синоним);
		ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиТекстаПредупреждения);		
		
КонецФункции

#КонецОбласти