
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПодменюПодсистемыПечати();
	ВосстановитьОтборыСписковПриСозданиинаСервере();
	
	Элементы.СтраницаОтчетКомиссионераПраваяПанель.Ширина = 28;
	
	МассивИсключений = РаботаСОтборами.МассивИсключенийПоТипуДокумента("ОтчетКомиссионера");
	РаботаСОтборами.ЗаполнитьСписокВыбораОтборОплата(ЭтаФорма, "ОтборОплата", Ложь, МассивИсключений);
	
	УстановитьФорматДатыСписковПриСозданиинаСервере();
	УстановитьПанелиКонтактнойИнформацииПриСозданиинаСервере();
	
	Элементы.ЖурналПодменюЗаполнитьПередачаНаКомиссию.Видимость = Ложь;
	Элементы.ЖурналПодменюЗаполнитьОтчетКомиссионера.Видимость = Ложь;
	Элементы.ЖурналВозвратОтКомиссионераПодменюЗаполнить.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокОтчетКомиссионераПриАктивизацииСтроки(Элемент)
	
	КонтрагентАктивнойСтроки = ?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.Контрагент);
	Если КонтрагентАктивнойСтроки <> ТекущийКонтрагент Тогда
		
		ТекущийКонтрагент = КонтрагентАктивнойСтроки;
		ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элемент.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ПодключитьОбработчикОжидания("УстановитьВидимостьПодменюПоТипуОбъектаСтроки", 0.3, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "Организация");
	
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	
	ВидОперации = Неопределено;
	
	Если ИмяФормыСтрока = "РасходнаяНакладная" Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию");
	ИначеЕсли ИмяФормыСтрока = "ПриходнаяНакладная" Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера");
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВидОперации", ВидОперации);
	
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборОперацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = "ЗаказНаПродажу" Тогда
		ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу")
	ИначеЕсли ВыбранноеЗначение = "ВозвратОтКомиссионера" Тогда
		ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера")
	ИначеЕсли ВыбранноеЗначение = "ПередачаНаКомиссию" Тогда
		ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию")
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Операция", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСписаниеУКомиссионераОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСписаниеУКомиссионераОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСписаниеУКомиссионераОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаПереоценкаУКомиссионераОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПереоценкаУКомиссионераОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПереоценкаУКомиссионераОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаОтчетКомиссионераОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОтчетКомиссионераОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОтчетКомиссионераОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборОплатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	Если ВыбранноеЗначение = "Без оплаты"
		Или ВыбранноеЗначение = "Оплачен частично"
		Или ВыбранноеЗначение = "Оплачен полностью" Тогда
		УстановитьМеткуИОтборСписка("СтатусОплаты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	Иначе
		УстановитьМеткуИОтборСписка("НомерКартинкиОплаты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	КонецЕсли;
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОперацииОтчетКомиссионераОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ВидОперации", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПередачаНаКомиссиюОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПередачаНаКомиссиюОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПередачаНаКомиссиюОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВозвратОтКомиссионераОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВозвратОтКомиссионераОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВозвратОтКомиссионераОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьОтборыНажатие(Элемент)
	СвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПереоценкаУКомиссионераСвернутьОтборыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРазвернутьОтборыНажатие(Элемент)
	РазвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСписаниеУКомиссионераСвернутьОтборыНажатие(Элемент)
	СвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСписаниеУКомиссионераДекорацияРазвернутьОтборыНажатие(Элемент)
	РазвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПереоценкаУКомиссионераДекорацияРазвернутьОтборыНажатие(Элемент)
	РазвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОтчетКомиссионераСвернутьОтборыНажатие(Элемент)
	СвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОтчетКомиссионераДекорацияРазвернутьОтборыНажатие(Элемент)
	РазвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПередачаНаКомиссиюСвернутьОтборыНажатие(Элемент)
	СвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПередачаНаКомиссиюДекорацияРазвернутьОтборыНажатие(Элемент)
	РазвернутьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередачаНаКомиссиюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокПередачаНаКомиссию, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокПередачаНаКомиссию, СтруктураПараметров, "Организация");
	
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	
	ВидОперации = Неопределено;
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию");
	
	СтруктураПараметров.Вставить("ВидОперации", ВидОперации);
	
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетКомиссионераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокОтчетКомиссионера, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокОтчетКомиссионера, СтруктураПараметров, "Организация");
	
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура СписокПереоценкаУКомиссионераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокПереоценкаУКомиссионера, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокПереоценкаУКомиссионера, СтруктураПараметров, "Организация");
	
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура СписокСписаниеУКомиссионераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокСписаниеУКомиссионера, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокСписаниеУКомиссионера, СтруктураПараметров, "Организация");
	
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура СписокВозвратОтКомиссионераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокВозвратОтКомиссионера, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМетокВозвратОтКомиссионера, СтруктураПараметров, "Организация");
	
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	
	ВидОперации = Неопределено;
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера");
	
	СтруктураПараметров.Вставить("ВидОперации", ВидОперации);
	
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТоварыПереданныеНажатие(Элемент)
	ОткрытьОтчетТоварыПереданныеНаКомиссию()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасчетыНажатие(Элемент)
	ОткрытьОтчетРасчетыСКомиссионером()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТоварыПереданные1Нажатие(Элемент)
	ОткрытьОтчетТоварыПереданныеНаКомиссию()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасчеты1Нажатие(Элемент)
	ОткрытьОтчетРасчетыСКомиссионером()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТоварыПереданные2Нажатие(Элемент)
	ОткрытьОтчетТоварыПереданныеНаКомиссию()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасчеты2Нажатие(Элемент)
	ОткрытьОтчетРасчетыСКомиссионером()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТоварыПереданные3Нажатие(Элемент)
	ОткрытьОтчетТоварыПереданныеНаКомиссию()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасчеты3Нажатие(Элемент)
	ОткрытьОтчетРасчетыСКомиссионером()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТоварыПереданные4Нажатие(Элемент)
	ОткрытьОтчетТоварыПереданныеНаКомиссию()
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасчеты4Нажатие(Элемент)
	ОткрытьОтчетРасчетыСКомиссионером()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьОтчетТоварыПереданныеНаКомиссию()
	
	ТекущиеДанные = ТекущиеДанныеСпискаСтраницы();
	
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Вариант = РаботаСФормойДокументаКлиентСервер.ВариантОтчета("ЗапасыПереданные", "Ведомость");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ОтборРасшифровки = Новый Соответствие;
	ОтборРасшифровки.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	ПараметрыОткрытия.Вставить("ОтборРасшифровки", ОтборРасшифровки);
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(, Вариант, ПараметрыОткрытия)

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетРасчетыСКомиссионером()
	
	ТекущиеДанные = ТекущиеДанныеСпискаСтраницы();
	
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Вариант = РаботаСФормойДокументаКлиентСервер.ВариантОтчета("РасчетыСКомиссионерами", "РасчетыСКомиссионерами");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ОтборРасшифровки = Новый Соответствие;
	ОтборРасшифровки.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	ПараметрыОткрытия.Вставить("ОтборРасшифровки", ОтборРасшифровки);
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(, Вариант, ПараметрыОткрытия)

КонецПроцедуры
	
&НаСервере
Процедура УстановитьПодменюПодсистемыПечати()
	
	УстановитьПодменюПодсистемыПечатиЖурнала();
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыВозвратОтКомиссионера;
	ПараметрыРазмещения.ПрефиксГрупп = "ВозвратОтКомиссионера";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыПередачаНаКомиссию;
	ПараметрыРазмещения.ПрефиксГрупп = "ПередачаНаКомиссию";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыОтчетКомиссионера;
	ПараметрыРазмещения.ПрефиксГрупп = "ОтчетКомиссионера";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ОтчетКомиссионераПодменюПечать);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ПереоценкаТоваровНаКомиссии"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыПереоценкаУКомиссионера;
	ПараметрыРазмещения.ПрефиксГрупп = "ПереоценкаУКомиссионера";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПереоценкаУКомиссионераПодменюПечать);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыСписаниеУКомиссионера;
	ПараметрыРазмещения.ПрефиксГрупп = "СписаниеУКомиссионера";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.СписаниеУКомиссионераПодменюПечать);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодменюПодсистемыПечатиЖурнала()
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПараметрыРазмещения.ПрефиксГрупп = "ПН";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПараметрыРазмещения.ПрефиксГрупп = "РН";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПараметрыРазмещения.ПрефиксГрупп = "Отчет";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ОтчетПодменюПечать);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ПереоценкаТоваровНаКомиссии"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПараметрыРазмещения.ПрефиксГрупп = "Переоценка";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПереоценкаПодменюПечать);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПараметрыРазмещения.ПрефиксГрупп = "Списание";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.СписаниеПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Функция ТекущиеДанныеСпискаСтраницы()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда Возврат Элементы.СписокПередачаНаКомиссию.ТекущиеДанные;
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда Возврат Элементы.СписокОтчетКомиссионера.ТекущиеДанные;
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда Возврат Элементы.СписокПереоценкаУКомиссионера.ТекущиеДанные;
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда Возврат Элементы.СписокСписаниеУКомиссионера.ТекущиеДанные;
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда Возврат Элементы.СписокВозвратОтКомиссионера.ТекущиеДанные;
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда Возврат Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ВосстановитьОтборыСписковПриСозданиинаСервере()
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список, "Список");
	
	СтруктураИменЭлементов = Новый Структура("ФильтрыНастройкиИДопИнфо, ДекорацияРазвернутьОтборы, ПраваяПанель, ОтборПериод, ПредставлениеПериода");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаОтчетКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаОтчетКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаОтчетКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодОтчетКомиссионера";
	СтруктураИменЭлементов.ПредставлениеПериода = "ПредставлениеПериодаОтчетКомиссионера";
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокОтчетКомиссионера, "СписокОтчетКомиссионера", СтруктураИменЭлементов,,,, "ДанныеМетокОтчетКомиссионера");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаПередачаНаКомиссиюФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаПередачаНаКомиссиюДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаПередачаНаКомиссиюПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодПередачаНаКомиссию";
	СтруктураИменЭлементов.ПредставлениеПериода = "ПредставлениеПериодаПередачаНаКомиссию";
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокПередачаНаКомиссию, "СписокПередачаНаКомиссию", СтруктураИменЭлементов,,,, "ДанныеМетокПередачаНаКомиссию");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаПереоценкаУКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаПереоценкаУКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаПереоценкаУКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодПереоценкаУКомиссионера";
	СтруктураИменЭлементов.ПредставлениеПериода = "ПредставлениеПериодаПереоценкаУКомиссионера";
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокПереоценкаУКомиссионера, "СписокПереоценкаУКомиссионера", СтруктураИменЭлементов,,,, "ДанныеМетокПереоценкаУКомиссионера");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаСписаниеУКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаСписаниеУКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаСписаниеУКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодСписаниеУКомиссионера";
	СтруктураИменЭлементов.ПредставлениеПериода = "ПредставлениеПериодаСписаниеУКомиссионера";
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокСписаниеУКомиссионера, "СписокСписаниеУКомиссионера", СтруктураИменЭлементов,,,, "ДанныеМетокСписаниеУКомиссионера");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаВозвратОтКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаВозвратОтКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаВозвратОтКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодВозвратОтКомиссионера";
	СтруктураИменЭлементов.ПредставлениеПериода = "ПредставлениеПериодаВозвратОтКомиссионера";
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокВозвратОтКомиссионера, "СписокВозвратОтКомиссионера", СтруктураИменЭлементов,,,, "ДанныеМетокВозвратОтКомиссионера");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматДатыСписковПриСозданиинаСервере()
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(Список);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокОтчетКомиссионера);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокПередачаНаКомиссию);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокПереоценкаУКомиссионера);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокСписаниеУКомиссионера);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокВозвратОтКомиссионера);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПанелиКонтактнойИнформацииПриСозданиинаСервере()
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокПередачаНаКомиссиюКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
КонецПроцедуры

&НаКлиенте
Процедура СвернутьОтборы()
	ИмяГруппы = ПолучитьИмяГруппыПанели();
	НовоеЗначениеВидимость = НЕ Элементы[ИмяГруппы].Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость, СтрукутраИменЭлементовПанелиОтборов());
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьОтборы()
	ИмяГруппы = ПолучитьИмяГруппыПанели();
	НовоеЗначениеВидимость = НЕ Элементы[ИмяГруппы].Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость, СтрукутраИменЭлементовПанелиОтборов());
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяГруппыПанели()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда Возврат "СтраницаПередачаНаКомиссиюФильтрыНастройкиДопИнфо"
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда Возврат "СтраницаОтчетКомиссионераФильтрыНастройкиДопИнфо"
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда Возврат "СтраницаПереоценкаУКомиссионераФильтрыНастройкиДопИнфо"
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда Возврат "СтраницаСписаниеУКомиссионераФильтрыНастройкиДопИнфо"
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда Возврат "СтраницаВозвратОтКомиссионераФильтрыНастройкиДопИнфо"
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда Возврат "ФильтрыНастройкиИДопИнфо"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция ИмяСписка()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда Возврат "СписокПередачаНаКомиссию"
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда Возврат "СписокОтчетКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда Возврат "СписокПереоценкаУКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда Возврат "СписокСписаниеУКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда Возврат "СписокВозвратОтКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда Возврат "Список"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ИмяСпискаСеврер()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда Возврат "СписокПередачаНаКомиссию"
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда Возврат "СписокОтчетКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда Возврат "СписокПереоценкаУКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда Возврат "СписокСписаниеУКомиссионера"
		ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда Возврат "СписокВозвратОтКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда Возврат "Список"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция СтрукутраИменЭлементовПанелиОтборов()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	СтруктураИменПолей = Новый Структура("ФильтрыНастройкиИДопИнфо, ДекорацияРазвернутьОтборы, ПраваяПанель");
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда
		
		СтруктураИменПолей.ФильтрыНастройкиИДопИнфо = "СтраницаПередачаНаКомиссиюФильтрыНастройкиДопИнфо";
		СтруктураИменПолей.ДекорацияРазвернутьОтборы = "СтраницаПередачаНаКомиссиюДекорацияРазвернутьОтборы";
		СтруктураИменПолей.ПраваяПанель = "СтраницаПередачаНаКомиссиюПраваяПанель";
		
		Возврат СтруктураИменПолей;
		
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда
		
		СтруктураИменПолей.ФильтрыНастройкиИДопИнфо = "СтраницаОтчетКомиссионераФильтрыНастройкиДопИнфо";
		СтруктураИменПолей.ДекорацияРазвернутьОтборы = "СтраницаОтчетКомиссионераДекорацияРазвернутьОтборы";
		СтруктураИменПолей.ПраваяПанель = "СтраницаОтчетКомиссионераПраваяПанель";
		
		Возврат СтруктураИменПолей;

	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда
		
		СтруктураИменПолей.ФильтрыНастройкиИДопИнфо = "СтраницаПереоценкаУКомиссионераФильтрыНастройкиДопИнфо";
		СтруктураИменПолей.ДекорацияРазвернутьОтборы = "СтраницаПереоценкаУКомиссионераДекорацияРазвернутьОтборы";
		СтруктураИменПолей.ПраваяПанель = "СтраницаПереоценкаУКомиссионераПраваяПанель";
		
		Возврат СтруктураИменПолей;

	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда 
		
		СтруктураИменПолей.ФильтрыНастройкиИДопИнфо = "СтраницаСписаниеУКомиссионераФильтрыНастройкиДопИнфо";
		СтруктураИменПолей.ДекорацияРазвернутьОтборы = "СтраницаСписаниеУКомиссионераДекорацияРазвернутьОтборы";
		СтруктураИменПолей.ПраваяПанель = "СтраницаСписаниеУКомиссионераПраваяПанель";
		
		Возврат СтруктураИменПолей;
		
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда 
		
		СтруктураИменПолей.ФильтрыНастройкиИДопИнфо = "СтраницаВозвратОтКомиссионераФильтрыНастройкиДопИнфо";
		СтруктураИменПолей.ДекорацияРазвернутьОтборы = "СтраницаВозвратОтКомиссионераДекорацияРазвернутьОтборы";
		СтруктураИменПолей.ПраваяПанель = "СтраницаВозвратОтКомиссионераПраваяПанель";
		
		Возврат СтруктураИменПолей;

	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда 
		
		Возврат Неопределено;

	КонецЕсли;
	
	Возврат СтруктураИменПолей;
	
КонецФункции

&НаКлиенте
Функция СтрукутраИменПредставленияПериода()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда 
		Возврат Новый Структура("ОтборПериод, ПредставлениеПериода", "ОтборПериодПередачаНаКомиссию", "ПредставлениеПериодаПередачаНаКомиссию");
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда
		Возврат Новый Структура("ОтборПериод, ПредставлениеПериода", "ОтборПериодОтчетКомиссионера", "ПредставлениеПериодаОтчетКомиссионера");
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда
		Возврат Новый Структура("ОтборПериод, ПредставлениеПериода", "ОтборПериодПереоценкаУКомиссионера", "ПредставлениеПериодаПереоценкаУКомиссионера");
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда 
		Возврат Новый Структура("ОтборПериод, ПредставлениеПериода", "ОтборПериодСписаниеУКомиссионера", "ПредставлениеПериодаСписаниеУКомиссионера");
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда
		Возврат Новый Структура("ОтборПериод, ПредставлениеПериода", "ОтборПериодВозвратОтКомиссионера", "ПредставлениеПериодаВозвратОтКомиссионера");
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда 
		Возврат Новый Структура("ОтборПериод, ПредставлениеПериода", "ОтборПериод", "ПредставлениеПериода");
	КонецЕсли;
	
	Возврат Новый Структура("ОтборПериод, ПредставлениеПериода");
	
КонецФункции

&НаСервере
Функция ИмяТчДанныхМетокСеврер()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда Возврат "ДанныеМетокПередачаНаКомиссию"
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда Возврат "ДанныеМетокОтчетКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда Возврат "ДанныеМетокПереоценкаУКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда Возврат "ДанныеМетокСписаниеУКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда Возврат "ДанныеМетокВозвратОтКомиссионера"
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда Возврат "ДанныеМеток"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ИмяПанелиМетокОтбора()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПередачаНаКомиссию" Тогда Возврат "СтраницаПередачаНаКомиссиюПраваяПанель"
	ИначеЕсли ИмяСтраницы = "СтраницаОтчетКомиссионера" Тогда Возврат "СтраницаОтчетКомиссионераПраваяПанель"
	ИначеЕсли ИмяСтраницы = "СтраницаПереоценкаУКомиссионера" Тогда Возврат "СтраницаПереоценкаУКомиссионераПраваяПанель"
	ИначеЕсли ИмяСтраницы = "СтраницаСписаниеУКомиссионера" Тогда Возврат "СтраницаСписаниеУКомиссионераПраваяПанель"
	ИначеЕсли ИмяСтраницы = "СтраницаВозвратОтКомиссионера" Тогда Возврат "СтраницаВозвратОтКомиссионераПраваяПанель"
	ИначеЕсли ИмяСтраницы = "СтраницаЖурнал" Тогда Возврат "ПраваяПанель"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Обрабатывает событие активизации строки списка документов.
//
&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()
	
	ОбновитьПанельКонтактнойИнформацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПодменюПоТипуОбъектаСтроки()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ПНПодменюПечать.Видимость = Ложь;
		Элементы.РНПодменюПечать.Видимость = Ложь;
		Элементы.ПереоценкаПодменюПечать.Видимость = Ложь;
		Элементы.ОтчетПодменюПечать.Видимость = Ложь;
		Элементы.СписаниеПодменюПечать.Видимость = Ложь;
		
		Элементы.ЖурналПодменюЗаполнитьПередачаНаКомиссию.Видимость = Ложь;
		Элементы.ЖурналПодменюЗаполнитьОтчетКомиссионера.Видимость = Ложь;
		Элементы.ЖурналВозвратОтКомиссионераПодменюЗаполнить.Видимость = Ложь;
		
		Возврат
	КонецЕсли;
	
	Операция = ТекущиеДанные.Операция;
	
	ПодчиненныеЭлементыГруппы = Элементы.ГруппаВажныеКоманды.ПодчиненныеЭлементы;
	
	Для Каждого ЭлементМенюПечати Из ПодчиненныеЭлементыГруппы Цикл
		
		Если Не СтрЗаканчиваетсяНа(ЭлементМенюПечати.Имя, "Печать") Тогда Продолжить КонецЕсли;
		
		Элементы.ПНПодменюПечать.Видимость = ?(Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера"), Истина, Ложь);
		Элементы.РНПодменюПечать.Видимость = ?(Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию"), Истина, Ложь);
		Элементы.ПереоценкаПодменюПечать.Видимость = ?(Операция = "Переоценка товаров у комиссионера", Истина, Ложь);
		Элементы.ОтчетПодменюПечать.Видимость = ?(Операция = "Отчет комиссионера", Истина, Ложь);
		Элементы.СписаниеПодменюПечать.Видимость = ?(Операция = "Списание товаров у комиссионера", Истина, Ложь);
		
		Элементы.ЖурналПодменюЗаполнитьПередачаНаКомиссию.Видимость = ?(Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию"), Истина, Ложь);
		Элементы.ЖурналПодменюЗаполнитьОтчетКомиссионера.Видимость = ?(Операция = "Отчет комиссионера", Истина, Ложь);
		Элементы.ЖурналВозвратОтКомиссионераПодменюЗаполнить.Видимость = ?(Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера"), Истина, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область МеткиОтборов

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	ИмяСписка = ИмяСпискаСеврер();
	
	ИмяТчМеток = ИмяТчДанныхМетокСеврер();
	
	Если ГруппаРодительМетки = "ГруппаОтборОплата" Тогда
		ПредставлениеЗначения = РаботаСОтборами.СформироватьПредставлениеМеткиОплата(ВыбранноеЗначение);
		Если ИмяПоляОтбораСписка = "НомерКартинкиОплаты" Тогда
			ВыбранноеЗначение = РаботаСОтборами.НомерКартинкиПоСтатусуОплаты(ВыбранноеЗначение);
		КонецЕсли;
	ИначеЕсли ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения,,,ИмяТчМеток);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, ЭтотОбъект[ИмяСписка], ИмяПоляОтбораСписка,,,ИмяТчМеток);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СмещениеНаименованияМетки = ?(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаЖурнал", 1, 3);
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + СмещениеНаименованияМетки);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	ИмяСписка = ИмяСпискаСеврер();
	ИмяПравойПанели = ИмяПанелиМетокОтбора();
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, ЭтотОбъект[ИмяСписка], МеткаИД, ИмяСписка, ИмяТчДанныхМетокСеврер(),,ИмяПравойПанели);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	ПолучитьПредставлениеПериода(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПредставлениеПериода(СтандартнаяОбработка)
	ИмяСписка = ИмяСписка();
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, ИмяСписка, "Дата", СтрукутраИменПредставленияПериода());
КонецПроцедуры

&НаКлиенте
Процедура СтраницаВозвратОтКомиссионераПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	ИмяСписка = ИмяСписка();
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, ИмяСписка, "Дата", СтрукутраИменПредставленияПериода());
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСписаниеУКомиссионераПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	ПолучитьПредставлениеПериода(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПереоценкаУКомиссионераПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	ПолучитьПредставлениеПериода(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОтчетКомиссионераПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	ПолучитьПредставлениеПериода(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПередачаНаКомиссиюПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	ПолучитьПредставлениеПериода(СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "Список");
	
	СтруктураИменЭлементов = Новый Структура("ФильтрыНастройкиИДопИнфо, ДекорацияРазвернутьОтборы, ПраваяПанель, ОтборПериод");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаОтчетКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаОтчетКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаОтчетКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодОтчетКомиссионера";
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокОтчетКомиссионера", СтруктураИменЭлементов,,, "ДанныеМетокОтчетКомиссионера");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаПередачаНаКомиссиюФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаПередачаНаКомиссиюДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаПередачаНаКомиссиюПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодПередачаНаКомиссию";
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокПередачаНаКомиссию", СтруктураИменЭлементов,,, "ДанныеМетокПередачаНаКомиссию");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаПереоценкаУКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаПереоценкаУКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаПереоценкаУКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодПереоценкаУКомиссионера";
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокПереоценкаУКомиссионера", СтруктураИменЭлементов,,, "ДанныеМетокПереоценкаУКомиссионера");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаСписаниеУКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаСписаниеУКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаСписаниеУКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодСписаниеУКомиссионера";
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокСписаниеУКомиссионера", СтруктураИменЭлементов,,, "ДанныеМетокСписаниеУКомиссионера");
	
	СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо = "СтраницаВозвратОтКомиссионераФильтрыНастройкиДопИнфо";
	СтруктураИменЭлементов.ДекорацияРазвернутьОтборы = "СтраницаВозвратОтКомиссионераДекорацияРазвернутьОтборы";
	СтруктураИменЭлементов.ПраваяПанель = "СтраницаВозвратОтКомиссионераПраваяПанель";
	СтруктураИменЭлементов.ОтборПериод = "ОтборПериодВозвратОтКомиссионера";
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокВозвратОтКомиссионера", СтруктураИменЭлементов,,, "ДанныеМетокВозвратОтКомиссионера");
	
КонецПроцедуры

#КонецОбласти

#Область ПанельКонтактнойИнформации

// УНФ.ПанельКонтактнойИнформации
&НаСервере
Процедура ОбновитьПанельКонтактнойИнформацииСервер()
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
	
КонецПроцедуры
// Конец УНФ.ПанельКонтактнойИнформации

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ИмяТеущегоСписка = ИмяСписка();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы[ИмяТеущегоСписка]);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ИмяТеущегоСписка = ИмяСпискаСеврер();
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы[ИмяТеущегоСписка], Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ИмяТеущегоСписка = ИмяСписка();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы[ИмяТеущегоСписка]);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


