
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаПроизводители = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	Производители.Загрузить(ТаблицаПроизводители);
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ПроизводителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПроизводителиПроизводитель Тогда
		ТекущиеДанные = Элементы.Производители.ТекущиеДанные;
		
		ПоказатьЗначение(, ТекущиеДанные.Производитель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
