
Процедура УстановитьКартинку()
	Если Запись.Объект2ВышеОбъекта1 Тогда
		Элементы.КартинкаСвязи.Картинка=БиблиотекаКартинок.ПереместитьВверх;
	Иначе
		Элементы.КартинкаСвязи.Картинка=БиблиотекаКартинок.ПереместитьВниз;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВышестоящийОбъект=Неопределено;
	Если ЭтаФорма.Параметры.Свойство("ВышестоящийДокумент", ВышестоящийОбъект) Тогда
		Запись.Объект1=ВышестоящийОбъект;
	КонецЕсли;
	
	НижестоящийОбъект=Неопределено;
	Если ЭтаФорма.Параметры.Свойство("НижестоящийДокумент", НижестоящийОбъект) Тогда
		Запись.Объект2=НижестоящийОбъект;
		//Запись.Объект2ВышеОбъекта1=Истина;
	КонецЕсли;
	
	УстановитьКартинку();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИзменитьТипСвязиНажатие(Элемент)
	Запись.Объект2ВышеОбъекта1=НЕ Запись.Объект2ВышеОбъекта1;
	УстановитьКартинку();
КонецПроцедуры

