#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьОтчет(ПараметрыОтчета, АдресРезультата) Экспорт     
	
	Таб = Отчеты.СверкаОстатков_WMS_УНФ.Создать().СформироватьТаблицуОтчета(ПараметрыОтчета);
	Если Таб = Неопределено Тогда
		Возврат;
	Иначе
		ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(Таб, Новый СжатиеДанных), АдресРезультата);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПараметрыОтчета(Знач ПараметрыОтчета)
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.ДатаНачала)
		И ЗначениеЗаполнено(ПараметрыОтчета.ДатаОкончания)
		И ПараметрыОтчета.ДатаНачала > ПараметрыОтчета.ДатаОкончания Тогда
		ПараметрыОтчета.ДатаНачала=ПараметрыОтчета.ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли