#Область СлужебныеПроцедурыИФункции

// Функция производит заполнение списка наименований элементов формы задач
// Параметры:
//		Объект - содержит объект для которого производится заполнение
//		Вид процесса - содержит ссылку на вид процесса
//		ДействиеТипФормыЗадач - содержит тип формы задач (форма исполнения или форма контроля)
// Возвращаемое значение: Истина или Ложь
Функция ЗаполнитьСписокНаименованийЭлементовФормыЗадач(Объект, ВидПроцесса, ДействиеТипФормыЗадач) Экспорт
	
	Если ВидПроцесса.Пустая() Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ВидПроцесса.НаименованияЭлементовЗадач.Количество()=0 Тогда
		Возврат Ложь;
		
	КонецЕсли;

	ЭлементФормыИсполнителя=(ДействиеТипФормыЗадач=0);
	Объект.НаименованияЭлементовЗадач.Очистить();
	
	//заполним реквизиты формы задач
	
	ИспользоватьИностранныеНаименования=Ложь; //КП_ОбщееСервер.ИспользоватьИностранныеНаименованияВФормахПроцессов();

	СтруктураОтбора=Новый Структура("ЭлементФормы");
	
	Попытка
		
		Если ЭлементФормыИсполнителя Тогда
			
			СтруктураОтбора.ЭлементФормы="Исполнение: Кнопка ""Выполнить""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Кнопка ""Выполнить""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Исполнение: Кнопка ""Переадресовать""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Кнопка ""Переадресовать""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Исполнение: Кнопка ""Шаблон""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Кнопка ""Шаблон""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Объект.ДействиеИсполнительМожетПереадресоватьЗадачу;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Исполнение: Поле ""Исполнитель""";
			Если НайденныеСтроки.Количество()>0 Тогда					
				НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
				
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Поле ""Исполнитель""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Истина;
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Исполнение: Раздел ""Реквизиты процесса""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Раздел ""Реквизиты процесса""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Все: Гиперссылка ""Объекты""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество()>0 Тогда						
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Гиперссылка ""Объекты""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Все: Гиперссылка ""Список объектов""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);

			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Гиперссылка ""Список объектов""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=0;
				НоваяСтрока.Видимость=Истина;				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
		Иначе		
			//контроль
			СтруктураОтбора.ЭлементФормы="Контроль: Кнопка ""Выполнить""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Кнопка ""Выполнить""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=1;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
				
			СтруктураОтбора.ЭлементФормы="Контроль: Поле ""Контролер""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда						
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Поле ""Контролер""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=1;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;

			СтруктураОтбора.ЭлементФормы="Все: Гиперссылка ""Объекты""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Гиперссылка ""Объекты""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=1;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
			
			СтруктураОтбора.ЭлементФормы="Все: Гиперссылка ""Список объектов""";
			НайденныеСтроки=ВидПроцесса.НаименованияЭлементовЗадач.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда			
				НоваяСтрока=Объект.НаименованияЭлементовЗадач.Добавить();
				НоваяСтрока.ЭлементФормы="Гиперссылка ""Список объектов""";
				НоваяСтрока.НаименованиеЭлемента=НайденныеСтроки[0].НаименованиеЭлемента;
				НоваяСтрока.НаименованиеЭлементаИностранное=?(ИспользоватьИностранныеНаименования И НЕ ПустаяСтрока(НайденныеСтроки[0].НаименованиеЭлементаИностранное), НайденныеСтроки[0].НаименованиеЭлементаИностранное, НайденныеСтроки[0].НаименованиеЭлемента);
				НоваяСтрока.ТипФормы=1;
				НоваяСтрока.Видимость=Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке элементов форм задач (закладка ""Настройка форм"" в виде процесса) не найден элемент """+СтруктураОтбора.ЭлементФормы+""", перезаполните значения форм по умолчанию (кнопка внизу закладки ""Форма задачи"")");
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка заполнения наименований элементов формы!' en='Error occurs while filling elements name';")+ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
