#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//ДЕЙСТВИЕ
	Если ТипТочки=Перечисления.КП_ВидыТочекБизнесПроцесса.Действие Тогда
		
		Если ДействиеТипФормыЗадач=0 Тогда
			ПроверяемыеРеквизиты.Добавить("ДействиеОсновнойОтчетИсполнителей");
			
		ИначеЕсли ДействиеТипФормыЗадач=1 Тогда
			ПроверяемыеРеквизиты.Добавить("ДействиеКонтрольТочки");
			
		ИначеЕсли ИсточникИсполнителей=5 Тогда
			ПроверяемыеРеквизиты.Добавить("РабочаяГруппа");
			
		КонецЕсли;
		
	//УСЛОВИЕ
	ИначеЕсли ТипТочки=Перечисления.КП_ВидыТочекБизнесПроцесса.Условие Тогда
		Если ТипУсловиеФункция=3 ИЛИ ТипУсловиеФункция=5 Тогда
			//проверка контроля исполнителей или автоматическая проврека результатов
			ПроверяемыеРеквизиты.Добавить("УсловиеТочкаКонтроля");
			
		ИначеЕсли ТипУсловиеФункция=4 Тогда
			//доступность ресурсов
			Если ОбработкаТипДаты=1 Тогда
				//фиксированая дата
				ПроверяемыеРеквизиты.Добавить("ОбработкаРесурсыДата");
			ИначеЕсли ОбработкаТипДаты=2 Тогда
				//реквизит с датой
				ПроверяемыеРеквизиты.Добавить("ОбработкаРеквизитСДатой");
				
			КонецЕсли;

		КонецЕсли;
		
	//ПОДПРОЦЕСС
	ИначеЕсли ТипТочки=Перечисления.КП_ВидыТочекБизнесПроцесса.Подпроцесс Тогда
		ПроверяемыеРеквизиты.Добавить("ПодпроцессВид");
		
	//ОБРАБОТКА
	ИначеЕсли ТипТочки=Перечисления.КП_ВидыТочекБизнесПроцесса.Обработка Тогда
		Если ТипОбработки=1 И ОбработкаОтправитьНаПодпись Тогда
			ПроверяемыеРеквизиты.Добавить("ОбработкаПодписьТочкаАдресации");
			
		КонецЕсли;
		
		Если ТипОбработки=3 Тогда
			//обработка ресурсов
			Если ОбработкаТипДаты=1 Тогда
				//фиксированная дата
				ПроверяемыеРеквизиты.Добавить("ОбработкаРесурсыДата");
			ИначеЕсли ОбработкаТипДаты=2 Тогда
				//реквизит с датой
				ПроверяемыеРеквизиты.Добавить("ОбработкаРеквизитСДатой");
			КонецЕсли;
			
			Если ОбработкаРесурсыИсточник=1 Тогда
				ПроверяемыеРеквизиты.Добавить("ОбработкаРесурсыИспользоватьРеквизит");
			КонецЕсли;
				
		ИначеЕсли ТипОбработки=4 Тогда
			//таймер
			Если ОбработкаТипДаты=1 Тогда
				//фиксированная дата
				ПроверяемыеРеквизиты.Добавить("ОбработкаРесурсыДата");
			ИначеЕсли ОбработкаТипДаты=2 Тогда
				//реквизит с датой
				ПроверяемыеРеквизиты.Добавить("ОбработкаРеквизитСДатой");
			КонецЕсли;
			
		ИначеЕсли ТипОбработки=1 Тогда
			//список документов
			Если ОбработкаАвтоматическиПровестиДокументПодписи Тогда
				ПроверяемыеРеквизиты.Добавить("ОбработкаПодписьТочкаАдресации");
			КонецЕсли;
			
		ИначеЕсли ТипОбработки=6 Тогда
			//отправка сообщения
			Если ОбработкаИзменитьТочкуДействия=3 Тогда
				//установка нового исполнителя
				ПроверяемыеРеквизиты.Добавить("РеквизитСИсполнителем");
			КонецЕсли;
			
		ИначеЕсли ТипОбработки=5 Тогда
			//изменение точки
			ПроверяемыеРеквизиты.Добавить("УсловиеТочкаКонтроля");
						
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипТочки<>Перечисления.КП_ВидыТочекБизнесПроцесса.Разделение 
		 И ТипТочки<>Перечисления.КП_ВидыТочекБизнесПроцесса.Слияние
		 И ТипТочки<>Перечисления.КП_ВидыТочекБизнесПроцесса.Старт
		 И ТипТочки<>Перечисления.КП_ВидыТочекБизнесПроцесса.Завершение
	Тогда
		ПроверяемыеРеквизиты.Добавить("Наименование");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти