
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст        - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоПриобретение - Булево - исходящий признак соответствия документа типу «Приобретение товаров и услуг».
Процедура ЭтоДокументПриобретения(Контекст, ЭтоПриобретение) Экспорт
	
	ИнтеграцияМОТПУНФКлиентСервер.ЭтоДокументПриобретения(Контекст, ЭтоПриобретение);
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧек   - Булево - исходящий признак соответствия документа типу «Чек ККМ».
Процедура ЭтоЧекККМ(Контекст, ЭтоЧек) Экспорт
	
	ИнтеграцияМОТПУНФКлиентСервер.ЭтоЧекККМ(Контекст, ЭтоЧек);
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст      - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧекВозврат - Булево - исходящий признак соответствия документа типу «Чек ККМ возврат».
Процедура ЭтоЧекККМВозврат(Контекст, ЭтоЧекВозврат) Экспорт
	
	ИнтеграцияМОТПУНФКлиентСервер.ЭтоЧекККМВозврат(Контекст, ЭтоЧекВозврат);
	
КонецПроцедуры

#Область СерииНоменклатуры

// Возвращает через параметр коды статусов указания серий, соответствующих не заполненным сериям.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих не заполненным сериям.
Процедура СтатусыСерийСерияНеУказана(СтатусыСерияНеУказана) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
