// Общий модуль (выполняется на стороне сервера с повторным использованием) продукта "Конструктор процессов для 1С:УНФ"
// Разработчик Компания "Аналитика. Проекты и решения" +7 495 005-1653, https://kp-unf.ru

Функция ПолучитьТаблицуЦветов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СправочникЦветаЭлементов.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Справочник.КП_ЦветаЭлементов КАК СправочникЦветаЭлементов
	                    |ГДЕ
	                    |	СправочникЦветаЭлементов.ПометкаУдаления = ЛОЖЬ");
	
	ТаблицаЦветов=Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЦветов;
	
КонецФункции

Функция ПолучитьЦветИзЦветаОбъекта(ЦветСсылка) Экспорт
	Цвет=Новый Цвет(ЦветСсылка.Red, ЦветСсылка.Green, ЦветСсылка.Blue);
	Возврат Цвет;
КонецФункции