
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("Оповещение_ОтветНаВопросОткрытияРолика", ЭтотОбъект, Новый Структура),
		"Открыть видеоролик в интернете?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветНаВопросОткрытияРолика(Результат, ДопПараметры) Экспорт
	Если Результат=КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
	ПараметрыФормы = Новый Структура("АдресСтраницы", "https://youtu.be/d1MJgxWboRI");
	ОткрытьФорму("Обработка.КП_Информация.Форма.ФормаБраузера", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	#Иначе
	НачатьЗапускПриложения(Новый ОписаниеОповещения, "https://kp-unf.ru/video");
	#КонецЕсли
	
КонецПроцедуры
