
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	Список.Параметры.УстановитьЗначениеПараметра("УсловиеСтарта", Перечисления.СобытияРабочегоПроцесса.КП_Задача);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
	
	ЗначенияЗаполнения=Новый Структура;
	ЗначенияЗаполнения.Вставить("УсловиеСтарта", ПредопределенноеЗначение("Перечисление.СобытияРабочегоПроцесса.КП_Задача"));
	
	ПараметрыФормы=Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);	
	ОткрытьФорму("Справочник.ПравилаРабочегоПроцесса.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеВТочкеДействия(Команда)
	ОткрытьФорму("ОбщаяФорма.КП_ПравилаОбработкиСобытийСозданиеПоЗадаче",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="КП_ПравилоОбработкиСобытияСоздано" Тогда
		ОбновитьСписок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодробнееНаСайтеНажатие(Элемент)
	КП_ОбщееКлиент.ОткрытьИнтернетАдрес("https://kp-unf.ru/notification.html");

КонецПроцедуры

