#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаДемоБазаНаСервере=КП_ОбщееСервер.КонстантаДополнительныеПараметрыПолучить("ЭтаДемоБазаНаСервере");
	Если ЭтаДемоБазаНаСервере=Неопределено Тогда
		ЭтаДемоБазаНаСервере=Ложь;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
	Элементы.ДекорацияОбщедоступныйСервер.Видимость=ЭтаДемоБазаНаСервере;
	Элементы.ГруппаТонкийКлиент.Видимость=Истина;
	#Иначе
	Элементы.ДекорацияОбщедоступныйСервер.Видимость=Ложь;
	Элементы.ГруппаТонкийКлиент.Видимость=Ложь;
	#КонецЕсли

	Элементы.ДекорацияПолныеПрава.Видимость=НЕ КП_ОбщееСерверПС.ЭтоРольПолныеПрава();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключениеДемоВерсииНажатие(Элемент)
	КП_ОбщееКлиент.ОткрытьИнтернетАдрес("https://kp-unf.ru/thin-client.html");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСкачатьРуководствоПользователяНажатие(Элемент)
	КП_ОбщееКлиент.ОткрытьИнтернетАдрес("https://kp-unf.ru/unf-rukovodstvo.html");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВидеороликНажатие(Элемент)
	КП_ОбщееКлиент.ОткрытьИнтернетАдрес("https://kp-unf.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗадатьВопросНажатие(Элемент)
	ОткрытьФорму("Обработка.КП_ВопросыРазработчикам.Форма",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


#КонецОбласти
